AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/*
 * Copyright (c) 2026, Ambiq Micro, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 * contributors may be used to endorse or promote products derived from this
 * software without specific prior written permission.
 *
 * Third party software included in this distribution is subject to the
 * additional license terms as defined in the /docs/licenses directory.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * @file     apollo510L.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     Mon Mar 30 15:29:35 2026
 * @note     Generated by SVDConv V3.3.47
 *           from File 'apollo510L.svd',
 *           last modified on Mon Mar 30 15:29:34 2026
 */


/** @addtogroup Ambiq Micro
  * @{
  */


/** @addtogroup apollo510L
  * @{
  */


#ifndef APOLLO510L_H
#define APOLLO510L_H

#ifdef __cplusplus
extern "C" {
#endif


/** @addtogroup Configuration_of_CMSIS
  * @{
  */



/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* =======================================  ARM Cortex-M55 Specific Interrupt Numbers  ======================================= */
  Reset_IRQn                = -15,              /*!< -15  Reset Vector, invoked on Power up and warm reset                     */
  NonMaskableInt_IRQn       = -14,              /*!< -14  Non maskable Interrupt, cannot be stopped or preempted               */
  HardFault_IRQn            = -13,              /*!< -13  Hard Fault, all classes of Fault                                     */
  MemoryManagement_IRQn     = -12,              /*!< -12  Memory Management, MPU mismatch, including Access Violation
                                                     and No Match                                                              */
  BusFault_IRQn             = -11,              /*!< -11  Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                     related Fault                                                             */
  UsageFault_IRQn           = -10,              /*!< -10  Usage Fault, i.e. Undef Instruction, Illegal State Transition        */
  SecureFault_IRQn          =  -9,              /*!< -9 Secure Fault Handler                                                   */
  SVCall_IRQn               =  -5,              /*!< -5 System Service Call via SVC instruction                                */
  DebugMonitor_IRQn         =  -4,              /*!< -4 Debug Monitor                                                          */
  PendSV_IRQn               =  -2,              /*!< -2 Pendable request for system service                                    */
  SysTick_IRQn              =  -1,              /*!< -1 System Tick Timer                                                      */
/* =========================================  apollo510L Specific Interrupt Numbers  ========================================= */
  BROWNOUT_IRQn             =   0,              /*!< 0  BROWNOUT_IRQ                                                           */
  SECURE_WDT_IRQn           =   1,              /*!< 1  SECURE_WDT_IRQ                                                         */
  SECURE_RTC_IRQn           =   2,              /*!< 2  SECURE_RTC_IRQ                                                         */
  VCOMP_IRQn                =   3,              /*!< 3  VCOMP_IRQ                                                              */
  IOMSTR0_IRQn              =   6,              /*!< 6  IOMSTR0_IRQ                                                            */
  IOMSTR1_IRQn              =   7,              /*!< 7  IOMSTR1_IRQ                                                            */
  IOMSTR2_IRQn              =   8,              /*!< 8  IOMSTR2_IRQ                                                            */
  IOMSTR3_IRQn              =   9,              /*!< 9  IOMSTR3_IRQ                                                            */
  IOMSTR4_IRQn              =  10,              /*!< 10 IOMSTR4_IRQ                                                            */
  IOMSTR5_IRQn              =  11,              /*!< 11 IOMSTR5_IRQ                                                            */
  UART0_IRQn                =  15,              /*!< 15 UART0_IRQ                                                              */
  UART1_IRQn                =  16,              /*!< 16 UART1_IRQ                                                              */
  IPC_PEND_MSG_IRQn         =  17,              /*!< 17 IPC_PEND_MSG_IRQ                                                       */
  IPC_ERR_IRQn              =  18,              /*!< 18 IPC_ERR_IRQ                                                            */
  ADC_IRQn                  =  19,              /*!< 19 ADC_IRQ                                                                */
  MSPI0_IRQn                =  20,              /*!< 20 MSPI0_IRQ                                                              */
  MSPI1_IRQn                =  21,              /*!< 21 MSPI1_IRQ                                                              */
  MSPI2_IRQn                =  22,              /*!< 22 MSPI2_IRQ                                                              */
  CLKGEN_IRQn               =  23,              /*!< 23 CLKGEN_IRQ                                                             */
  CRYPTOSEC_IRQn            =  24,              /*!< 24 CRYPTOSEC_IRQ                                                          */
  SDIO0_IRQn                =  26,              /*!< 26 SDIO0_IRQ                                                              */
  USB0_IRQn                 =  27,              /*!< 27 USB0_IRQ                                                               */
  GPU_IRQn                  =  28,              /*!< 28 GPU_IRQ                                                                */
  DC_IRQn                   =  29,              /*!< 29 DC_IRQ                                                                 */
  DSI_IRQn                  =  30,              /*!< 30 DSI_IRQ                                                                */
  WDT_IRQn                  =  31,              /*!< 31 WDT_IRQ                                                                */
  SECURE_STIMER_CMPR0_IRQn  =  32,              /*!< 32 SECURE_STIMER_CMPR0_IRQ                                                */
  SECURE_STIMER_CMPR1_IRQn  =  33,              /*!< 33 SECURE_STIMER_CMPR1_IRQ                                                */
  SECURE_STIMER_CMPR2_IRQn  =  34,              /*!< 34 SECURE_STIMER_CMPR2_IRQ                                                */
  SECURE_STIMER_CMPR3_IRQn  =  35,              /*!< 35 SECURE_STIMER_CMPR3_IRQ                                                */
  SECURE_STIMER_CMPR4_IRQn  =  36,              /*!< 36 SECURE_STIMER_CMPR4_IRQ                                                */
  SECURE_STIMER_CMPR5_IRQn  =  37,              /*!< 37 SECURE_STIMER_CMPR5_IRQ                                                */
  SECURE_STIMER_CMPR6_IRQn  =  38,              /*!< 38 SECURE_STIMER_CMPR6_IRQ                                                */
  SECURE_STIMER_CMPR7_IRQn  =  39,              /*!< 39 SECURE_STIMER_CMPR7_IRQ                                                */
  SECURE_STIMER_OVF_IRQn    =  40,              /*!< 40 SECURE_STIMER_OVF_IRQ                                                  */
  RTC_IRQn                  =  41,              /*!< 41 RTC_IRQ                                                                */
  I2S0_IRQn                 =  44,              /*!< 44 I2S0_IRQ                                                               */
  PDM0_IRQn                 =  48,              /*!< 48 PDM0_IRQ                                                               */
  GPIO0_001F_IRQn           =  56,              /*!< 56 GPIO0_001F_IRQ                                                         */
  GPIO0_203F_IRQn           =  57,              /*!< 57 GPIO0_203F_IRQ                                                         */
  GPIO0_405F_IRQn           =  58,              /*!< 58 GPIO0_405F_IRQ                                                         */
  GPIO0_607F_IRQn           =  59,              /*!< 59 GPIO0_607F_IRQ                                                         */
  GPIO0_809F_IRQn           =  60,              /*!< 60 GPIO0_809F_IRQ                                                         */
  GPIO0_A0BF_IRQn           =  61,              /*!< 61 GPIO0_A0BF_IRQ                                                         */
  GPIO0_C0DF_IRQn           =  62,              /*!< 62 GPIO0_C0DF_IRQ                                                         */
  GPIO0_E0FF_IRQn           =  63,              /*!< 63 GPIO0_E0FF_IRQ                                                         */
  SECURE_TIMER0_IRQn        =  67,              /*!< 67 SECURE_TIMER0_IRQ                                                      */
  SECURE_TIMER1_IRQn        =  68,              /*!< 68 SECURE_TIMER1_IRQ                                                      */
  SECURE_TIMER2_IRQn        =  69,              /*!< 69 SECURE_TIMER2_IRQ                                                      */
  SECURE_TIMER3_IRQn        =  70,              /*!< 70 SECURE_TIMER3_IRQ                                                      */
  SECURE_TIMER4_IRQn        =  71,              /*!< 71 SECURE_TIMER4_IRQ                                                      */
  SDIO1_IRQn                =  84,              /*!< 84 SDIO1_IRQ                                                              */
  I3C0_IRQn                 =  85,              /*!< 85 I3C0_IRQ                                                               */
  SOFTWARE0_IRQn            =  92,              /*!< 92 SOFTWARE0_IRQ                                                          */
  SOFTWARE1_IRQn            =  93,              /*!< 93 SOFTWARE1_IRQ                                                          */
  SOFTWARE2_IRQn            =  94,              /*!< 94 SOFTWARE2_IRQ                                                          */
  SOFTWARE3_IRQn            =  95,              /*!< 95 SOFTWARE3_IRQ                                                          */
  IOSLAVEFD0_IRQn           =  96,              /*!< 96 IOSLAVEFD0_IRQ                                                         */
  IOSLAVEFDACC0_IRQn        =  97,              /*!< 97 IOSLAVEFDACC0_IRQ                                                      */
  IOSLAVEFD1_IRQn           =  98,              /*!< 98 IOSLAVEFD1_IRQ                                                         */
  IOSLAVEFDACC1_IRQn        =  99,              /*!< 99 IOSLAVEFDACC1_IRQ                                                      */
  STIMER_CMPR0_IRQn         = 100,              /*!< 100  STIMER_CMPR0_IRQ                                                     */
  STIMER_CMPR1_IRQn         = 101,              /*!< 101  STIMER_CMPR1_IRQ                                                     */
  STIMER_CMPR2_IRQn         = 102,              /*!< 102  STIMER_CMPR2_IRQ                                                     */
  STIMER_CMPR3_IRQn         = 103,              /*!< 103  STIMER_CMPR3_IRQ                                                     */
  STIMER_CMPR4_IRQn         = 104,              /*!< 104  STIMER_CMPR4_IRQ                                                     */
  STIMER_CMPR5_IRQn         = 105,              /*!< 105  STIMER_CMPR5_IRQ                                                     */
  STIMER_CMPR6_IRQn         = 106,              /*!< 106  STIMER_CMPR6_IRQ                                                     */
  STIMER_CMPR7_IRQn         = 107,              /*!< 107  STIMER_CMPR7_IRQ                                                     */
  STIMER_OVF_IRQn           = 108,              /*!< 108  STIMER_OVF_IRQ                                                       */
  TIMER0_IRQn               = 109,              /*!< 109  TIMER0_IRQ                                                           */
  TIMER1_IRQn               = 110,              /*!< 110  TIMER1_IRQ                                                           */
  TIMER2_IRQn               = 111,              /*!< 111  TIMER2_IRQ                                                           */
  TIMER3_IRQn               = 112,              /*!< 112  TIMER3_IRQ                                                           */
  TIMER4_IRQn               = 113,              /*!< 113  TIMER4_IRQ                                                           */
  TIMER5_IRQn               = 114,              /*!< 114  TIMER5_IRQ                                                           */
  TIMER6_IRQn               = 115,              /*!< 115  TIMER6_IRQ                                                           */
  TIMER7_IRQn               = 116,              /*!< 116  TIMER7_IRQ                                                           */
  TIMER8_IRQn               = 117,              /*!< 117  TIMER8_IRQ                                                           */
  TIMER9_IRQn               = 118,              /*!< 118  TIMER9_IRQ                                                           */
  TIMER10_IRQn              = 119,              /*!< 119  TIMER10_IRQ                                                          */
  TIMER11_IRQn              = 120,              /*!< 120  TIMER11_IRQ                                                          */
  TIMER12_IRQn              = 121,              /*!< 121  TIMER12_IRQ                                                          */
  TIMER13_IRQn              = 122,              /*!< 122  TIMER13_IRQ                                                          */
  TIMER14_IRQn              = 123,              /*!< 123  TIMER14_IRQ                                                          */
  TIMER15_IRQn              = 124,              /*!< 124  TIMER15_IRQ                                                          */
  GPIO1_001F_IRQn           = 125,              /*!< 125  GPIO1_001F_IRQ                                                       */
  GPIO1_203F_IRQn           = 126,              /*!< 126  GPIO1_203F_IRQ                                                       */
  GPIO1_405F_IRQn           = 127,              /*!< 127  GPIO1_405F_IRQ                                                       */
  GPIO1_607F_IRQn           = 128,              /*!< 128  GPIO1_607F_IRQ                                                       */
  GPIO1_809F_IRQn           = 129,              /*!< 129  GPIO1_809F_IRQ                                                       */
  GPIO1_A0BF_IRQn           = 130,              /*!< 130  GPIO1_A0BF_IRQ                                                       */
  GPIO1_C0DF_IRQn           = 131,              /*!< 131  GPIO1_C0DF_IRQ                                                       */
  GPIO1_E0FF_IRQn           = 132,              /*!< 132  GPIO1_E0FF_IRQ                                                       */
  FP_IRQn                   = 133,              /*!< 133  FP_IRQ                                                               */
  OTP_IRQn                  = 134,              /*!< 134  OTP_IRQ                                                              */
  RSVD_LAST_IRQn            = 143,              /*!< 143  RSVD_LAST_IRQ                                                        */
  MAX_IRQn                  = 144               /*!< 144  Not a valid IRQ. The maximum IRQ is this value - 1.                  */
} IRQn_Type;



/* =========================================================================================================================== */
/* ================                           Processor and Core Peripheral Section                           ================ */
/* =========================================================================================================================== */

/* ==========================  Configuration of the ARM Cortex-M55 Processor and Core Peripherals  =========================== */
#define __CM55_REV                 0x0101U      /*!< CM55 Core Revision                                                        */
#define __NVIC_PRIO_BITS               4        /*!< Number of Bits used for Priority Levels                                   */
#define __Vendor_SysTickConfig         0        /*!< Set to 1 if different SysTick Config is used                              */
#define __VTOR_PRESENT                 1        /*!< Set to 1 if CPU supports Vector Table Offset Register                     */
#define __MPU_PRESENT                  1        /*!< MPU present                                                               */
#define __FPU_PRESENT                  1        /*!< FPU present                                                               */
#define __FPU_DP                       1        /*!< Double Precision FPU                                                      */
#define __DSP_PRESENT                  1        /*!< DSP extension present                                                     */
#define __ICACHE_PRESENT               1        /*!< Instruction Cache present                                                 */
#define __DCACHE_PRESENT               1        /*!< Data Cache present                                                        */
#define __ITCM_PRESENT                 1        /*!< Instruction TCM present                                                   */
#define __DTCM_PRESENT                 1        /*!< Data TCM present                                                          */
#define __SAUREGION_PRESENT            1        /*!< SAU region present                                                        */
#define __PMU_PRESENT                  1        /*!< PMU present                                                               */
#define __PMU_NUM_EVENTCNT             8        /*!< PMU Event Counters                                                        */


/** @} */ /* End of group Configuration_of_CMSIS */

