AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#include "core_cm55.h"                          /*!< ARM Cortex-M55 processor and core peripherals                             */
#include "system_apollo510L.h"                  /*!< apollo510L System                                                         */

#ifndef __IM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __IM   __I
#endif
#ifndef __OM                                    /*!< Fallback for older CMSIS versions                                         */
  #define __OM   __O
#endif
#ifndef __IOM                                   /*!< Fallback for older CMSIS versions                                         */
  #define __IOM  __IO
#endif


/* ========================================  Start of section using anonymous unions  ======================================== */
#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* =========================================================================================================================== */
/* ================                            Device Specific Peripheral Section                             ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripherals
  * @{
  */



/* =========================================================================================================================== */
/* ================                                            ADC                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief Analog Digital Converter Control (ADC)
  */

typedef struct {                                /*!< ADC Structure                                                             */

  union {
    __IOM uint32_t CFG;                         /*!< The ADC Configuration Register contains the software control
                                                     for selecting the clock frequency used for the SAR conversions,
                                                     the trigger polarity, the trigger select, the reference
                                                     voltage select, the low power mode, the operating mode
                                                     (single scan per trigger vs. repeating mode) and ADC enable.              */

    struct {
      __IOM uint32_t ADCEN      : 1;            /*!< This bit enables the ADC module. While the ADC is enabled, the
                                                     ADCCFG and SLOT Configuration register settings must remain
                                                     stable and unchanged. All configuration register settings,
                                                     slot configuration settings and window comparison settings
                                                     should be written prior to setting the ADCEN bit to '1'.                  */
            uint32_t            : 1;
      __IOM uint32_t RPTEN      : 1;            /*!< This bit enables Repeating Scan Mode.                                     */
      __IOM uint32_t LPMODE     : 1;            /*!< Select power mode to enter between active scans.                          */
      __IOM uint32_t CKMODE     : 1;            /*!< Clock mode register                                                       */
            uint32_t            : 7;
      __IOM uint32_t DFIFORDEN  : 1;            /*!< Destructive FIFO Read Enable. Setting this will enable FIFO
                                                     pop upon reading the FIFOPR register.                                     */
            uint32_t            : 3;
      __IOM uint32_t TRIGSEL    : 3;            /*!< Select the ADC trigger source.                                            */
      __IOM uint32_t TRIGPOL    : 1;            /*!< This bit selects the ADC trigger polarity for external off chip
                                                     triggers.                                                                 */
      __IOM uint32_t RPTTRIGSEL : 1;            /*!< This bit selects which periodic trigger to use with RPTEN =
                                                     1.                                                                        */
            uint32_t            : 3;
      __IOM uint32_t PWRDLYSSEL : 1;            /*!< Power Delay shift factor select -                                         */
            uint32_t            : 2;
      __IOM uint32_t GNDSELEN   : 1;            /*!< Enables input mux to select ADC input ground for sampling. If
                                                     == 0, use analog low-power ground. If == 1, bring in external
                                                     ground.                                                                   */
      __IOM uint32_t GNDSEL     : 3;            /*!< Select 1 of 8 external GPIO connections to provide ADC input
                                                     reference ground for sampling.                                            */
            uint32_t            : 1;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< This register indicates the basic power status for the ADC.
                                                     For detailed power status, see the power control power
                                                     status register. ADC power mode 0 indicates the ADC is
                                                     in its full power state and is ready to process scans.
                                                     ADC Power mode 1 indicates the ADC enabled and in a low
                                                     power state.                                                              */

