AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SLEN4      : 1;            /*!< This bit enables slot 4 for ADC conversions.                              */
      __IOM uint32_t WCEN4      : 1;            /*!< This bit enables the window compare function for slot 4.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL4     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE4    : 2;            /*!< Set the Precision Mode For Slot 4.                                        */
      __IOM uint32_t ADSEL4     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
      __IOM uint32_t TRKCYC4    : 10;           /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 1023 specifies 1028 cycles.)                                 */
            uint32_t            : 1;
    } SL4CFG_b;
  } ;

  union {
    __IOM uint32_t SL5CFG;                      /*!< Slot 5 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN5      : 1;            /*!< This bit enables slot 5 for ADC conversions.                              */
      __IOM uint32_t WCEN5      : 1;            /*!< This bit enables the window compare function for slot 5.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL5     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE5    : 2;            /*!< Set the Precision Mode For Slot 5.                                        */
      __IOM uint32_t ADSEL5     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
      __IOM uint32_t TRKCYC5    : 10;           /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 1023 specifies 1028 cycles.)                                 */
            uint32_t            : 1;
    } SL5CFG_b;
  } ;

  union {
    __IOM uint32_t SL6CFG;                      /*!< Slot 6 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN6      : 1;            /*!< This bit enables slot 6 for ADC conversions.                              */
      __IOM uint32_t WCEN6      : 1;            /*!< This bit enables the window compare function for slot 6.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL6     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE6    : 2;            /*!< Set the Precision Mode For Slot 6.                                        */
      __IOM uint32_t ADSEL6     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
      __IOM uint32_t TRKCYC6    : 10;           /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 1023 specifies 1028 cycles.)                                 */
            uint32_t            : 1;
    } SL6CFG_b;
  } ;

  union {
    __IOM uint32_t SL7CFG;                      /*!< Slot 7 Configuration                                                      */

    struct {
      __IOM uint32_t SLEN7      : 1;            /*!< This bit enables slot 7 for ADC conversions.                              */
      __IOM uint32_t WCEN7      : 1;            /*!< This bit enables the window compare function for slot 7.                  */
            uint32_t            : 6;
      __IOM uint32_t CHSEL7     : 4;            /*!< Select one of the 11 channel inputs for this slot.                        */
            uint32_t            : 4;
      __IOM uint32_t PRMODE7    : 2;            /*!< Set the Precision Mode For Slot 7.                                        */
      __IOM uint32_t ADSEL7     : 3;            /*!< Select the number of measurements to average in the accumulate
                                                     divide module for this slot.                                              */
      __IOM uint32_t TRKCYC7    : 10;           /*!< Set additional input signal sampling/tracking time to the specified
                                                     number of ADC clock cycles. (Note that a value of 0 in
                                                     this register specifies the minimum required 5 cycles.
                                                     A maximum of 1023 specifies 1028 cycles.)                                 */
            uint32_t            : 1;
    } SL7CFG_b;
  } ;

  union {
    __IOM uint32_t WULIM;                       /*!< Sets the window comparator upper limit                                    */

