AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t LZXC       : 12;           /*!< Sets the lower integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
      __IOM uint32_t UZXC       : 12;           /*!< Sets the upper integer sample limit for the ZX comparator. Note
                                                     that these values are raw ADC values whose bounds are specified
                                                     by PRMODE but not maniupulated by accumulate/divide logic.
                                                     Therefore, there is no oversampling and no binary point
                                                     in this value. Samples must enter the range between UZXC
                                                     and LZXC in order for a zero crossing to be recognized.                   */
            uint32_t            : 4;
    } ZXLIM_b;
  } ;

  union {
    __IOM uint32_t GAINCFG;                     /*!< Configures the PGA gain                                                   */

    struct {
      __IOM uint32_t PGACTRLEN  : 1;            /*!< Enable PGA gain updates.                                                  */
            uint32_t            : 3;
      __IOM uint32_t UPDATEMODE : 1;            /*!< PGA update mode                                                           */
            uint32_t            : 27;
    } GAINCFG_b;
  } ;

  union {
    __IOM uint32_t GAIN;                        /*!< Specifies the high gain code                                              */

    struct {
      __IOM uint32_t LGA        : 7;            /*!< Specifies the low gain code (0 to 102 decimal specifies -6.0
                                                     dB to 45.0 dB in half-dB increments) for channel A (slot
                                                     0).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGADELTA   : 7;            /*!< Specifies the high gain code as an delta from the LGA field
                                                     for channel A (slot 1).                                                   */
            uint32_t            : 1;
      __IOM uint32_t LGB        : 7;            /*!< Specifies the low gain code (0 to 102 decimal specifies -6.0
                                                     dB to 45.0 dB in half-dB increments) for channel B (slot
                                                     2).                                                                       */
            uint32_t            : 1;
      __IOM uint32_t HGBDELTA   : 7;            /*!< Specifies the high gain code as an delta from the LGB field
                                                     for channel B (slot 3).                                                   */
            uint32_t            : 1;
    } GAIN_b;
  } ;
  __IM  uint32_t  RESERVED1[13];

  union {
    __IOM uint32_t SATCFG;                      /*!< Configure the saturation comparator                                       */

    struct {
      __IOM uint32_t SATEN      : 1;            /*!< Enable the saturation comparator                                          */
            uint32_t            : 3;
      __IOM uint32_t SATCHANSEL : 1;            /*!< Select which slots to use for saturation measurement. 0 enables
                                                     saturation on slots 0 and 2. 1 enables saturation on slots
                                                     1 and 3.                                                                  */
            uint32_t            : 27;
    } SATCFG_b;
  } ;

  union {
    __IOM uint32_t SATLIM;                      /*!< Sets the saturation comparator limits                                     */

    struct {
      __IOM uint32_t LSATC      : 12;           /*!< Sets the lower integer sample limit for the saturation comparator.
                                                     Note that these values are raw ADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
      __IOM uint32_t USATC      : 12;           /*!< Sets the upper integer sample limit for the saturation comparator.
                                                     Note that these values are raw ADC values whose bounds
                                                     are specified by PRMODE but not manipulated by accumulate/divide
                                                     logic. Therefore, there is no oversampling and no binary
                                                     point in this value.                                                      */
            uint32_t            : 4;
    } SATLIM_b;
  } ;

  union {
    __IOM uint32_t SATMAX;                      /*!< Sets the limits for saturation comparator event counter                   */

    struct {
      __IOM uint32_t SATCAMAX   : 12;           /*!< Sets the number of saturation events that may occur before a
                                                     SATCA interrupt occurs. Once this interrupt occurs, the
                                                     saturation event counter must be cleared by writing the
                                                     SATCLR register. A value of 0 is invalid and will cause
                                                     the saturation interrupt to assert immediately.                           */
            uint32_t            : 4;
      __IOM uint32_t SATCBMAX   : 12;           /*!< Sets the number of saturation events that may occur before a
                                                     SATCB interrupt occurs. Once this interrupt occurs, the
                                                     saturation event counter must be cleared by writing the
                                                     SATCLR register. A value of 0 is invalid and will cause
                                                     the saturation interrupt to assert immediately.                           */
            uint32_t            : 4;
    } SATMAX_b;
  } ;

  union {
    __IOM uint32_t SATCLR;                      /*!< Clears the saturation event counter registers                             */

