AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t TRACECLKEN : 1;            /*!< Trace clock is on                                                         */
      __IOM uint32_t ADCCLKEN   : 1;            /*!< ADC clock is on                                                           */
      __IOM uint32_t APBACTIVITYCLKEN : 1;      /*!< APB clock is on in the Activity power domain                              */
      __IOM uint32_t APBAOHCLKEN : 1;           /*!< APB clock is on in the AOH power domain                                   */
      __IOM uint32_t APBAOLCLKEN : 1;           /*!< APB clock is on in the AOL power domain                                   */
      __IOM uint32_t APBAPBCLKEN : 1;           /*!< APB clock is on in the APB power domain                                   */
      __IOM uint32_t APBAUDCLKEN : 1;           /*!< APB clock is on in the AUD power domain                                   */
      __IOM uint32_t APBCRYPTOCLKEN : 1;        /*!< APB clock is on in the Crypto power domain                                */
      __IOM uint32_t APBGFXCLKEN : 1;           /*!< APB clock is on in the GFX power domain                                   */
      __IOM uint32_t APBHCPACLKEN : 1;          /*!< APB clock is on in the HCP A power domain                                 */
      __IOM uint32_t APBHCPBCLKEN : 1;          /*!< APB clock is on in the HCP B power domain                                 */
      __IOM uint32_t APBHCPCCLKEN : 1;          /*!< APB clock is on in the HCP C power domain                                 */
      __IOM uint32_t APBIOSCLKEN : 1;           /*!< APB clock is on in the IOS power domain                                   */
      __IOM uint32_t APBMSPI0CLKEN : 1;         /*!< APB clock is on in the MSPI0 power domain                                 */
      __IOM uint32_t APBMSPI1CLKEN : 1;         /*!< APB clock is on in the MSPI1 power domain                                 */
      __IOM uint32_t APBMSPI2CLKEN : 1;         /*!< APB clock is on in the MSPI2 power domain                                 */
      __IOM uint32_t APBMSPI3CLKEN : 1;         /*!< This field is reserved                                                    */
      __IOM uint32_t APBSDIO0CLKEN : 1;         /*!< APB clock is on in the SDOI0 power domain                                 */
      __IOM uint32_t APBSDIO1CLKEN : 1;         /*!< APB clock is on in the SDIO1 power domain                                 */
      __IOM uint32_t APBUSBCLKEN : 1;           /*!< APB clock is on in the USB power domain                                   */
      __IOM uint32_t APBDISPCLKEN : 1;          /*!< APB clock is on in the DISP power domain                                  */
      __IOM uint32_t DSPI2S0CLKEN : 1;          /*!< DSP I2S0 clock is on                                                      */
      __IOM uint32_t DSPI2S0REFCLKEN : 1;       /*!< DSP I2S0 reference clock is on                                            */
      __IOM uint32_t DSPPDMCLKEN : 1;           /*!< DSP PDM clock is on                                                       */
      __IOM uint32_t GFXCLKEN   : 1;            /*!< GFX core clock is on                                                      */
      __IOM uint32_t IOM0CLKEN  : 1;            /*!< IOM 0 clock is on                                                         */
      __IOM uint32_t DISPCLKEN  : 1;            /*!< DISP clock is on                                                          */
      __IOM uint32_t CM4WDTCLKEN : 1;           /*!< CM4 I3C reference clock is enabled                                        */
      __IOM uint32_t APBI3CCLKEN : 1;           /*!< APB clock for I3C is enabled                                              */
      __IOM uint32_t RWLPCLKEN  : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t NPCLKEN    : 1;            /*!< Network processor clock is enabled                                        */
            uint32_t            : 1;
    } CLOCKEN2STAT_b;
  } ;

  union {
    __IOM uint32_t CLOCKEN3STAT;                /*!< This is a continuation of the clock enable status. These status
                                                     bits change frequently and should not be relied on to provide
                                                     consistent readings.                                                      */

    struct {
      __IOM uint32_t IOM1CLKEN  : 1;            /*!< IOM 1 clock is on                                                         */
      __IOM uint32_t IOM2CLKEN  : 1;            /*!< IOM 2 clock is on                                                         */
      __IOM uint32_t IOM3CLKEN  : 1;            /*!< IOM 3 clock is on                                                         */
      __IOM uint32_t IOM4CLKEN  : 1;            /*!< IOM 4 clock is on                                                         */
      __IOM uint32_t IOM5CLKEN  : 1;            /*!< IOM 5 clock is on                                                         */
      __IOM uint32_t MSPI0CLKEN : 1;            /*!< MSPI 0 clock is on                                                        */
      __IOM uint32_t MSPI1CLKEN : 1;            /*!< MSPI 1 clock is on                                                        */
      __IOM uint32_t MSPI2CLKEN : 1;            /*!< MSPI 2 clock is on                                                        */
      __IOM uint32_t MSPI3CLKEN : 1;            /*!< MSPI 3 clock is on                                                        */
      __IOM uint32_t OTPXTLCLKEN : 1;           /*!< OTP XTL clock is on                                                       */
      __IOM uint32_t RSTGENCLKEN : 1;           /*!< Reset generator POR clock is on                                           */
      __IOM uint32_t RSTGENPOSCLKEN : 1;        /*!< Reset generator POR clock is on                                           */
      __IOM uint32_t RTCCLKEN   : 1;            /*!< Real Time Clock clock is on                                               */
      __IOM uint32_t SDIO0CLKEN : 1;            /*!< SDIO 0 clock is on                                                        */
      __IOM uint32_t SDIO1CLKEN : 1;            /*!< SDIO 1 clock is on                                                        */
      __IOM uint32_t UART0CLKEN : 1;            /*!< UART 0 clock is on                                                        */
      __IOM uint32_t UART1CLKEN : 1;            /*!< UART 1 clock is on                                                        */
            uint32_t            : 2;
      __IOM uint32_t USBREFCLKEN : 1;           /*!< USB reference clock is on                                                 */
      __IOM uint32_t WDTCLKEN   : 1;            /*!< WDT clock is on                                                           */
      __IOM uint32_t XTALENABLED : 1;           /*!< Low-speed XTAL oscillator enable                                          */
      __IOM uint32_t SECUREWDTCLKEN : 1;        /*!< WDT clock is on                                                           */
      __IOM uint32_t SECURERTCCLKEN : 1;        /*!< Secure RTC clock is on                                                    */
            uint32_t            : 8;
    } CLOCKEN3STAT_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t MISC;                        /*!< This register controls a 'safe' mode for burst, which disables
                                                     the clock when burst transition is happening. It also includes
                                                     a register to force the HFRC during deep sleep. It is mainly
                                                     used for debug and testing.                                               */

