AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FRCHFRC    : 1;            /*!< Force HFRC On .                                                           */
      __IOM uint32_t FRCBURSTOFF : 1;           /*!< Force fclk, hclk, fclk_wic and fclk_pmu to be turned off during
                                                     burst transition.                                                         */
            uint32_t            : 7;
      __IOM uint32_t PWRONCLKENDISP : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENGFX : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSB : 1;         /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENSDIO : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENCRYPTO : 1;      /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENI2S0 : 1;        /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t AXIXACLKENOVRRIDE : 1;     /*!< Chicken bit to disable Rev B added clock gating                           */
      __IOM uint32_t PWRONCLKENI2S0REFCLK : 1;  /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t PWRONCLKENUSBREFCLK : 1;   /*!< Chicken bit to disable Rev B clock enable during reset                    */
      __IOM uint32_t CM4DAXICLKGATEEN : 1;      /*!< Unused (CLKGENMISCSPARES[0])                                              */
      __IOM uint32_t GFXCLKCLKGATEEN : 1;       /*!< Clock gate enable for GFX clock                                           */
      __IOM uint32_t GFXAXICLKCLKGATEEN : 1;    /*!< Clock gate enable for GFX AXI clock                                       */
      __IOM uint32_t APBDMACPUCLKCLKGATEEN : 1; /*!< Clock gate enable for APB DMA clock                                       */
      __IOM uint32_t ETMTRACECLKCLKGATEEN : 1;  /*!< Chicken bit to enable clock gating on ETM TRACE CLK                       */
      __IOM uint32_t HFRCFUNCCLKGATEEN : 1;     /*!< Chicken bit to enable clock gating on HFRC_FUNC_CLK                       */
      __IOM uint32_t HFRC96TRUNKGATE : 1;       /*!< DO NOT USE. HFRC96_TRUNK_GATE. Setting this bit when BIT23=0,
                                                     will kill HFRC root clock.                                                */
      __IOM uint32_t CLKGENMISCSPARE : 1;       /*!< Spare/Unused Chicken Bit                                                  */
            uint32_t            : 6;
    } MISC_b;
  } ;
  __IM  uint32_t  RESERVED4[12];

  union {
    __IOM uint32_t LFRCCTRL;                    /*!< LFRC control                                                              */

    struct {
      __IOM uint32_t LFRCOUT    : 1;            /*!< Disable LFRC output                                                       */
      __IOM uint32_t LFRCPWD    : 1;            /*!< Power down LFRC                                                           */
            uint32_t            : 30;
    } LFRCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED5[3];

  union {
    __IOM uint32_t CLKGENSPARES;                /*!< CLKGEN Spare Regs                                                         */

    struct {
      __IOM uint32_t CLKGENSPARES : 32;         /*!< Placeholer spare registes that can be used as needed for future
                                                     use                                                                       */
    } CLKGENSPARES_b;
  } ;

  union {
    __IOM uint32_t HFRCIDLECOUNTERS;            /*!< Provides SW controlled # idle cycles before powering down HFRC,
                                                     core clock enable(s)                                                      */

    struct {
      __IOM uint32_t HFRCPWRDOWNDELAY : 6;      /*!< Idle counter for HFRC POWER DOWN DELAY                                    */
      __IOM uint32_t HFRCCLKREQDELAY : 6;       /*!< Idle counter for HFRC CLK REQ DELAY                                       */
      __IOM uint32_t UPDATEENABLE : 1;          /*!< usage : Clear UPDATEENABLE or 1'b0; Update other bits fields
                                                     of this register. Set this register to 1'b1 for HW to update.             */
            uint32_t            : 19;
    } HFRCIDLECOUNTERS_b;
  } ;
  __IM  uint32_t  RESERVED6[32];

  union {
    __IOM uint32_t MSPIIOCLKCTRL;               /*!< Provides ability to select the MSPI clock, and derivative of
                                                     the MSPI clock                                                            */

    struct {
      __IOM uint32_t MSPI0IOCLKEN : 1;          /*!< Enable for the MSPI0 io clock through clkgen                              */
      __IOM uint32_t MSPI0IOCLKSEL : 4;         /*!< selection for MSPI0 io clock                                              */
      __IOM uint32_t MSPI1IOCLKEN : 1;          /*!< Enable for the MSPI1 io clock through clkgen                              */
      __IOM uint32_t MSPI1IOCLKSEL : 4;         /*!< selection for MSPI1 io clock                                              */
      __IOM uint32_t MSPI2IOCLKEN : 1;          /*!< Enable for the MSPI2 io clock through clkgen                              */
      __IOM uint32_t MSPI2IOCLKSEL : 4;         /*!< selection for MSPI2 io clock                                              */
            uint32_t            : 17;
    } MSPIIOCLKCTRL_b;
  } ;
  __IM  uint32_t  RESERVED7[3];

  union {
    __IOM uint32_t CLKCTRL;                     /*!< Provides ability to select and enable/force the GFX, MCU, and
                                                     I2C clocks                                                                */

