AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t APBUARTCLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBUARTCLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBUARTRSTN : 1;           /*!< Reset UART APB and UART Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t APBUARTCRMRSTN : 1;        /*!< Reset UART CRM, UART APB and UART Modules. (0: Assert reset;
                                                     1: De-assert reset;)                                                      */
            uint32_t            : 28;
    } APBUARTCRM_b;
  } ;

  union {
    __IOM uint32_t APBI2SCRM;                   /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t APBI2SCLKEN : 1;           /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBI2SCLKACTIVE : 1;       /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBI2SRSTN : 1;            /*!< Reset I2S APB and I2S Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t APBI2SCRMRSTN : 1;         /*!< Reset I2S CRM, I2S APB and I2S Modules. (0: Assert reset; 1:
                                                     De-assert reset;)                                                         */
      __IOM uint32_t APBI2SCLKSEL : 1;          /*!< Source Clock Select                                                       */
            uint32_t            : 27;
    } APBI2SCRM_b;
  } ;

  union {
    __IOM uint32_t APBPDMCRM;                   /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t APBPDMCLKEN : 1;           /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBPDMCLKACTIVE : 1;       /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBPDMRSTN : 1;            /*!< Reset PDM APB and PDM Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t APBPDMCRMRSTN : 1;         /*!< Reset PDM CRM, PDM APB and PDM Modules. (0: Assert reset; 1:
                                                     De-assert reset;)                                                         */
            uint32_t            : 28;
    } APBPDMCRM_b;
  } ;

  union {
    __IOM uint32_t APBUSBCRM;                   /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t APBUSBCLKEN : 1;           /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t APBUSBCLKACTIVE : 1;       /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
      __IOM uint32_t APBUSBRSTN : 1;            /*!< Reset USB APB and USB Modules. (0: Assert reset; 1: De-assert
                                                     reset;)                                                                   */
      __IOM uint32_t APBUSBCRMRSTN : 1;         /*!< Reset USB CRM, USB APB and USB Modules. (0: Assert reset; 1:
                                                     De-assert reset;)                                                         */
            uint32_t            : 28;
    } APBUSBCRM_b;
  } ;

  union {
    __IOM uint32_t DISPCLKCRM;                  /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t DISPCLKCLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t DISPCLKCLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t DISPCLKCRMRSTN : 1;        /*!< Reset DISP_CLK CRM. (0: Assert reset; 1: De-assert reset;)                */
      __IOM uint32_t DISPCLKCLKSEL : 2;         /*!< Source Clock Select                                                       */
            uint32_t            : 2;
      __IOM uint32_t DISPCLKCLKDIV : 4;         /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 20;
    } DISPCLKCRM_b;
  } ;

  union {
    __IOM uint32_t DPHYPLLREFCRM;               /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t DPHYPLLREFCLKEN : 1;       /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t DPHYPLLREFCLKACTIVE : 1;   /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t DPHYPLLREFCRMRSTN : 1;     /*!< Reset DPHY_PLL_REF CRM. (0: Assert reset; 1: De-assert reset;)            */
      __IOM uint32_t DPHYPLLREFCLKSEL : 3;      /*!< Source Clock Select                                                       */
            uint32_t            : 1;
      __IOM uint32_t DPHYPLLREFCLKDIV : 3;      /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 21;
    } DPHYPLLREFCRM_b;
  } ;

  union {
    __IOM uint32_t DSPPDM0CRM;                  /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t DSPPDM0CLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t DSPPDM0CLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t DSPPDM0CRMRSTN : 1;        /*!< Reset DSP_PDM0 CRM. (0: Assert reset; 1: De-assert reset;)                */
      __IOM uint32_t DSPPDM0CLKSEL : 3;         /*!< Source Clock Select                                                       */
            uint32_t            : 1;
      __IOM uint32_t DSPPDM0CLKDIV : 7;         /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 17;
    } DSPPDM0CRM_b;
  } ;

  union {
    __IOM uint32_t I2S0MCLKCRM;                 /*!< Clock and Reset Controls configurations                                   */

