AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t I2S0MCLKCLKEN : 1;         /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t I2S0MCLKCLKACTIVE : 1;     /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t I2S0MCLKCRMRSTN : 1;       /*!< Reset I2S0_MCLK CRM. (0: Assert reset; 1: De-assert reset;)               */
      __IOM uint32_t I2S0MCLKCLKSEL : 3;        /*!< Source Clock Select                                                       */
            uint32_t            : 1;
      __IOM uint32_t I2S0MCLKCLKDIV : 7;        /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 17;
    } I2S0MCLKCRM_b;
  } ;

  union {
    __IOM uint32_t I2S0MCLKOUTCRM;              /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t I2S0MCLKOUTCLKEN : 1;      /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t I2S0MCLKOUTCLKACTIVE : 1;  /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t I2S0MCLKOUTCRMRSTN : 1;    /*!< Reset I2S0_MCLK_OUT CRM. (0: Assert reset; 1: De-assert reset;)           */
      __IOM uint32_t I2S0MCLKOUTCLKSEL : 3;     /*!< Source Clock Select                                                       */
            uint32_t            : 1;
      __IOM uint32_t I2S0MCLKOUTCLKDIV : 5;     /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 19;
    } I2S0MCLKOUTCRM_b;
  } ;

  union {
    __IOM uint32_t I2S0REFCLKCRM;               /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t I2S0REFCLKCLKEN : 1;       /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t I2S0REFCLKCLKACTIVE : 1;   /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t I2S0REFCLKCRMRSTN : 1;     /*!< Reset I2S0_REFCLK CRM. (0: Assert reset; 1: De-assert reset;)             */
      __IOM uint32_t I2S0REFCLKCLKSEL : 2;      /*!< Source Clock Select                                                       */
            uint32_t            : 2;
      __IOM uint32_t I2S0REFCLKCLKDIV : 5;      /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 19;
    } I2S0REFCLKCRM_b;
  } ;

  union {
    __IOM uint32_t UART0HFCRM;                  /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t UART0HFCLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t UART0HFCLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t UART0HFCRMRSTN : 1;        /*!< Reset UART0HF CRM. (0: Assert reset; 1: De-assert reset;)                 */
      __IOM uint32_t UART0HFCLKSEL : 1;         /*!< Source Clock Select                                                       */
            uint32_t            : 3;
      __IOM uint32_t UART0HFCLKDIV : 5;         /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 19;
    } UART0HFCRM_b;
  } ;

  union {
    __IOM uint32_t UART1HFCRM;                  /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t UART1HFCLKEN : 1;          /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t UART1HFCLKACTIVE : 1;      /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t UART1HFCRMRSTN : 1;        /*!< Reset UART1HF CRM. (0: Assert reset; 1: De-assert reset;)                 */
      __IOM uint32_t UART1HFCLKSEL : 1;         /*!< Source Clock Select                                                       */
            uint32_t            : 3;
      __IOM uint32_t UART1HFCLKDIV : 5;         /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 19;
    } UART1HFCRM_b;
  } ;

  union {
    __IOM uint32_t USBREFCLKCRM;                /*!< Clock and Reset Controls configurations                                   */

    struct {
      __IOM uint32_t USBREFCLKCLKEN : 1;        /*!< Clock Enable. (0: Disable clock; 1: Enable clock;)                        */
      __IOM uint32_t USBREFCLKCLKACTIVE : 1;    /*!< Clock Output Ready. (0: Clock not ready; 1: Clock ready;)                 */
            uint32_t            : 1;
      __IOM uint32_t USBREFCLKCRMRSTN : 1;      /*!< Reset USB_REFCLK CRM. (0: Assert reset; 1: De-assert reset;)              */
      __IOM uint32_t USBREFCLKCLKSEL : 3;       /*!< Source Clock Select                                                       */
            uint32_t            : 1;
      __IOM uint32_t USBREFCLKCLKDIV : 3;       /*!< Clock Divider Ratio. (0=DIV1; 1=DIV2; 2=DIV3, ...)                        */
            uint32_t            : 21;
    } USBREFCLKCRM_b;
  } ;
  __IM  uint32_t  RESERVED1[107];

  union {
    __IOM uint32_t CRMCLKENSTATUS;              /*!< This provides the .                                                       */

    struct {
      __IOM uint32_t USBREFCLKCLKENABLED : 1;   /*!< Indicate whether USBREFCLK clk is enabled                                 */
      __IOM uint32_t UART1HFCLKENABLED : 1;     /*!< Indicate whether UART1HF clk is enabled                                   */
      __IOM uint32_t UART0HFCLKENABLED : 1;     /*!< Indicate whether UART0HF clk is enabled                                   */
      __IOM uint32_t I2S0REFCLKCLKENABLED : 1;  /*!< Indicate whether I2S0REFCLK clk is enabled                                */
      __IOM uint32_t I2S0MCLKOUTCLKENABLED : 1; /*!< Indicate whether I2S0MCLKOUT clk is enabled                               */
      __IOM uint32_t I2S0MCLKCLKENABLED : 1;    /*!< Indicate whether I2S0MCLK clk is enabled                                  */
      __IOM uint32_t DSPPDM0CLKENABLED : 1;     /*!< Indicate whether DSPPDM0 clk is enabled                                   */
      __IOM uint32_t DPHYPLLREFCLKENABLED : 1;  /*!< Indicate whether DPHYPLLREF clk is enabled                                */
      __IOM uint32_t DISPCLKCLKENABLED : 1;     /*!< Indicate whether DISPCLK clk is enabled                                   */
      __IOM uint32_t APBUSBCLKENABLED : 1;      /*!< Indicate whether APBUSB clk is enabled                                    */
      __IOM uint32_t APBPDMCLKENABLED : 1;      /*!< Indicate whether APBPDM clk is enabled                                    */
      __IOM uint32_t APBI2SCLKENABLED : 1;      /*!< Indicate whether APBI2S clk is enabled                                    */
      __IOM uint32_t APBUARTCLKENABLED : 1;     /*!< Indicate whether APBUART clk is enabled                                   */
      __IOM uint32_t APBDISPPHYCLKENABLED : 1;  /*!< Indicate whether APBDISPPHY clk is enabled                                */
      __IOM uint32_t APBDISPCLKENABLED : 1;     /*!< Indicate whether APBDISP clk is enabled                                   */
      __IOM uint32_t ADCCLKENABLED : 1;         /*!< Indicate whether ADC clk is enabled                                       */
            uint32_t            : 16;
    } CRMCLKENSTATUS_b;
  } ;
} CRM_Type;                                     /*!< Size = 512 (0x200)                                                        */



/* =========================================================================================================================== */
/* ================                                          CRYPTO                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Embedded security and cryptographic services (CRYPTO)
  */

