AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
typedef struct {                                /*!< CRYPTO Structure                                                          */

  union {
    __IOM uint32_t MEMORYMAP0;                  /*!< This register maps the virtual register R0 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP0 : 10;         /*!< Contains the physical address in memory to map the R0 register.           */
            uint32_t            : 21;
    } MEMORYMAP0_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP1;                  /*!< This register maps the virtual register R1 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP1 : 10;         /*!< Contains the physical address in memory to map the R1 register.           */
            uint32_t            : 21;
    } MEMORYMAP1_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP2;                  /*!< This register maps the virtual register R2 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP2 : 10;         /*!< Contains the physical address in memory to map the R2 register.           */
            uint32_t            : 21;
    } MEMORYMAP2_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP3;                  /*!< This register maps the virtual register R3 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP3 : 10;         /*!< Contains the physical address in memory to map the R3 register.           */
            uint32_t            : 21;
    } MEMORYMAP3_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP4;                  /*!< This register maps the virtual register R4 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP4 : 10;         /*!< Contains the physical address in memory to map the R4 register.           */
            uint32_t            : 21;
    } MEMORYMAP4_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP5;                  /*!< This register maps the virtual register R5 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP5 : 10;         /*!< Contains the physical address in memory to map the R5 register.           */
            uint32_t            : 21;
    } MEMORYMAP5_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP6;                  /*!< This register maps the virtual register R6 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP6 : 10;         /*!< Contains the physical address in memory to map the R6 register.           */
            uint32_t            : 21;
    } MEMORYMAP6_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP7;                  /*!< This register maps the virtual register R7 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP7 : 10;         /*!< Contains the physical address in memory to map the R7 register.           */
            uint32_t            : 21;
    } MEMORYMAP7_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP8;                  /*!< This register maps the virtual register R8 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP8 : 10;         /*!< Contains the physical address in memory to map the R8 register.           */
            uint32_t            : 21;
    } MEMORYMAP8_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP9;                  /*!< This register maps the virtual register R9 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP9 : 10;         /*!< Contains the physical address in memory to map the R9 register.           */
            uint32_t            : 21;
    } MEMORYMAP9_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP10;                 /*!< This register maps the virtual register R10 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP10 : 10;        /*!< Contains the physical address in memory to map the R10 register.          */
            uint32_t            : 21;
    } MEMORYMAP10_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP11;                 /*!< This register maps the virtual register R11 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP11 : 10;        /*!< Contains the physical address in memory to map the R11 register.          */
            uint32_t            : 21;
    } MEMORYMAP11_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP12;                 /*!< This register maps the virtual register R12 to a physical address
                                                     in memory.                                                                */

