AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP23 : 10;        /*!< Contains the physical address in memory to map the R23 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP23_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP24;                 /*!< This register maps the virtual register R24 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP24 : 10;        /*!< Contains the physical address in memory to map the R24 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP24_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP25;                 /*!< This register maps the virtual register R25 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP25 : 10;        /*!< Contains the physical address in memory to map the R25 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP25_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP26;                 /*!< This register maps the virtual register R26 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP26 : 10;        /*!< Contains the physical address in memory to map the R26 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP26_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP27;                 /*!< This register maps the virtual register R27 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP27 : 10;        /*!< Contains the physical address in memory to map the R27 register
                                                     to.                                                                       */
            uint32_t            : 21;
    } MEMORYMAP27_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP28;                 /*!< This register maps the virtual register R28 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP28 : 10;        /*!< Contains the physical address in memory to map the R28 register.          */
            uint32_t            : 21;
    } MEMORYMAP28_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP29;                 /*!< This register maps the virtual register R29 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP29 : 10;        /*!< Contains the physical address in memory to map the R29 register.          */
            uint32_t            : 21;
    } MEMORYMAP29_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP30;                 /*!< This register maps the virtual register R30 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP30 : 10;        /*!< Contains the physical address in memory to map the R30 register.          */
            uint32_t            : 21;
    } MEMORYMAP30_b;
  } ;

  union {
    __IOM uint32_t MEMORYMAP31;                 /*!< This register maps the virtual register R31 to a physical address
                                                     in memory.                                                                */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PHYSADDRMAP31 : 10;        /*!< Contains the physical address in memory to map the R31 register.          */
            uint32_t            : 21;
    } MEMORYMAP31_b;
  } ;

  union {
    __IOM uint32_t OPCODE;                      /*!< This register holds the PKAs OPCODE.                                      */

    struct {
      __IOM uint32_t TAG        : 6;            /*!< Holds the operations tag or the operand C virtual address.                */
      __IOM uint32_t REGR       : 6;            /*!< Result register virtual address 0-15.                                     */
      __IOM uint32_t REGB       : 6;            /*!< Operand B virtual address 0-15.                                           */
      __IOM uint32_t REGA       : 6;            /*!< Operand A virtual address 0-15.                                           */
      __IOM uint32_t LEN        : 3;            /*!< The length of the operation. The value serves as a pointer to
                                                     PKA length register, for example, if the value is 0, PKA_L0
                                                     holds the size of the operation.                                          */
      __IOM uint32_t OPCODE     : 5;            /*!< Defines the PKA operation:                                                */
    } OPCODE_b;
  } ;

  union {
    __IOM uint32_t NNPT0T1ADDR;                 /*!< This register maps N_NP_T0_T1 to a virtual address.                       */

