AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CHACHAVERSION : 32;        /*!< CHACHA version.                                                           */
    } CHACHAVERSION_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY0;                  /*!< bits 255:224 of CHACHA Key                                                */

    struct {
      __IOM uint32_t CHACHAKEY0 : 32;           /*!< bits 255:224 of CHACHA Key                                                */
    } CHACHAKEY0_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY1;                  /*!< bits 223:192 of CHACHA Key                                                */

    struct {
      __IOM uint32_t CHACHAKEY1 : 32;           /*!< bits 223:192 of CHACHA Key                                                */
    } CHACHAKEY1_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY2;                  /*!< bits 191:160 of CHACHA Key                                                */

    struct {
      __IOM uint32_t CHACHAKEY2 : 32;           /*!< bits191:160 of CHACHA Key                                                 */
    } CHACHAKEY2_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY3;                  /*!< bits159:128 of CHACHA Key                                                 */

    struct {
      __IOM uint32_t CHACHAKEY3 : 32;           /*!< bits 159:128 of CHACHA Key                                                */
    } CHACHAKEY3_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY4;                  /*!< bits 127:96 of CHACHA Key                                                 */

    struct {
      __IOM uint32_t CHACHAKEY4 : 32;           /*!< bits 127:96 of CHACHA Key                                                 */
    } CHACHAKEY4_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY5;                  /*!< bits 95:64 of CHACHA Key                                                  */

    struct {
      __IOM uint32_t CHACHAKEY5 : 32;           /*!< bits 95:64 of CHACHA Key                                                  */
    } CHACHAKEY5_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY6;                  /*!< bits 63:32 of CHACHA Key                                                  */

    struct {
      __IOM uint32_t CHACHAKEY6 : 32;           /*!< bits 63:32 of CHACHA Key                                                  */
    } CHACHAKEY6_b;
  } ;

  union {
    __IOM uint32_t CHACHAKEY7;                  /*!< bits 31:0 of CHACHA Key                                                   */

    struct {
      __IOM uint32_t CHACHAKEY7 : 32;           /*!< bits 31:0 of CHACHA Key                                                   */
    } CHACHAKEY7_b;
  } ;

  union {
    __IOM uint32_t CHACHAIV0;                   /*!< bits 31:0 of CHACHA_IV0 register                                          */

    struct {
      __IOM uint32_t CHACHAIV0  : 32;           /*!< bits 31:0 of CHACHA_IV0 register                                          */
    } CHACHAIV0_b;
  } ;

  union {
    __IOM uint32_t CHACHAIV1;                   /*!< bits 31:0 of CHACHA_IV1 register                                          */

    struct {
      __IOM uint32_t CHACHAIV1  : 32;           /*!< bits 31:0 of CHACHA_IV1 register                                          */
    } CHACHAIV1_b;
  } ;

  union {
    __IOM uint32_t CHACHABUSY;                  /*!< This register is set when the CHACHA_SALSA core is active                 */

    struct {
      __IOM uint32_t CHACHABUSY : 1;            /*!< CHACHA_BUSY Register. This register is set when the CHACHA_SALSA
                                                     core is active.                                                           */
            uint32_t            : 31;
    } CHACHABUSY_b;
  } ;

  union {
    __IOM uint32_t CHACHAHWFLAGS;               /*!< This register holds the pre-synthesis HW flag configuration
                                                     of the CHACHA_SALSA engine                                                */

    struct {
      __IOM uint32_t CHACHAEXISTS : 1;          /*!< If this flag is set, the Salsa_ChaCha engine include ChaCha
                                                     implementation:                                                           */
      __IOM uint32_t SALSAEXISTS : 1;           /*!< If this flag is set, the Salsa_ChaCha engine include Salsa implementation: */
      __IOM uint32_t FASTCHACHA : 1;            /*!< If this flag is set, the next matrix calculated when the current
                                                     one is written to data output path (same flag for Salsa
                                                     core):                                                                    */
            uint32_t            : 29;
    } CHACHAHWFLAGS_b;
  } ;

  union {
    __IOM uint32_t CHACHABLOCKCNTLSB;           /*!< The two first words (n) in the last row of the cipher matrix
                                                     are the block counter. At the end of each block (512b),
                                                     the block_cnt for the next block is written by HW to the
                                                     block_cnt_lsb and block_cnt_msb registers. Need reset block
                                                     counter , if start new message.                                           */

    struct {
      __IOM uint32_t CHACHABLOCKCNTLSB : 32;    /*!< bits 31:0 of CHACHA_BLOCK_CNT_LSB register.                               */
    } CHACHABLOCKCNTLSB_b;
  } ;

  union {
    __IOM uint32_t CHACHABLOCKCNTMSB;           /*!< The two first words (n) in the last row of the cipher matrix
                                                     are the block counter. At the end of each block (512b),
                                                     the block_cnt for the next block is written by HW to the
                                                     block_cnt_lsb and block_cnt_msb registers. Need reset block
                                                     counter , if start new message.                                           */

