AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SUPPORT256192KEY : 1;      /*!< the SUPPORT_256_192_KEY flag                                              */
      __IOM uint32_t AESLARGERKEK : 1;          /*!< the AES_LARGE_RKEK flag                                                   */
      __IOM uint32_t DPACNTRMSREXIST : 1;       /*!< the DPA_CNTRMSR_EXIST flag                                                */
      __IOM uint32_t CTREXIST   : 1;            /*!< the CTR_EXIST flag                                                        */
      __IOM uint32_t ONLYENCRYPT : 1;           /*!< the ONLY_ENCRYPT flag                                                     */
      __IOM uint32_t USESBOXTABLE : 1;          /*!< the USE_SBOX_TABLE flag                                                   */
            uint32_t            : 2;
      __IOM uint32_t USE5SBOXES : 1;            /*!< the USE_5_SBOXES flag                                                     */
      __IOM uint32_t AESSUPPORTPREVIV : 1;      /*!< the AES_SUPPORT_PREV_IV flag                                              */
      __IOM uint32_t aestunnelexists : 1;       /*!< the aes_tunnel_exists flag                                                */
      __IOM uint32_t SECONDREGSSETEXIST : 1;    /*!< the SECOND_REGS_SET_EXIST flag                                            */
      __IOM uint32_t DFACNTRMSREXIST : 1;       /*!< the DFA_CNTRMSR_EXIST flag                                                */
            uint32_t            : 19;
    } AESHWFLAGS_b;
  } ;
  __IM  uint32_t  RESERVED14[3];

  union {
    __IOM uint32_t AESCTRNOINCREMENT;           /*!< This register enables the AES CTR no increment mode (in which
                                                     the counter mode is not incremented between 2 blocks)                     */

    struct {
      __IOM uint32_t AESCTRNOINCREMENT : 1;     /*!< This field enables the AES CTR 'no increment' mode (in which
                                                     the counter mode is not incremented between 2 blocks)                     */
            uint32_t            : 31;
    } AESCTRNOINCREMENT_b;
  } ;
  __IM  uint32_t  RESERVED15[5];

  union {
    __IOM uint32_t AESDFAISON;                  /*!< This register disable_enable the AES dfa. Note: This is a special
                                                     register, affected by internal logic. Test result of this
                                                     register is NA.                                                           */

    struct {
      __IOM uint32_t AESDFAISON : 1;            /*!< writing to this register turns the DFA counter-measures on.
                                                     this register exists only if DFA countermeasures are supported            */
            uint32_t            : 31;
    } AESDFAISON_b;
  } ;
  __IM  uint32_t  RESERVED16;

  union {
    __IOM uint32_t AESDFAERRSTATUS;             /*!< dfa error status register.                                                */

    struct {
      __IOM uint32_t AESDFAERRSTATUS : 1;       /*!< after a DFA violation this register is set and the AES block
                                                     is disabled) until the next reset. this register only exists
                                                     if DFA countermeasures is are supported                                   */
            uint32_t            : 31;
    } AESDFAERRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED17[10];

  union {
    __IOM uint32_t AESCMACSIZE0KICK;            /*!< writing to this address triggers the AES engine to perform a
                                                     CMAC operation with size 0. The CMAC result can be read
                                                     from the AES_IV0 register.                                                */

    struct {
      __IOM uint32_t AESCMACSIZE0KICK : 1;      /*!< writing to this address triggers the AES engine to perform a
                                                     CMAC operation with size 0. The CMAC result can be read
                                                     from the AES_IV0 register.                                                */
            uint32_t            : 31;
    } AESCMACSIZE0KICK_b;
  } ;
  __IM  uint32_t  RESERVED18[70];

  union {
    __IOM uint32_t HASHH0;                      /*!< H0 data. can only be written in the following HASH_CONTROL modes:
                                                     MD5 SHA1 SHA224 SHA256 SHA384 SHA512                                      */

    struct {
      __IOM uint32_t HASHH0     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH0_b;
  } ;

  union {
    __IOM uint32_t HASHH1;                      /*!< H1 data. can only be written in the following HASH_CONTROL modes:
                                                     MD5 SHA1 SHA224 SHA256 SHA384 SHA512                                      */

    struct {
      __IOM uint32_t HASHH1     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH1_b;
  } ;

  union {
    __IOM uint32_t HASHH2;                      /*!< H2 data. can only be written in the following HASH_CONTROL modes:
                                                     MD5 SHA1 SHA224 SHA256 SHA384 SHA512                                      */

    struct {
      __IOM uint32_t HASHH2     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH2_b;
  } ;

  union {
    __IOM uint32_t HASHH3;                      /*!< H3 data. can only be written in the following HASH_CONTROL modes:
                                                     MD5 SHA1 SHA224 SHA256 SHA384 SHA512                                      */

    struct {
      __IOM uint32_t HASHH3     : 32;           /*!< 1) Write initial Hash value.                                              */
    } HASHH3_b;
  } ;

  union {
    __IOM uint32_t HASHH4;                      /*!< H4 data. can only be written in the following HASH_CONTROL modes:
                                                     SHA1 SHA224 SHA256 SHA384 SHA512                                          */

