AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SELCRYPTOKEY : 3;          /*!< Select the source of the HW key that is used by the AES engine:           */
            uint32_t            : 29;
    } HOSTCRYPTOKEYSEL_b;
  } ;
  __IM  uint32_t  RESERVED37[15];

  union {
    __IOM uint32_t HOSTCORECLKGATINGENABLE;     /*!< This register enables the core clk gating by masking_enabling
                                                     the cc_idle_state output signal.                                          */

    struct {
      __IOM uint32_t HOSTCORECLKGATINGENABLE : 1;/*!< Enable the core clk gating,                                              */
            uint32_t            : 31;
    } HOSTCORECLKGATINGENABLE_b;
  } ;

  union {
    __IOM uint32_t HOSTCCISIDLE;                /*!< This register holds the idle indication of CC . Note: This is
                                                     a special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

    struct {
      __IOM uint32_t HOSTCCISIDLE : 1;          /*!< Read if CC is idle.                                                       */
      __IOM uint32_t HOSTCCISIDLEEVENT : 1;     /*!< The event that indicates that CC is idle.                                 */
      __IOM uint32_t SYMISBUSY  : 1;            /*!< symetric flow is busy                                                     */
      __IOM uint32_t AHBISIDLE  : 1;            /*!< ahb stste machine is idle                                                 */
      __IOM uint32_t NVMARBISIDLE : 1;          /*!< nvm arbiter is idle                                                       */
      __IOM uint32_t NVMISIDLE  : 1;            /*!< nvm is idle                                                               */
      __IOM uint32_t FATALWR    : 1;            /*!< fatal write                                                               */
      __IOM uint32_t RNGISIDLE  : 1;            /*!< rng is idle                                                               */
      __IOM uint32_t PKAISIDLE  : 1;            /*!< pka is idle                                                               */
      __IOM uint32_t CRYPTOISIDLE : 1;          /*!< crypto flow is done                                                       */
            uint32_t            : 22;
    } HOSTCCISIDLE_b;
  } ;

  union {
    __IOM uint32_t HOSTPOWERDOWN;               /*!< This register start the power-down sequence. Note: This is a
                                                     special register, affected by internal logic. Test result
                                                     of this register is NA.                                                   */

    struct {
      __IOM uint32_t HOSTPOWERDOWN : 1;         /*!< Power down enable register.                                               */
            uint32_t            : 31;
    } HOSTPOWERDOWN_b;
  } ;

  union {
    __IOM uint32_t HOSTREMOVEGHASHENGINE;       /*!< These inputs are to be statically tied to 0 or 1 by the customers.
                                                     When such an input is set, the matching engines inputs
                                                     are tied to zero and its outputs are disconnected, so that
                                                     the engine will be entirely removed by Synthesis                          */

    struct {
      __IOM uint32_t HOSTREMOVEGHASHENGINE : 1; /*!< Read the Remove_chacha_engine input                                       */
            uint32_t            : 31;
    } HOSTREMOVEGHASHENGINE_b;
  } ;

  union {
    __IOM uint32_t HOSTREMOVECHACHAENGINE;      /*!< These inputs are to be statically tied to 0 or 1 by the customers.
                                                     When such an input is set, the matching engines inputs
                                                     are tied to zero and its outputs are disconnected, so that
                                                     the engine will be entirely removed by Synthesis                          */

    struct {
      __IOM uint32_t HOSTREMOVECHACHAENGINE : 1;/*!< Read the Remove_ghash_engine input                                        */
            uint32_t            : 31;
    } HOSTREMOVECHACHAENGINE_b;
  } ;
  __IM  uint32_t  RESERVED38[29];

  union {
    __IOM uint32_t AHBMSINGLES;                 /*!< This register forces the ahb transactions to be always singles.           */

    struct {
      __IOM uint32_t AHBSINGLES : 1;            /*!< Force ahb singles                                                         */
            uint32_t            : 31;
    } AHBMSINGLES_b;
  } ;

  union {
    __IOM uint32_t AHBMHPROT;                   /*!< This register holds the ahb prot value                                    */

    struct {
      __IOM uint32_t AHBPROT    : 4;            /*!< The ahb prot value                                                        */
            uint32_t            : 28;
    } AHBMHPROT_b;
  } ;

  union {
    __IOM uint32_t AHBMHMASTLOCK;               /*!< This register holds ahb hmastlock value                                   */

    struct {
      __IOM uint32_t AHBHMASTLOCK : 1;          /*!< The hmastlock value.                                                      */
            uint32_t            : 31;
    } AHBMHMASTLOCK_b;
  } ;

  union {
    __IOM uint32_t AHBMHNONSEC;                 /*!< This register holds ahb hnonsec value                                     */

    struct {
      __IOM uint32_t AHBWRITEHNONSEC : 1;       /*!< The hnonsec value for write transaction.                                  */
      __IOM uint32_t AHBREADHNONSEC : 1;        /*!< The hnonsec value for read transaction.                                   */
            uint32_t            : 30;
    } AHBMHNONSEC_b;
  } ;
  __IM  uint32_t  RESERVED39[60];

  union {
    __IOM uint32_t DINBUFFER;                   /*!< This address can be used by the CPU to write data directly to
                                                     the DIN buffer to be sent to engines.                                     */

