AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t DBIBLPEN   : 1;            /*!< DBIB Low Power Enable. 1: enable. 0: disable                              */
      __IOM uint32_t DBIBVC     : 2;            /*!< DBIB VC Number                                                            */
      __IOM uint32_t DBIBLWEN   : 1;            /*!< DBIB Generic Long Write Enable. 1: enable. 0: disable                     */
      __IOM uint32_t TASTEN     : 1;            /*!< LCD Tast Enable. 1: enable. 0: disable                                    */
      __IOM uint32_t TEMUX      : 1;            /*!< TE Mux. 1: TE from GPIO. 0: TE from DSI                                   */
      __IOM uint32_t RSVD0      : 9;            /*!< This field is reserved.                                                   */
      __IOM uint32_t DPISD      : 1;            /*!< Assert DPI-2 Shutdown Signal                                              */
      __IOM uint32_t DPICOLORMODE : 1;          /*!< Assert DPI-2 Color Mode Signal                                            */
      __IOM uint32_t RSVD1      : 15;           /*!< This field is reserved.                                                   */
    } DCGPIO_b;
  } ;

  union {
    __IOM uint32_t LAYER0MODE;                  /*!< LAYER0_MODE: Activate and set-up layer 0.                                 */

    struct {
      __IOM uint32_t LAYER0COLMODE : 5;         /*!< Color mode                                                                */
      __IOM uint32_t MODElayerregisterprotect : 1;/*!< Enable Register Protection for NemaDC layer registers. When
                                                     Register Protection is enabled the layer registers take
                                                     effect in the design only when frame end occurs.Register
                                                     reading functionality from register file remains the same.                */
      __IOM uint32_t FlipXenable : 1;           /*!< Enables the FlipX functionality                                           */
      __IOM uint32_t FlipYenable : 1;           /*!< Enables the FlipY functionality                                           */
      __IOM uint32_t LAYER0SBLEND : 4;          /*!< Source blending function                                                  */
      __IOM uint32_t LAYER0DBLEND : 4;          /*!< Destination blending function                                             */
      __IOM uint32_t LAYER0ALPHA : 8;           /*!< Alpha layer global value (0x00-0xFF range)                                */
      __IOM uint32_t RSVD24     : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYER0GAMMA : 1;           /*!< When set to 1, Gamma Look Up Table is enabled                             */
      __IOM uint32_t RSVD27     : 1;            /*!< Reserved field.                                                           */
      __IOM uint32_t LAYER0PREMULT : 1;         /*!< When set to 1, premultiply image alpha is enabled                         */
      __IOM uint32_t LAYER0DISMECHANISM : 1;    /*!< When set to 1, it disables the mechanism that prevent the underflow
                                                     in certain interface(SPI/DBIB)                                            */
      __IOM uint32_t LAYER0FORCE : 1;           /*!< When set to 1, force alpha with global alpha is enabled                   */
      __IOM uint32_t LAYER0EN   : 1;            /*!< When set to 1, layer n is enabled                                         */
    } LAYER0MODE_b;
  } ;

  union {
    __IOM uint32_t LAYER0STARTXY;               /*!< X and Y start dimensions of layer 0.                                      */

    struct {
      __IOM uint32_t LAYER0YOFF : 16;           /*!< Specify the pixel offset of the starting Y dimension of layer
                                                     0                                                                         */
      __IOM uint32_t LAYER0XOFF : 16;           /*!< Specify the pixel offset of the starting X dimension of layer
                                                     0                                                                         */
    } LAYER0STARTXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0SIZEXY;                /*!< X and Y size of layer 0.                                                  */

    struct {
      __IOM uint32_t LAYER0PIXSZEY : 16;        /*!< Specify the pixel size of the layer 0 in the Y dimension                  */
      __IOM uint32_t LAYER0PIXSZEX : 16;        /*!< Specify the pixel size of the layer 0 in the X dimension                  */
    } LAYER0SIZEXY_b;
  } ;

  union {
    __IOM uint32_t LAYER0ADDR;                  /*!< The start address of the framebuffer to be accessed by layer
                                                     0.                                                                        */

    struct {
      __IOM uint32_t LAYER0STARTADDRFBUF : 32;  /*!< Specify the start address of framebuffer for each layer 0.                */
    } LAYER0ADDR_b;
  } ;

  union {
    __IOM uint32_t LAYER0STRIDE;                /*!< Specify the stride and the AXI bus burst of layer 0.                      */

    struct {
      __IOM uint32_t LAYER0STRIDEDIST : 16;     /*!< Specify the stride, which is the distance from line to line
                                                     in bytes for each layer 0 memory                                          */
      __IOM uint32_t LAYER0AXIBURSTBITS : 3;    /*!< Specify the AXI bits per burst in layer 0                                 */
      __IOM uint32_t LAYER0AXIFIFOTHLD : 2;     /*!< Specify the AXI fifo threshold burst start in layer 0                     */
      __IOM uint32_t RSVD021    : 11;           /*!< This field is reserved.                                                   */
    } LAYER0STRIDE_b;
  } ;

  union {
    __IOM uint32_t LAYER0RESXY;                 /*!< X and Y dimensions for the resolution of layer 0.                         */

