AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t COCLORDECSTARTX : 16;      /*!< Specify the pixel offset of the starting X dimension of colordec
                                                     in layer0                                                                 */
      __IOM uint32_t COCLORDECSTARTY : 16;      /*!< Specify the pixel offset of the starting Y dimension of colordec
                                                     in layer0                                                                 */
    } LAYER0COLORDECSTARTXY_b;
  } ;
  __IM  uint32_t  RESERVED2[3];

  union {
    __IOM uint32_t LAYER0COLORFORMAT;           /*!< Specify the color format of layer 0                                       */

    struct {
      __IOM uint32_t COLORMODE  : 6;            /*!< color mode for layer 0                                                    */
      __IOM uint32_t RSVD       : 26;           /*!< This field is reserved.                                                   */
    } LAYER0COLORFORMAT_b;
  } ;
  __IM  uint32_t  RESERVED3[6];

  union {
    __IOM uint32_t LAYERPARTIAL;                /*!< MIP partial and full frame update register, used by layers.               */

    struct {
      __IOM uint32_t LAYERPARTIALSTART : 12;    /*!< The first row of the layer for the given partial or full frame
                                                     region.                                                                   */
      __IOM uint32_t LAYERPARTIALEND : 12;      /*!< The last row of the layer for the given partial or full frame
                                                     region.                                                                   */
      __IOM uint32_t RSVD       : 6;            /*!< This field is reserved.                                                   */
      __IOM uint32_t LAYERSELECTION : 2;        /*!< Indicates the layer that the partial or full region belongs
                                                     to.                                                                       */
    } LAYERPARTIAL_b;
  } ;

  union {
    __IOM uint32_t MIPCFG1;                     /*!< MIP partial and full frame update configuration register, used
                                                     by MIP parallel interface.                                                */

    struct {
      __IOM uint32_t HCKBCKSTART : 10;          /*!< The HCK/BCK count that the MIP interface will transmit the first
                                                     valid data.                                                               */
      __IOM uint32_t RSVD       : 14;           /*!< This field is reserved.                                                   */
      __IOM uint32_t VCKCGKFFWD : 8;            /*!< The VCK/GCK (high/low) width of a fast forward transaction.               */
    } MIPCFG1_b;
  } ;

  union {
    __IOM uint32_t MIPCFG2;                     /*!< MIP partial and full frame update configuration register, used
                                                     by MIP parallel interface.                                                */

    struct {
      __IOM uint32_t LASTVCKGCKPOINT : 12;      /*!< Indicates the last VCK/GCK count with valid data.                         */
      __IOM uint32_t VCKGCKWIDTH : 10;          /*!< Indicates the VCK/GCK (high/low) width during a normal transaction.       */
      __IOM uint32_t RSVD       : 2;            /*!< This field is reserved.                                                   */
      __IOM uint32_t VCKGCKOFFSET : 8;          /*!< Indicates the VCK/GCK offset.                                             */
    } MIPCFG2_b;
  } ;

  union {
    __IOM uint32_t MIPCFG3;                     /*!< MIP partial and full frame update configuration register, used
                                                     by MIP parallel interface.                                                */

    struct {
      __IOM uint32_t RSVD0      : 10;           /*!< This field is reserved.                                                   */
      __IOM uint32_t VCKGCKLASTCYCLES : 5;      /*!< Indicates the number of last VCK/GCK counts that are transmitted
                                                     after the valid data.                                                     */
      __IOM uint32_t VCKGCKIDLECYCLES : 5;      /*!< Indicates the VCK/GCK idle counts before transmission of valid
                                                     data.                                                                     */
      __IOM uint32_t RSVD1      : 10;           /*!< This field is reserved.                                                   */
      __IOM uint32_t FIFOANDREGSRESET : 1;      /*!< When set to 1, it resets all the MIP interface FIFOs and registers.
                                                     Layers must be active.                                                    */
      __IOM uint32_t ENPARTIALUPDATE : 1;       /*!< Enable partial update in MIP interface                                    */
    } MIPCFG3_b;
  } ;

  union {
    __IOM uint32_t MIPPARTIAL;                  /*!< MIP partial and full frame update register                                */

    struct {
      __IOM uint32_t MIPPARTIALSTART : 12;      /*!< Indicates the first row of the given partial or full frame region         */
      __IOM uint32_t MIPPARTIALEND : 12;        /*!< Indicates the last row of the given partial or full frame region          */
      __IOM uint32_t RSVD       : 8;            /*!< This field is reserved.                                                   */
    } MIPPARTIAL_b;
  } ;
  __IM  uint32_t  RESERVED4[15];

  union {
    __IOM uint32_t IPVERSION;                   /*!< Current version of IP                                                     */

    struct {
      __IOM uint32_t TLCDVERSION : 32;          /*!< The current version of IP                                                 */
    } IPVERSION_b;
  } ;

  union {
    __IOM uint32_t CRC;                         /*!< if cyclic redundancy errors occur, they are written in the CRC
                                                     register.                                                                 */

