AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CRCREG     : 32;           /*!< CRC value if CRC error exists                                             */
    } CRC_b;
  } ;
  __IM  uint32_t  RESERVED5[6];

  union {
    __IOM uint32_t FORMATTRL;                   /*!< FIXME - Description needed                                                */

    struct {
      __IOM uint32_t DBIBTLB    : 3;            /*!< FIXME - Description needed                                                */
      __IOM uint32_t DBIBTHBMIPVSTOFST : 5;     /*!< FIXME - Description needed                                                */
      __IOM uint32_t DBIBTLBMIPVSTOFST : 5;     /*!< FIXME - Description needed                                                */
      __IOM uint32_t DBIBTHBMIPVSTWD : 3;       /*!< ERROR: desc VALUE MISSING                                                 */
      __IOM uint32_t SPIDCYCLESMIPVSTWD : 6;    /*!< FIXME - Description needed                                                */
      __IOM uint32_t VSTIDTHHIGHBITS : 1;       /*!< FIXME - Description needed                                                */
      __IOM uint32_t HSTFFSET   : 3;            /*!< FIXME - Description needed                                                */
      __IOM uint32_t HSTIDTH    : 3;            /*!< FIXME - Description needed                                                */
      __IOM uint32_t RSVD       : 1;            /*!< FIXME - Description needed                                                */
      __IOM uint32_t MASKPIREADYDBIBGE : 1;     /*!< FIXME - Description needed                                                */
      __IOM uint32_t MUTEPIDBIBGE : 1;          /*!< FIXME - Description needed                                                */
    } FORMATTRL_b;
  } ;

  union {
    __IOM uint32_t FORMATTRL2;                  /*!< Controls for DBI, SPI and MIP format                                      */

    struct {
      __IOM uint32_t BLNKGORMIPEN : 10;         /*!< FIXME - Description needed                                                */
      __IOM uint32_t BLNKGORMIPWIDTHLB : 6;     /*!< FIXME - Description needed                                                */
      __IOM uint32_t MIPIDTHHB  : 4;            /*!< FIXME - Description needed                                                */
      __IOM uint32_t MIPRST     : 10;           /*!< FIXME - Description needed                                                */
      __IOM uint32_t SELDBIBCLK : 2;            /*!< FIXME - Description needed                                                */
    } FORMATTRL2_b;
  } ;

  union {
    __IOM uint32_t CLKCTRLCG;                   /*!< Control the clock gaters, format and pixel clock                          */

    struct {
      __IOM uint32_t CLKIV      : 1;            /*!< Enable clock divider                                                      */
      __IOM uint32_t CLKOL      : 1;            /*!< Invert clock polarity                                                     */
      __IOM uint32_t PIXORMATCLKSWAP : 1;       /*!< Pixel generation and format clock swap                                    */
      __IOM uint32_t RSVD       : 14;           /*!< This field is reserved.                                                   */
      __IOM uint32_t PALETTEPIXCG : 1;          /*!< Palette pixel clock CG bypass                                             */
      __IOM uint32_t PALETTEBUSCG : 1;          /*!< Palette bus clock CG bypass                                               */
      __IOM uint32_t IFFMTCG    : 1;            /*!< Interface format clock CG bypass                                          */
      __IOM uint32_t IFPIXCG    : 1;            /*!< Interface pixel clock CG bypass                                           */
      __IOM uint32_t IFBUSCG    : 1;            /*!< Interface bus clock CG bypass                                             */
      __IOM uint32_t RSVD0      : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t CGYPASS    : 1;            /*!< RegFile CG bypass                                                         */
      __IOM uint32_t LAYER0PIXCG : 1;           /*!< Layer 0 pixel clock CG bypass.                                            */
      __IOM uint32_t LAYER0BUSCG : 1;           /*!< Layer 0 bus clock CG bypass                                               */
      __IOM uint32_t RSVD1      : 6;            /*!< This field is reserved.                                                   */
    } CLKCTRLCG_b;
  } ;

  union {
    __IOM uint32_t FORMATTRL3;                  /*!< FIXME - Description needed                                                */

    struct {
      __IOM uint32_t XRST       : 10;           /*!< Set the high state of XRST signal in multiple of VCK.                     */
      __IOM uint32_t SPIDBIBCSDELAYASSERT : 3;  /*!< For SPI: delay between CS activation and first positive edge
                                                     of SPI_CLK. For DBIB: delay between DC/CS activation and
                                                     negative edge of WRX.                                                     */
      __IOM uint32_t SPIDBIBCSDELAYDEASSERT : 3;/*!< For SPI: delay between last negative edge of SPI_CLK and CS
                                                     deactivation. For DBIB: delay between positive edge of
                                                     WRX and DC/CS deactivation.                                               */
      __IOM uint32_t HCKBCKMAX  : 10;           /*!< Indicates the maximum value of HCK/BCK count for MIP interface            */
      __IOM uint32_t RSVD       : 6;            /*!< This field is reserved.                                                   */
    } FORMATTRL3_b;
  } ;
  __IM  uint32_t  RESERVED6[916];

  union {
    __IOM uint32_t L0LUT;                       /*!< A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]. Layer 0 palette,gamma
                                                     correction memory region where x starts at 0 thru 255.                    */

