AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t DATALANES  : 3;            /*!< The number Data lanes to be supported is programmed by the processor      */
      __IOM uint32_t CHNUMVM    : 2;            /*!< Channel number for video mode                                             */
      __IOM uint32_t CHNUMCMODE : 2;            /*!< Channel Number for command mode is programmed by the processor            */
      __IOM uint32_t SUPCOLVIDMODE : 3;         /*!< Supported colour format for video mode.                                   */
            uint32_t            : 3;
      __IOM uint32_t REGNAME    : 3;            /*!< FIXME - Bitfield description needed here.                                 */
            uint32_t            : 16;
    } DSIFUNCPRG_b;
  } ;

  union {
    __IOM uint32_t HSTXTIMEOUT;                 /*!< Maximum duration allow for the DSi host to remain in High speed
                                                     mode for transmission.                                                    */

    struct {
      __IOM uint32_t MAXDURTOCNT : 24;          /*!< The maximum duration allowed for the DSI host to remain in high
                                                     speed mode for a transmission. If the counter expires,
                                                     processor is interrupted with HS_Tx_timeout interrupt                     */
            uint32_t            : 8;
    } HSTXTIMEOUT_b;
  } ;

  union {
    __IOM uint32_t LPRXTO;                      /*!< Timeout value to be checked for reverse communicationl                    */

    struct {
      __IOM uint32_t TOCHKRVS   : 24;           /*!< Timeout value to be checked for reverse communication. If the
                                                     counter expires, processor is interrupted with LP_Rx_timeout
                                                     interrupt.The timeout value is protocol specific. Time
                                                     out value is calculated from txclkesc(50ns).                              */
            uint32_t            : 8;
    } LPRXTO_b;
  } ;

  union {
    __IOM uint32_t TURNARNDTO;                  /*!< Timeout value to be checked after the DSI host makes a trun
                                                     around in the direction of transfers.                                     */

    struct {
      __IOM uint32_t TIMOUT     : 6;            /*!< If the counter expires, processor is interrupted with Turn_around_ack
                                                     timeout interrupt; this specified period shall be longer
                                                     then the maximum possible turnaround delay for the unit
                                                     to which the turnaround request was sent, which is 23 clock
                                                     cycles of txclkesc; any number greater than or equal to
                                                     23 is an acceptable number.                                               */
            uint32_t            : 26;
    } TURNARNDTO_b;
  } ;

  union {
    __IOM uint32_t DEVICERESETTIMER;            /*!< Timeout value to be checked for device to be reset after issuing
                                                     reset entry command                                                       */

    struct {
      __IOM uint32_t TIMOUT     : 16;           /*!< If the timer expires the DSI Host enters normal operation; This
                                                     time out value is used while contention recovery procedure;
                                                     the time out value is equal to a value longer than the
                                                     specified time required to complete the reset sequence                    */
            uint32_t            : 16;
    } DEVICERESETTIMER_b;
  } ;

  union {
    __IOM uint32_t DPIRESOLUTION;               /*!< Shows the horizontal address count in pixels                              */

    struct {
      __IOM uint32_t DPIRESOLUTION : 32;        /*!< TODO: update this register description                                    */
    } DPIRESOLUTION_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t HSYNCCNT;                    /*!< Shows the horizontal sync value in terms of byte clock.                   */

    struct {
      __IOM uint32_t HORZCNT    : 16;           /*!< rw 0000h Shows the horizontal sync value in terms of byte clock
                                                     (txbyteclkhs); Minimum HSA period should be sufficient
                                                     to transmit a Hsync start short packet(4 bytes) i) For
                                                     Non-burst Mode with sync pulse, Min value - 4 in decimal
                                                     (plus an optional 6 bytes for a zero payload blanking packet);
                                                     But if the value is less than 10 but more than 4, then
                                                     this count will be added to the HBP's count for one lane;
                                                     ii) For Non-Burst Sync Event and Burst Mode, there is no
                                                     HSA, so you can program this to zero. If you program this
                                                     register, these byte values will be added to HBP Max value
                                                     - any 12 bit value greater than 4 based on DPI resolution                 */
            uint32_t            : 16;
    } HSYNCCNT_b;
  } ;

  union {
    __IOM uint32_t HORIZBKPORCHCNT;             /*!< Shows the horizontal back porch value in terms of txbyteclkhs.            */

    struct {
      __IOM uint32_t HORZBKPCNT : 16;           /*!< For Non Burst Sync pulse mode, for one lane. Minimum HBP count
                                                     = Hsync End short packet + HBP Blanking packet overhead
                                                     (header(4) + crc (2)) + RGB packet header For other lane
                                                     counts minimum value = Minimum HBPcount / lane_count. For
                                                     Non Burst Sync event / Burst Mode there is no HSA. Minimum
                                                     HBP count = (Hsync Start short packet + HBP Blanking packet
                                                     overhead + RGB packet header) / lane_count Min value -
                                                     14 in decimal (accounted with zero payloads for blanking
                                                     packet] for one lane. Max value - any 12 bit value greater
                                                     than 14 based on DPI resolution                                           */
            uint32_t            : 16;
    } HORIZBKPORCHCNT_b;
  } ;

  union {
    __IOM uint32_t HORIZFPORCHCNT;              /*!< Shows the horizontal front porch value in terms of txbyteclkhs.           */

