AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL1    : 4;            /*!< Function select for GPIO pin 1                                            */
      __IOM uint32_t INPEN1     : 1;            /*!< Input enable for GPIO 1                                                   */
      __IOM uint32_t RDZERO1    : 1;            /*!< Return 0 for read data on GPIO 1                                          */
      __IOM uint32_t IRPTEN1    : 2;            /*!< Interrupt enable for GPIO 1                                               */
      __IOM uint32_t OUTCFG1    : 2;            /*!< Pin IO mode selection for GPIO pin 1                                      */
      __IOM uint32_t DS1        : 2;            /*!< Drive strength control for High Speed GPIO width ODT 1                    */
      __IOM uint32_t SR1        : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG1   : 3;            /*!< Pullup/Pulldown configuration for GPIO 1                                  */
      __IOM uint32_t NCESRC1    : 5;            /*!< IOMSTR Chip Select 1, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL1    : 1;            /*!< Polarity select for NCE for GPIO 1                                        */
      __IOM uint32_t TIMERSEL1  : 1;            /*!< Select if CT1 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN1      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN1      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG1 : 3;            /*!< Pullup/Pulldown configuration for GPIO 1 when in Deeper Sleep             */
            uint32_t            : 1;
    } PINCFG1_b;
  } ;

  union {
    __IOM uint32_t PINCFG2;                     /*!< Controls the operation of GPIO pin 2.                                     */

    struct {
      __IOM uint32_t FNCSEL2    : 4;            /*!< Function select for GPIO pin 2                                            */
      __IOM uint32_t INPEN2     : 1;            /*!< Input enable for GPIO 2                                                   */
      __IOM uint32_t RDZERO2    : 1;            /*!< Return 0 for read data on GPIO 2                                          */
      __IOM uint32_t IRPTEN2    : 2;            /*!< Interrupt enable for GPIO 2                                               */
      __IOM uint32_t OUTCFG2    : 2;            /*!< Pin IO mode selection for GPIO pin 2                                      */
      __IOM uint32_t DS2        : 2;            /*!< Drive strength control for High Speed GPIO width ODT 2                    */
      __IOM uint32_t SR2        : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG2   : 3;            /*!< Pullup/Pulldown configuration for GPIO 2                                  */
      __IOM uint32_t NCESRC2    : 5;            /*!< IOMSTR Chip Select 2, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL2    : 1;            /*!< Polarity select for NCE for GPIO 2                                        */
      __IOM uint32_t TIMERSEL2  : 1;            /*!< Select if CT2 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN2      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN2      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG2 : 3;            /*!< Pullup/Pulldown configuration for GPIO 2 when in Deeper Sleep             */
            uint32_t            : 1;
    } PINCFG2_b;
  } ;

  union {
    __IOM uint32_t PINCFG3;                     /*!< Controls the operation of GPIO pin 3.                                     */

    struct {
      __IOM uint32_t FNCSEL3    : 4;            /*!< Function select for GPIO pin 3                                            */
      __IOM uint32_t INPEN3     : 1;            /*!< Input enable for GPIO 3                                                   */
      __IOM uint32_t RDZERO3    : 1;            /*!< Return 0 for read data on GPIO 3                                          */
      __IOM uint32_t IRPTEN3    : 2;            /*!< Interrupt enable for GPIO 3                                               */
      __IOM uint32_t OUTCFG3    : 2;            /*!< Pin IO mode selection for GPIO pin 3                                      */
      __IOM uint32_t DS3        : 2;            /*!< Drive strength control for High Speed GPIO width ODT 3                    */
      __IOM uint32_t SR3        : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG3   : 3;            /*!< Pullup/Pulldown configuration for GPIO 3                                  */
      __IOM uint32_t NCESRC3    : 5;            /*!< IOMSTR Chip Select 3, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL3    : 1;            /*!< Polarity select for NCE for GPIO 3                                        */
      __IOM uint32_t TIMERSEL3  : 1;            /*!< Select if CT3 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN3      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN3      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG3 : 3;            /*!< Pullup/Pulldown configuration for GPIO 3 when in Deeper Sleep             */
            uint32_t            : 1;
    } PINCFG3_b;
  } ;

  union {
    __IOM uint32_t PINCFG4;                     /*!< Controls the operation of GPIO pin 4.                                     */

