AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL4    : 4;            /*!< Function select for GPIO pin 4                                            */
      __IOM uint32_t INPEN4     : 1;            /*!< Input enable for GPIO 4                                                   */
      __IOM uint32_t RDZERO4    : 1;            /*!< Return 0 for read data on GPIO 4                                          */
      __IOM uint32_t IRPTEN4    : 2;            /*!< Interrupt enable for GPIO 4                                               */
      __IOM uint32_t OUTCFG4    : 2;            /*!< Pin IO mode selection for GPIO pin 4                                      */
      __IOM uint32_t DS4        : 2;            /*!< Drive strength control for High Speed GPIO width ODT 4                    */
      __IOM uint32_t SR4        : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG4   : 3;            /*!< Pullup/Pulldown configuration for GPIO 4                                  */
      __IOM uint32_t NCESRC4    : 5;            /*!< IOMSTR Chip Select 4, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL4    : 1;            /*!< Polarity select for NCE for GPIO 4                                        */
      __IOM uint32_t TIMERSEL4  : 1;            /*!< Select if CT4 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN4      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN4      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG4 : 3;            /*!< Pullup/Pulldown configuration for GPIO 4 when in Deeper Sleep             */
            uint32_t            : 1;
    } PINCFG4_b;
  } ;

  union {
    __IOM uint32_t PINCFG5;                     /*!< Controls the operation of GPIO pin 5.                                     */

    struct {
      __IOM uint32_t FNCSEL5    : 4;            /*!< Function select for GPIO pin 5                                            */
      __IOM uint32_t INPEN5     : 1;            /*!< Input enable for GPIO 5                                                   */
      __IOM uint32_t RDZERO5    : 1;            /*!< Return 0 for read data on GPIO 5                                          */
      __IOM uint32_t IRPTEN5    : 2;            /*!< Interrupt enable for GPIO 5                                               */
      __IOM uint32_t OUTCFG5    : 2;            /*!< Pin IO mode selection for GPIO pin 5                                      */
      __IOM uint32_t DS5        : 2;            /*!< Drive strength selection for GPIO 5                                       */
      __IOM uint32_t SR5        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG5   : 3;            /*!< Pullup/Pulldown configuration for GPIO 5                                  */
      __IOM uint32_t NCESRC5    : 5;            /*!< IOMSTR Chip Select 5, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL5    : 1;            /*!< Polarity select for NCE for GPIO 5                                        */
      __IOM uint32_t TIMERSEL5  : 1;            /*!< Select if CT5 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN5      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN5      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG5_b;
  } ;

  union {
    __IOM uint32_t PINCFG6;                     /*!< Controls the operation of GPIO pin 6.                                     */

    struct {
      __IOM uint32_t FNCSEL6    : 4;            /*!< Function select for GPIO pin 6                                            */
      __IOM uint32_t INPEN6     : 1;            /*!< Input enable for GPIO 6                                                   */
      __IOM uint32_t RDZERO6    : 1;            /*!< Return 0 for read data on GPIO 6                                          */
      __IOM uint32_t IRPTEN6    : 2;            /*!< Interrupt enable for GPIO 6                                               */
      __IOM uint32_t OUTCFG6    : 2;            /*!< Pin IO mode selection for GPIO pin 6                                      */
      __IOM uint32_t DS6        : 2;            /*!< Drive strength selection for GPIO 6                                       */
      __IOM uint32_t SR6        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG6   : 3;            /*!< Pullup/Pulldown configuration for GPIO 6                                  */
      __IOM uint32_t NCESRC6    : 5;            /*!< IOMSTR Chip Select 6, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL6    : 1;            /*!< Polarity select for NCE for GPIO 6                                        */
      __IOM uint32_t TIMERSEL6  : 1;            /*!< Select if CT6 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN6      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN6      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG6_b;
  } ;

  union {
    __IOM uint32_t PINCFG7;                     /*!< Controls the operation of GPIO pin 7.                                     */

