AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL7    : 4;            /*!< Function select for GPIO pin 7                                            */
      __IOM uint32_t INPEN7     : 1;            /*!< Input enable for GPIO 7                                                   */
      __IOM uint32_t RDZERO7    : 1;            /*!< Return 0 for read data on GPIO 7                                          */
      __IOM uint32_t IRPTEN7    : 2;            /*!< Interrupt enable for GPIO 7                                               */
      __IOM uint32_t OUTCFG7    : 2;            /*!< Pin IO mode selection for GPIO pin 7                                      */
      __IOM uint32_t DS7        : 2;            /*!< Drive strength selection for GPIO 7                                       */
      __IOM uint32_t SR7        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG7   : 3;            /*!< Pullup/Pulldown configuration for GPIO 7                                  */
      __IOM uint32_t NCESRC7    : 5;            /*!< IOMSTR Chip Select 7, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL7    : 1;            /*!< Polarity select for NCE for GPIO 7                                        */
      __IOM uint32_t TIMERSEL7  : 1;            /*!< Select if CT7 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN7      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN7      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG7 : 3;            /*!< Pullup/Pulldown configuration for GPIO 7 when in Deeper Sleep             */
            uint32_t            : 1;
    } PINCFG7_b;
  } ;

  union {
    __IOM uint32_t PINCFG8;                     /*!< Controls the operation of GPIO pin 8.                                     */

    struct {
      __IOM uint32_t FNCSEL8    : 4;            /*!< Function select for GPIO pin 8                                            */
      __IOM uint32_t INPEN8     : 1;            /*!< Input enable for GPIO 8                                                   */
      __IOM uint32_t RDZERO8    : 1;            /*!< Return 0 for read data on GPIO 8                                          */
      __IOM uint32_t IRPTEN8    : 2;            /*!< Interrupt enable for GPIO 8                                               */
      __IOM uint32_t OUTCFG8    : 2;            /*!< Pin IO mode selection for GPIO pin 8                                      */
      __IOM uint32_t DS8        : 2;            /*!< Drive strength selection for GPIO 8                                       */
      __IOM uint32_t SR8        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG8   : 3;            /*!< Pullup/Pulldown configuration for GPIO 8                                  */
      __IOM uint32_t NCESRC8    : 5;            /*!< IOMSTR Chip Select 8, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL8    : 1;            /*!< Polarity select for NCE for GPIO 8                                        */
      __IOM uint32_t TIMERSEL8  : 1;            /*!< Select if CT8 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN8      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN8      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG8_b;
  } ;

  union {
    __IOM uint32_t PINCFG9;                     /*!< Controls the operation of GPIO pin 9.                                     */

    struct {
      __IOM uint32_t FNCSEL9    : 4;            /*!< Function select for GPIO pin 9                                            */
      __IOM uint32_t INPEN9     : 1;            /*!< Input enable for GPIO 9                                                   */
      __IOM uint32_t RDZERO9    : 1;            /*!< Return 0 for read data on GPIO 9                                          */
      __IOM uint32_t IRPTEN9    : 2;            /*!< Interrupt enable for GPIO 9                                               */
      __IOM uint32_t OUTCFG9    : 2;            /*!< Pin IO mode selection for GPIO pin 9                                      */
      __IOM uint32_t DS9        : 2;            /*!< Drive strength selection for GPIO 9                                       */
      __IOM uint32_t SR9        : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG9   : 3;            /*!< Pullup/Pulldown configuration for GPIO 9                                  */
      __IOM uint32_t NCESRC9    : 5;            /*!< IOMSTR Chip Select 9, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL9    : 1;            /*!< Polarity select for NCE for GPIO 9                                        */
      __IOM uint32_t TIMERSEL9  : 1;            /*!< Select if CT9 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN9      : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN9      : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
            uint32_t            : 4;
    } PINCFG9_b;
  } ;

  union {
    __IOM uint32_t PINCFG10;                    /*!< Controls the operation of GPIO pin 10.                                    */

