AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL25   : 4;            /*!< Function select for GPIO pin 25                                           */
      __IOM uint32_t INPEN25    : 1;            /*!< Input enable for GPIO 25                                                  */
      __IOM uint32_t RDZERO25   : 1;            /*!< Return 0 for read data on GPIO 25                                         */
      __IOM uint32_t IRPTEN25   : 2;            /*!< Interrupt enable for GPIO 25                                              */
      __IOM uint32_t OUTCFG25   : 2;            /*!< Pin IO mode selection for GPIO pin 25                                     */
      __IOM uint32_t DS25       : 2;            /*!< Drive strength selection for GPIO 25                                      */
      __IOM uint32_t SR25       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG25  : 3;            /*!< Pullup/Pulldown configuration for GPIO 25                                 */
      __IOM uint32_t NCESRC25   : 5;            /*!< IOMSTR Chip Select 25, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL25   : 1;            /*!< Polarity select for NCE for GPIO 25                                       */
      __IOM uint32_t TIMERSEL25 : 1;            /*!< Select if CT25 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN25     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN25     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG25 : 3;           /*!< Pullup/Pulldown configuration for GPIO 25 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG25_b;
  } ;

  union {
    __IOM uint32_t PINCFG26;                    /*!< Controls the operation of GPIO pin 26.                                    */

    struct {
      __IOM uint32_t FNCSEL26   : 4;            /*!< Function select for GPIO pin 26                                           */
      __IOM uint32_t INPEN26    : 1;            /*!< Input enable for GPIO 26                                                  */
      __IOM uint32_t RDZERO26   : 1;            /*!< Return 0 for read data on GPIO 26                                         */
      __IOM uint32_t IRPTEN26   : 2;            /*!< Interrupt enable for GPIO 26                                              */
      __IOM uint32_t OUTCFG26   : 2;            /*!< Pin IO mode selection for GPIO pin 26                                     */
      __IOM uint32_t DS26       : 2;            /*!< Drive strength selection for GPIO 26                                      */
      __IOM uint32_t SR26       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG26  : 3;            /*!< Pullup/Pulldown configuration for GPIO 26                                 */
      __IOM uint32_t NCESRC26   : 5;            /*!< IOMSTR Chip Select 26, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL26   : 1;            /*!< Polarity select for NCE for GPIO 26                                       */
      __IOM uint32_t TIMERSEL26 : 1;            /*!< Select if CT26 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN26     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN26     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG26 : 3;           /*!< Pullup/Pulldown configuration for GPIO 26 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG26_b;
  } ;

  union {
    __IOM uint32_t PINCFG27;                    /*!< Controls the operation of GPIO pin 27.                                    */

    struct {
      __IOM uint32_t FNCSEL27   : 4;            /*!< Function select for GPIO pin 27                                           */
      __IOM uint32_t INPEN27    : 1;            /*!< Input enable for GPIO 27                                                  */
      __IOM uint32_t RDZERO27   : 1;            /*!< Return 0 for read data on GPIO 27                                         */
      __IOM uint32_t IRPTEN27   : 2;            /*!< Interrupt enable for GPIO 27                                              */
      __IOM uint32_t OUTCFG27   : 2;            /*!< Pin IO mode selection for GPIO pin 27                                     */
      __IOM uint32_t DS27       : 2;            /*!< Drive strength selection for GPIO 27                                      */
      __IOM uint32_t SR27       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG27  : 3;            /*!< Pullup/Pulldown configuration for GPIO 27                                 */
      __IOM uint32_t NCESRC27   : 5;            /*!< IOMSTR Chip Select 27, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL27   : 1;            /*!< Polarity select for NCE for GPIO 27                                       */
      __IOM uint32_t TIMERSEL27 : 1;            /*!< Select if CT27 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN27     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN27     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG27 : 3;           /*!< Pullup/Pulldown configuration for GPIO 27 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG27_b;
  } ;

  union {
    __IOM uint32_t PINCFG28;                    /*!< Controls the operation of GPIO pin 28.                                    */

