AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL28   : 4;            /*!< Function select for GPIO pin 28                                           */
      __IOM uint32_t INPEN28    : 1;            /*!< Input enable for GPIO 28                                                  */
      __IOM uint32_t RDZERO28   : 1;            /*!< Return 0 for read data on GPIO 28                                         */
      __IOM uint32_t IRPTEN28   : 2;            /*!< Interrupt enable for GPIO 28                                              */
      __IOM uint32_t OUTCFG28   : 2;            /*!< Pin IO mode selection for GPIO pin 28                                     */
      __IOM uint32_t DS28       : 2;            /*!< Drive strength selection for GPIO 28                                      */
      __IOM uint32_t SR28       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG28  : 3;            /*!< Pullup/Pulldown configuration for GPIO 28                                 */
      __IOM uint32_t NCESRC28   : 5;            /*!< IOMSTR Chip Select 28, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL28   : 1;            /*!< Polarity select for NCE for GPIO 28                                       */
      __IOM uint32_t TIMERSEL28 : 1;            /*!< Select if CT28 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN28     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN28     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG28 : 3;           /*!< Pullup/Pulldown configuration for GPIO 28 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG28_b;
  } ;

  union {
    __IOM uint32_t PINCFG29;                    /*!< Controls the operation of GPIO pin 29.                                    */

    struct {
      __IOM uint32_t FNCSEL29   : 4;            /*!< Function select for GPIO pin 29                                           */
      __IOM uint32_t INPEN29    : 1;            /*!< Input enable for GPIO 29                                                  */
      __IOM uint32_t RDZERO29   : 1;            /*!< Return 0 for read data on GPIO 29                                         */
      __IOM uint32_t IRPTEN29   : 2;            /*!< Interrupt enable for GPIO 29                                              */
      __IOM uint32_t OUTCFG29   : 2;            /*!< Pin IO mode selection for GPIO pin 29                                     */
      __IOM uint32_t DS29       : 2;            /*!< Drive strength selection for GPIO 29                                      */
      __IOM uint32_t SR29       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG29  : 3;            /*!< Pullup/Pulldown configuration for GPIO 29                                 */
      __IOM uint32_t NCESRC29   : 5;            /*!< IOMSTR Chip Select 29, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL29   : 1;            /*!< Polarity select for NCE for GPIO 29                                       */
      __IOM uint32_t TIMERSEL29 : 1;            /*!< Select if CT29 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN29     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN29     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG29 : 3;           /*!< Pullup/Pulldown configuration for GPIO 29 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG29_b;
  } ;

  union {
    __IOM uint32_t PINCFG30;                    /*!< Controls the operation of GPIO pin 30.                                    */

    struct {
      __IOM uint32_t FNCSEL30   : 4;            /*!< Function select for GPIO pin 30                                           */
      __IOM uint32_t INPEN30    : 1;            /*!< Input enable for GPIO 30                                                  */
      __IOM uint32_t RDZERO30   : 1;            /*!< Return 0 for read data on GPIO 30                                         */
      __IOM uint32_t IRPTEN30   : 2;            /*!< Interrupt enable for GPIO 30                                              */
      __IOM uint32_t OUTCFG30   : 2;            /*!< Pin IO mode selection for GPIO pin 30                                     */
      __IOM uint32_t DS30       : 2;            /*!< Drive strength selection for GPIO 30                                      */
      __IOM uint32_t SR30       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG30  : 3;            /*!< Pullup/Pulldown configuration for GPIO 30                                 */
      __IOM uint32_t NCESRC30   : 5;            /*!< IOMSTR Chip Select 30, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL30   : 1;            /*!< Polarity select for NCE for GPIO 30                                       */
      __IOM uint32_t TIMERSEL30 : 1;            /*!< Select if CT30 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN30     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN30     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG30 : 3;           /*!< Pullup/Pulldown configuration for GPIO 30 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG30_b;
  } ;

  union {
    __IOM uint32_t PINCFG31;                    /*!< Controls the operation of GPIO pin 31.                                    */

