AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL37   : 4;            /*!< Function select for GPIO pin 37                                           */
      __IOM uint32_t INPEN37    : 1;            /*!< Input enable for GPIO 37                                                  */
      __IOM uint32_t RDZERO37   : 1;            /*!< Return 0 for read data on GPIO 37                                         */
      __IOM uint32_t IRPTEN37   : 2;            /*!< Interrupt enable for GPIO 37                                              */
      __IOM uint32_t OUTCFG37   : 2;            /*!< Pin IO mode selection for GPIO pin 37                                     */
      __IOM uint32_t DS37       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 37                   */
      __IOM uint32_t SR37       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG37  : 3;            /*!< Pullup/Pulldown configuration for GPIO 37                                 */
      __IOM uint32_t NCESRC37   : 5;            /*!< IOMSTR Chip Select 37, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL37   : 1;            /*!< Polarity select for NCE for GPIO 37                                       */
      __IOM uint32_t TIMERSEL37 : 1;            /*!< Select if CT37 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN37     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN37     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG37 : 3;           /*!< Pullup/Pulldown configuration for GPIO 37 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG37_b;
  } ;

  union {
    __IOM uint32_t PINCFG38;                    /*!< Controls the operation of GPIO pin 38.                                    */

    struct {
      __IOM uint32_t FNCSEL38   : 4;            /*!< Function select for GPIO pin 38                                           */
      __IOM uint32_t INPEN38    : 1;            /*!< Input enable for GPIO 38                                                  */
      __IOM uint32_t RDZERO38   : 1;            /*!< Return 0 for read data on GPIO 38                                         */
      __IOM uint32_t IRPTEN38   : 2;            /*!< Interrupt enable for GPIO 38                                              */
      __IOM uint32_t OUTCFG38   : 2;            /*!< Pin IO mode selection for GPIO pin 38                                     */
      __IOM uint32_t DS38       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 38                   */
      __IOM uint32_t SR38       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG38  : 3;            /*!< Pullup/Pulldown configuration for GPIO 38                                 */
      __IOM uint32_t NCESRC38   : 5;            /*!< IOMSTR Chip Select 38, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL38   : 1;            /*!< Polarity select for NCE for GPIO 38                                       */
      __IOM uint32_t TIMERSEL38 : 1;            /*!< Select if CT38 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN38     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN38     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG38 : 3;           /*!< Pullup/Pulldown configuration for GPIO 38 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG38_b;
  } ;

  union {
    __IOM uint32_t PINCFG39;                    /*!< Controls the operation of GPIO pin 39.                                    */

    struct {
      __IOM uint32_t FNCSEL39   : 4;            /*!< Function select for GPIO pin 39                                           */
      __IOM uint32_t INPEN39    : 1;            /*!< Input enable for GPIO 39                                                  */
      __IOM uint32_t RDZERO39   : 1;            /*!< Return 0 for read data on GPIO 39                                         */
      __IOM uint32_t IRPTEN39   : 2;            /*!< Interrupt enable for GPIO 39                                              */
      __IOM uint32_t OUTCFG39   : 2;            /*!< Pin IO mode selection for GPIO pin 39                                     */
      __IOM uint32_t DS39       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 39                   */
      __IOM uint32_t SR39       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG39  : 3;            /*!< Pullup/Pulldown configuration for GPIO 39                                 */
      __IOM uint32_t NCESRC39   : 5;            /*!< IOMSTR Chip Select 39, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL39   : 1;            /*!< Polarity select for NCE for GPIO 39                                       */
      __IOM uint32_t TIMERSEL39 : 1;            /*!< Select if CT39 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN39     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN39     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG39 : 3;           /*!< Pullup/Pulldown configuration for GPIO 39 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG39_b;
  } ;

  union {
    __IOM uint32_t PINCFG40;                    /*!< Controls the operation of GPIO pin 40.                                    */

