AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL40   : 4;            /*!< Function select for GPIO pin 40                                           */
      __IOM uint32_t INPEN40    : 1;            /*!< Input enable for GPIO 40                                                  */
      __IOM uint32_t RDZERO40   : 1;            /*!< Return 0 for read data on GPIO 40                                         */
      __IOM uint32_t IRPTEN40   : 2;            /*!< Interrupt enable for GPIO 40                                              */
      __IOM uint32_t OUTCFG40   : 2;            /*!< Pin IO mode selection for GPIO pin 40                                     */
      __IOM uint32_t DS40       : 2;            /*!< Drive strength selection for GPIO 40                                      */
      __IOM uint32_t SR40       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG40  : 3;            /*!< Pullup/Pulldown configuration for GPIO 40                                 */
      __IOM uint32_t NCESRC40   : 5;            /*!< IOMSTR Chip Select 40, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL40   : 1;            /*!< Polarity select for NCE for GPIO 40                                       */
      __IOM uint32_t TIMERSEL40 : 1;            /*!< Select if CT40 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN40     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN40     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG40 : 3;           /*!< Pullup/Pulldown configuration for GPIO 40 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG40_b;
  } ;

  union {
    __IOM uint32_t PINCFG41;                    /*!< Controls the operation of GPIO pin 41.                                    */

    struct {
      __IOM uint32_t FNCSEL41   : 4;            /*!< Function select for GPIO pin 41                                           */
      __IOM uint32_t INPEN41    : 1;            /*!< Input enable for GPIO 41                                                  */
      __IOM uint32_t RDZERO41   : 1;            /*!< Return 0 for read data on GPIO 41                                         */
      __IOM uint32_t IRPTEN41   : 2;            /*!< Interrupt enable for GPIO 41                                              */
      __IOM uint32_t OUTCFG41   : 2;            /*!< Pin IO mode selection for GPIO pin 41                                     */
      __IOM uint32_t DS41       : 2;            /*!< Drive strength selection for GPIO 41                                      */
      __IOM uint32_t SR41       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG41  : 3;            /*!< Pullup/Pulldown configuration for GPIO 41                                 */
      __IOM uint32_t NCESRC41   : 5;            /*!< IOMSTR Chip Select 41, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL41   : 1;            /*!< Polarity select for NCE for GPIO 41                                       */
      __IOM uint32_t TIMERSEL41 : 1;            /*!< Select if CT41 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN41     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN41     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG41 : 3;           /*!< Pullup/Pulldown configuration for GPIO 41 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG41_b;
  } ;

  union {
    __IOM uint32_t PINCFG42;                    /*!< Controls the operation of GPIO pin 42.                                    */

    struct {
      __IOM uint32_t FNCSEL42   : 4;            /*!< Function select for GPIO pin 42                                           */
      __IOM uint32_t INPEN42    : 1;            /*!< Input enable for GPIO 42                                                  */
      __IOM uint32_t RDZERO42   : 1;            /*!< Return 0 for read data on GPIO 42                                         */
      __IOM uint32_t IRPTEN42   : 2;            /*!< Interrupt enable for GPIO 42                                              */
      __IOM uint32_t OUTCFG42   : 2;            /*!< Pin IO mode selection for GPIO pin 42                                     */
      __IOM uint32_t DS42       : 2;            /*!< Drive strength selection for GPIO 42                                      */
      __IOM uint32_t SR42       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG42  : 3;            /*!< Pullup/Pulldown configuration for GPIO 42                                 */
      __IOM uint32_t NCESRC42   : 5;            /*!< IOMSTR Chip Select 42, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL42   : 1;            /*!< Polarity select for NCE for GPIO 42                                       */
      __IOM uint32_t TIMERSEL42 : 1;            /*!< Select if CT42 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN42     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN42     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG42 : 3;           /*!< Pullup/Pulldown configuration for GPIO 42 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG42_b;
  } ;

  union {
    __IOM uint32_t PINCFG43;                    /*!< Controls the operation of GPIO pin 43.                                    */

