AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL52   : 4;            /*!< Function select for GPIO pin 52                                           */
      __IOM uint32_t INPEN52    : 1;            /*!< Input enable for GPIO 52                                                  */
      __IOM uint32_t RDZERO52   : 1;            /*!< Return 0 for read data on GPIO 52                                         */
      __IOM uint32_t IRPTEN52   : 2;            /*!< Interrupt enable for GPIO 52                                              */
      __IOM uint32_t OUTCFG52   : 2;            /*!< Pin IO mode selection for GPIO pin 52                                     */
      __IOM uint32_t DS52       : 2;            /*!< Drive strength selection for GPIO 52                                      */
      __IOM uint32_t SR52       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG52  : 3;            /*!< Pullup/Pulldown configuration for GPIO 52                                 */
      __IOM uint32_t NCESRC52   : 5;            /*!< IOMSTR Chip Select 52, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL52   : 1;            /*!< Polarity select for NCE for GPIO 52                                       */
      __IOM uint32_t TIMERSEL52 : 1;            /*!< Select if CT52 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN52     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN52     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG52 : 3;           /*!< Pullup/Pulldown configuration for GPIO 52 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG52_b;
  } ;

  union {
    __IOM uint32_t PINCFG53;                    /*!< Controls the operation of GPIO pin 53.                                    */

    struct {
      __IOM uint32_t FNCSEL53   : 4;            /*!< Function select for GPIO pin 53                                           */
      __IOM uint32_t INPEN53    : 1;            /*!< Input enable for GPIO 53                                                  */
      __IOM uint32_t RDZERO53   : 1;            /*!< Return 0 for read data on GPIO 53                                         */
      __IOM uint32_t IRPTEN53   : 2;            /*!< Interrupt enable for GPIO 53                                              */
      __IOM uint32_t OUTCFG53   : 2;            /*!< Pin IO mode selection for GPIO pin 53                                     */
      __IOM uint32_t DS53       : 2;            /*!< Drive strength selection for GPIO 53                                      */
      __IOM uint32_t SR53       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG53  : 3;            /*!< Pullup/Pulldown configuration for GPIO 53                                 */
      __IOM uint32_t NCESRC53   : 5;            /*!< IOMSTR Chip Select 53, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL53   : 1;            /*!< Polarity select for NCE for GPIO 53                                       */
      __IOM uint32_t TIMERSEL53 : 1;            /*!< Select if CT53 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN53     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN53     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG53 : 3;           /*!< Pullup/Pulldown configuration for GPIO 53 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG53_b;
  } ;

  union {
    __IOM uint32_t PINCFG54;                    /*!< Controls the operation of GPIO pin 54.                                    */

    struct {
      __IOM uint32_t FNCSEL54   : 4;            /*!< Function select for GPIO pin 54                                           */
      __IOM uint32_t INPEN54    : 1;            /*!< Input enable for GPIO 54                                                  */
      __IOM uint32_t RDZERO54   : 1;            /*!< Return 0 for read data on GPIO 54                                         */
      __IOM uint32_t IRPTEN54   : 2;            /*!< Interrupt enable for GPIO 54                                              */
      __IOM uint32_t OUTCFG54   : 2;            /*!< Pin IO mode selection for GPIO pin 54                                     */
      __IOM uint32_t DS54       : 2;            /*!< Drive strength selection for GPIO 54                                      */
      __IOM uint32_t SR54       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG54  : 3;            /*!< Pullup/Pulldown configuration for GPIO 54                                 */
      __IOM uint32_t NCESRC54   : 5;            /*!< IOMSTR Chip Select 54, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL54   : 1;            /*!< Polarity select for NCE for GPIO 54                                       */
      __IOM uint32_t TIMERSEL54 : 1;            /*!< Select if CT54 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN54     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN54     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG54 : 3;           /*!< Pullup/Pulldown configuration for GPIO 54 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG54_b;
  } ;

  union {
    __IOM uint32_t PINCFG55;                    /*!< Controls the operation of GPIO pin 55.                                    */

