AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL58   : 4;            /*!< Function select for GPIO pin 58                                           */
      __IOM uint32_t INPEN58    : 1;            /*!< Input enable for GPIO 58                                                  */
      __IOM uint32_t RDZERO58   : 1;            /*!< Return 0 for read data on GPIO 58                                         */
      __IOM uint32_t IRPTEN58   : 2;            /*!< Interrupt enable for GPIO 58                                              */
      __IOM uint32_t OUTCFG58   : 2;            /*!< Pin IO mode selection for GPIO pin 58                                     */
      __IOM uint32_t DS58       : 2;            /*!< Drive strength selection for GPIO 58                                      */
      __IOM uint32_t SR58       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG58  : 3;            /*!< Pullup/Pulldown configuration for GPIO 58                                 */
      __IOM uint32_t NCESRC58   : 5;            /*!< IOMSTR Chip Select 58, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL58   : 1;            /*!< Polarity select for NCE for GPIO 58                                       */
      __IOM uint32_t TIMERSEL58 : 1;            /*!< Select if CT58 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN58     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN58     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG58 : 3;           /*!< Pullup/Pulldown configuration for GPIO 58 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG58_b;
  } ;

  union {
    __IOM uint32_t PINCFG59;                    /*!< Controls the operation of GPIO pin 59.                                    */

    struct {
      __IOM uint32_t FNCSEL59   : 4;            /*!< Function select for GPIO pin 59                                           */
      __IOM uint32_t INPEN59    : 1;            /*!< Input enable for GPIO 59                                                  */
      __IOM uint32_t RDZERO59   : 1;            /*!< Return 0 for read data on GPIO 59                                         */
      __IOM uint32_t IRPTEN59   : 2;            /*!< Interrupt enable for GPIO 59                                              */
      __IOM uint32_t OUTCFG59   : 2;            /*!< Pin IO mode selection for GPIO pin 59                                     */
      __IOM uint32_t DS59       : 2;            /*!< Drive strength selection for GPIO 59                                      */
      __IOM uint32_t SR59       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG59  : 3;            /*!< Pullup/Pulldown configuration for GPIO 59                                 */
      __IOM uint32_t NCESRC59   : 5;            /*!< IOMSTR Chip Select 59, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL59   : 1;            /*!< Polarity select for NCE for GPIO 59                                       */
      __IOM uint32_t TIMERSEL59 : 1;            /*!< Select if CT59 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN59     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN59     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG59 : 3;           /*!< Pullup/Pulldown configuration for GPIO 59 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG59_b;
  } ;

  union {
    __IOM uint32_t PINCFG60;                    /*!< Controls the operation of GPIO pin 60.                                    */

    struct {
      __IOM uint32_t FNCSEL60   : 4;            /*!< Function select for GPIO pin 60                                           */
      __IOM uint32_t INPEN60    : 1;            /*!< Input enable for GPIO 60                                                  */
      __IOM uint32_t RDZERO60   : 1;            /*!< Return 0 for read data on GPIO 60                                         */
      __IOM uint32_t IRPTEN60   : 2;            /*!< Interrupt enable for GPIO 60                                              */
      __IOM uint32_t OUTCFG60   : 2;            /*!< Pin IO mode selection for GPIO pin 60                                     */
      __IOM uint32_t DS60       : 2;            /*!< Drive strength selection for GPIO 60                                      */
      __IOM uint32_t SR60       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG60  : 3;            /*!< Pullup/Pulldown configuration for GPIO 60                                 */
      __IOM uint32_t NCESRC60   : 5;            /*!< IOMSTR Chip Select 60, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL60   : 1;            /*!< Polarity select for NCE for GPIO 60                                       */
      __IOM uint32_t TIMERSEL60 : 1;            /*!< Select if CT60 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN60     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN60     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG60 : 3;           /*!< Pullup/Pulldown configuration for GPIO 60 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG60_b;
  } ;

  union {
    __IOM uint32_t PINCFG61;                    /*!< Controls the operation of GPIO pin 61.                                    */

