AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL61   : 4;            /*!< Function select for GPIO pin 61                                           */
      __IOM uint32_t INPEN61    : 1;            /*!< Input enable for GPIO 61                                                  */
      __IOM uint32_t RDZERO61   : 1;            /*!< Return 0 for read data on GPIO 61                                         */
      __IOM uint32_t IRPTEN61   : 2;            /*!< Interrupt enable for GPIO 61                                              */
      __IOM uint32_t OUTCFG61   : 2;            /*!< Pin IO mode selection for GPIO pin 61                                     */
      __IOM uint32_t DS61       : 2;            /*!< Drive strength selection for GPIO 61                                      */
      __IOM uint32_t SR61       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG61  : 3;            /*!< Pullup/Pulldown configuration for GPIO 61                                 */
      __IOM uint32_t NCESRC61   : 5;            /*!< IOMSTR Chip Select 61, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL61   : 1;            /*!< Polarity select for NCE for GPIO 61                                       */
      __IOM uint32_t TIMERSEL61 : 1;            /*!< Select if CT61 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN61     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN61     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG61 : 3;           /*!< Pullup/Pulldown configuration for GPIO 61 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG61_b;
  } ;

  union {
    __IOM uint32_t PINCFG62;                    /*!< Controls the operation of GPIO pin 62.                                    */

    struct {
      __IOM uint32_t FNCSEL62   : 4;            /*!< Function select for GPIO pin 62                                           */
      __IOM uint32_t INPEN62    : 1;            /*!< Input enable for GPIO 62                                                  */
      __IOM uint32_t RDZERO62   : 1;            /*!< Return 0 for read data on GPIO 62                                         */
      __IOM uint32_t IRPTEN62   : 2;            /*!< Interrupt enable for GPIO 62                                              */
      __IOM uint32_t OUTCFG62   : 2;            /*!< Pin IO mode selection for GPIO pin 62                                     */
      __IOM uint32_t DS62       : 2;            /*!< Drive strength selection for GPIO 62                                      */
      __IOM uint32_t SR62       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG62  : 3;            /*!< Pullup/Pulldown configuration for GPIO 62                                 */
      __IOM uint32_t NCESRC62   : 5;            /*!< IOMSTR Chip Select 62, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL62   : 1;            /*!< Polarity select for NCE for GPIO 62                                       */
      __IOM uint32_t TIMERSEL62 : 1;            /*!< Select if CT62 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN62     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN62     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG62 : 3;           /*!< Pullup/Pulldown configuration for GPIO 62 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG62_b;
  } ;

  union {
    __IOM uint32_t PINCFG63;                    /*!< Controls the operation of GPIO pin 63.                                    */

    struct {
      __IOM uint32_t FNCSEL63   : 4;            /*!< Function select for GPIO pin 63                                           */
      __IOM uint32_t INPEN63    : 1;            /*!< Input enable for GPIO 63                                                  */
      __IOM uint32_t RDZERO63   : 1;            /*!< Return 0 for read data on GPIO 63                                         */
      __IOM uint32_t IRPTEN63   : 2;            /*!< Interrupt enable for GPIO 63                                              */
      __IOM uint32_t OUTCFG63   : 2;            /*!< Pin IO mode selection for GPIO pin 63                                     */
      __IOM uint32_t DS63       : 2;            /*!< Drive strength selection for GPIO 63                                      */
      __IOM uint32_t SR63       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG63  : 3;            /*!< Pullup/Pulldown configuration for GPIO 63                                 */
      __IOM uint32_t NCESRC63   : 5;            /*!< IOMSTR Chip Select 63, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL63   : 1;            /*!< Polarity select for NCE for GPIO 63                                       */
      __IOM uint32_t TIMERSEL63 : 1;            /*!< Select if CT63 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN63     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN63     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG63 : 3;           /*!< Pullup/Pulldown configuration for GPIO 63 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG63_b;
  } ;

  union {
    __IOM uint32_t PINCFG64;                    /*!< Controls the operation of GPIO pin 64.                                    */

