AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL73   : 4;            /*!< Function select for GPIO pin 73                                           */
      __IOM uint32_t INPEN73    : 1;            /*!< Input enable for GPIO 73                                                  */
      __IOM uint32_t RDZERO73   : 1;            /*!< Return 0 for read data on GPIO 73                                         */
      __IOM uint32_t IRPTEN73   : 2;            /*!< Interrupt enable for GPIO 73                                              */
      __IOM uint32_t OUTCFG73   : 2;            /*!< Pin IO mode selection for GPIO pin 73                                     */
      __IOM uint32_t DS73       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 73                   */
      __IOM uint32_t SR73       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG73  : 3;            /*!< Pullup/Pulldown configuration for GPIO 73                                 */
      __IOM uint32_t NCESRC73   : 5;            /*!< IOMSTR Chip Select 73, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL73   : 1;            /*!< Polarity select for NCE for GPIO 73                                       */
      __IOM uint32_t TIMERSEL73 : 1;            /*!< Select if CT73 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN73     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN73     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG73 : 3;           /*!< Pullup/Pulldown configuration for GPIO 73 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG73_b;
  } ;

  union {
    __IOM uint32_t PINCFG74;                    /*!< Controls the operation of GPIO pin 74.                                    */

    struct {
      __IOM uint32_t FNCSEL74   : 4;            /*!< Function select for GPIO pin 74                                           */
      __IOM uint32_t INPEN74    : 1;            /*!< Input enable for GPIO 74                                                  */
      __IOM uint32_t RDZERO74   : 1;            /*!< Return 0 for read data on GPIO 74                                         */
      __IOM uint32_t IRPTEN74   : 2;            /*!< Interrupt enable for GPIO 74                                              */
      __IOM uint32_t OUTCFG74   : 2;            /*!< Pin IO mode selection for GPIO pin 74                                     */
      __IOM uint32_t DS74       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 74                   */
      __IOM uint32_t SR74       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG74  : 3;            /*!< Pullup/Pulldown configuration for GPIO 74                                 */
      __IOM uint32_t NCESRC74   : 5;            /*!< IOMSTR Chip Select 74, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL74   : 1;            /*!< Polarity select for NCE for GPIO 74                                       */
      __IOM uint32_t TIMERSEL74 : 1;            /*!< Select if CT74 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN74     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN74     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG74 : 3;           /*!< Pullup/Pulldown configuration for GPIO 74 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG74_b;
  } ;

  union {
    __IOM uint32_t PINCFG75;                    /*!< Controls the operation of GPIO pin 75.                                    */

    struct {
      __IOM uint32_t FNCSEL75   : 4;            /*!< Function select for GPIO pin 75                                           */
      __IOM uint32_t INPEN75    : 1;            /*!< Input enable for GPIO 75                                                  */
      __IOM uint32_t RDZERO75   : 1;            /*!< Return 0 for read data on GPIO 75                                         */
      __IOM uint32_t IRPTEN75   : 2;            /*!< Interrupt enable for GPIO 75                                              */
      __IOM uint32_t OUTCFG75   : 2;            /*!< Pin IO mode selection for GPIO pin 75                                     */
      __IOM uint32_t DS75       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 75                   */
      __IOM uint32_t SR75       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG75  : 3;            /*!< Pullup/Pulldown configuration for GPIO 75                                 */
      __IOM uint32_t NCESRC75   : 5;            /*!< IOMSTR Chip Select 75, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL75   : 1;            /*!< Polarity select for NCE for GPIO 75                                       */
      __IOM uint32_t TIMERSEL75 : 1;            /*!< Select if CT75 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN75     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN75     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG75 : 3;           /*!< Pullup/Pulldown configuration for GPIO 75 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG75_b;
  } ;

  union {
    __IOM uint32_t PINCFG76;                    /*!< Controls the operation of GPIO pin 76.                                    */

