AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL76   : 4;            /*!< Function select for GPIO pin 76                                           */
      __IOM uint32_t INPEN76    : 1;            /*!< Input enable for GPIO 76                                                  */
      __IOM uint32_t RDZERO76   : 1;            /*!< Return 0 for read data on GPIO 76                                         */
      __IOM uint32_t IRPTEN76   : 2;            /*!< Interrupt enable for GPIO 76                                              */
      __IOM uint32_t OUTCFG76   : 2;            /*!< Pin IO mode selection for GPIO pin 76                                     */
      __IOM uint32_t DS76       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 76                   */
      __IOM uint32_t SR76       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG76  : 3;            /*!< Pullup/Pulldown configuration for GPIO 76                                 */
      __IOM uint32_t NCESRC76   : 5;            /*!< IOMSTR Chip Select 76, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL76   : 1;            /*!< Polarity select for NCE for GPIO 76                                       */
      __IOM uint32_t TIMERSEL76 : 1;            /*!< Select if CT76 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN76     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN76     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG76 : 3;           /*!< Pullup/Pulldown configuration for GPIO 76 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG76_b;
  } ;

  union {
    __IOM uint32_t PINCFG77;                    /*!< Controls the operation of GPIO pin 77.                                    */

    struct {
      __IOM uint32_t FNCSEL77   : 4;            /*!< Function select for GPIO pin 77                                           */
      __IOM uint32_t INPEN77    : 1;            /*!< Input enable for GPIO 77                                                  */
      __IOM uint32_t RDZERO77   : 1;            /*!< Return 0 for read data on GPIO 77                                         */
      __IOM uint32_t IRPTEN77   : 2;            /*!< Interrupt enable for GPIO 77                                              */
      __IOM uint32_t OUTCFG77   : 2;            /*!< Pin IO mode selection for GPIO pin 77                                     */
      __IOM uint32_t DS77       : 2;            /*!< Drive strength control for High Speed GPIO width ODT 77                   */
      __IOM uint32_t SR77       : 1;            /*!< Activates 2.5V level shifter for faster performance.                      */
      __IOM uint32_t PULLCFG77  : 3;            /*!< Pullup/Pulldown configuration for GPIO 77                                 */
      __IOM uint32_t NCESRC77   : 5;            /*!< IOMSTR Chip Select 77, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL77   : 1;            /*!< Polarity select for NCE for GPIO 77                                       */
      __IOM uint32_t TIMERSEL77 : 1;            /*!< Select if CT77 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN77     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN77     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG77 : 3;           /*!< Pullup/Pulldown configuration for GPIO 77 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG77_b;
  } ;

  union {
    __IOM uint32_t PINCFG78;                    /*!< Controls the operation of GPIO pin 78.                                    */

    struct {
      __IOM uint32_t FNCSEL78   : 4;            /*!< Function select for GPIO pin 78                                           */
      __IOM uint32_t INPEN78    : 1;            /*!< Input enable for GPIO 78                                                  */
      __IOM uint32_t RDZERO78   : 1;            /*!< Return 0 for read data on GPIO 78                                         */
      __IOM uint32_t IRPTEN78   : 2;            /*!< Interrupt enable for GPIO 78                                              */
      __IOM uint32_t OUTCFG78   : 2;            /*!< Pin IO mode selection for GPIO pin 78                                     */
      __IOM uint32_t DS78       : 2;            /*!< Drive strength selection for GPIO 78                                      */
      __IOM uint32_t SR78       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG78  : 3;            /*!< Pullup/Pulldown configuration for GPIO 78                                 */
      __IOM uint32_t NCESRC78   : 5;            /*!< IOMSTR Chip Select 78, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL78   : 1;            /*!< Polarity select for NCE for GPIO 78                                       */
      __IOM uint32_t TIMERSEL78 : 1;            /*!< Select if CT78 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN78     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN78     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG78 : 3;           /*!< Pullup/Pulldown configuration for GPIO 78 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG78_b;
  } ;

  union {
    __IOM uint32_t PINCFG79;                    /*!< Controls the operation of GPIO pin 79.                                    */

