AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL85   : 4;            /*!< Function select for GPIO pin 85                                           */
      __IOM uint32_t INPEN85    : 1;            /*!< Input enable for GPIO 85                                                  */
      __IOM uint32_t RDZERO85   : 1;            /*!< Return 0 for read data on GPIO 85                                         */
      __IOM uint32_t IRPTEN85   : 2;            /*!< Interrupt enable for GPIO 85                                              */
      __IOM uint32_t OUTCFG85   : 2;            /*!< Pin IO mode selection for GPIO pin 85                                     */
      __IOM uint32_t DS85       : 2;            /*!< Drive strength selection for GPIO 85                                      */
      __IOM uint32_t SR85       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG85  : 3;            /*!< Pullup/Pulldown configuration for GPIO 85                                 */
      __IOM uint32_t NCESRC85   : 5;            /*!< IOMSTR Chip Select 85, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL85   : 1;            /*!< Polarity select for NCE for GPIO 85                                       */
      __IOM uint32_t TIMERSEL85 : 1;            /*!< Select if CT85 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN85     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN85     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG85 : 3;           /*!< Pullup/Pulldown configuration for GPIO 85 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG85_b;
  } ;

  union {
    __IOM uint32_t PINCFG86;                    /*!< Controls the operation of GPIO pin 86.                                    */

    struct {
      __IOM uint32_t FNCSEL86   : 4;            /*!< Function select for GPIO pin 86                                           */
      __IOM uint32_t INPEN86    : 1;            /*!< Input enable for GPIO 86                                                  */
      __IOM uint32_t RDZERO86   : 1;            /*!< Return 0 for read data on GPIO 86                                         */
      __IOM uint32_t IRPTEN86   : 2;            /*!< Interrupt enable for GPIO 86                                              */
      __IOM uint32_t OUTCFG86   : 2;            /*!< Pin IO mode selection for GPIO pin 86                                     */
      __IOM uint32_t DS86       : 2;            /*!< Drive strength selection for GPIO 86                                      */
      __IOM uint32_t SR86       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG86  : 3;            /*!< Pullup/Pulldown configuration for GPIO 86                                 */
      __IOM uint32_t NCESRC86   : 5;            /*!< IOMSTR Chip Select 86, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL86   : 1;            /*!< Polarity select for NCE for GPIO 86                                       */
      __IOM uint32_t TIMERSEL86 : 1;            /*!< Select if CT86 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN86     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN86     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG86 : 3;           /*!< Pullup/Pulldown configuration for GPIO 86 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG86_b;
  } ;

  union {
    __IOM uint32_t PINCFG87;                    /*!< Controls the operation of GPIO pin 87.                                    */

    struct {
      __IOM uint32_t FNCSEL87   : 4;            /*!< Function select for GPIO pin 87                                           */
      __IOM uint32_t INPEN87    : 1;            /*!< Input enable for GPIO 87                                                  */
      __IOM uint32_t RDZERO87   : 1;            /*!< Return 0 for read data on GPIO 87                                         */
      __IOM uint32_t IRPTEN87   : 2;            /*!< Interrupt enable for GPIO 87                                              */
      __IOM uint32_t OUTCFG87   : 2;            /*!< Pin IO mode selection for GPIO pin 87                                     */
      __IOM uint32_t DS87       : 2;            /*!< Drive strength selection for GPIO 87                                      */
      __IOM uint32_t SR87       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG87  : 3;            /*!< Pullup/Pulldown configuration for GPIO 87                                 */
      __IOM uint32_t NCESRC87   : 5;            /*!< IOMSTR Chip Select 87, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL87   : 1;            /*!< Polarity select for NCE for GPIO 87                                       */
      __IOM uint32_t TIMERSEL87 : 1;            /*!< Select if CT87 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN87     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN87     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG87 : 3;           /*!< Pullup/Pulldown configuration for GPIO 87 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG87_b;
  } ;

  union {
    __IOM uint32_t PINCFG88;                    /*!< Controls the operation of GPIO pin 88.                                    */

