AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL91   : 4;            /*!< Function select for GPIO pin 91                                           */
      __IOM uint32_t INPEN91    : 1;            /*!< Input enable for GPIO 91                                                  */
      __IOM uint32_t RDZERO91   : 1;            /*!< Return 0 for read data on GPIO 91                                         */
      __IOM uint32_t IRPTEN91   : 2;            /*!< Interrupt enable for GPIO 91                                              */
      __IOM uint32_t OUTCFG91   : 2;            /*!< Pin IO mode selection for GPIO pin 91                                     */
      __IOM uint32_t DS91       : 2;            /*!< Drive strength selection for GPIO 91                                      */
      __IOM uint32_t SR91       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG91  : 3;            /*!< Pullup/Pulldown configuration for GPIO 91                                 */
      __IOM uint32_t NCESRC91   : 5;            /*!< IOMSTR Chip Select 91, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL91   : 1;            /*!< Polarity select for NCE for GPIO 91                                       */
      __IOM uint32_t TIMERSEL91 : 1;            /*!< Select if CT91 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN91     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN91     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG91 : 3;           /*!< Pullup/Pulldown configuration for GPIO 91 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG91_b;
  } ;

  union {
    __IOM uint32_t PINCFG92;                    /*!< Controls the operation of GPIO pin 92.                                    */

    struct {
      __IOM uint32_t FNCSEL92   : 4;            /*!< Function select for GPIO pin 92                                           */
      __IOM uint32_t INPEN92    : 1;            /*!< Input enable for GPIO 92                                                  */
      __IOM uint32_t RDZERO92   : 1;            /*!< Return 0 for read data on GPIO 92                                         */
      __IOM uint32_t IRPTEN92   : 2;            /*!< Interrupt enable for GPIO 92                                              */
      __IOM uint32_t OUTCFG92   : 2;            /*!< Pin IO mode selection for GPIO pin 92                                     */
      __IOM uint32_t DS92       : 2;            /*!< Drive strength selection for GPIO 92                                      */
      __IOM uint32_t SR92       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG92  : 3;            /*!< Pullup/Pulldown configuration for GPIO 92                                 */
      __IOM uint32_t NCESRC92   : 5;            /*!< IOMSTR Chip Select 92, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL92   : 1;            /*!< Polarity select for NCE for GPIO 92                                       */
      __IOM uint32_t TIMERSEL92 : 1;            /*!< Select if CT92 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN92     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN92     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG92 : 3;           /*!< Pullup/Pulldown configuration for GPIO 92 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG92_b;
  } ;

  union {
    __IOM uint32_t PINCFG93;                    /*!< Controls the operation of GPIO pin 93.                                    */

    struct {
      __IOM uint32_t FNCSEL93   : 4;            /*!< Function select for GPIO pin 93                                           */
      __IOM uint32_t INPEN93    : 1;            /*!< Input enable for GPIO 93                                                  */
      __IOM uint32_t RDZERO93   : 1;            /*!< Return 0 for read data on GPIO 93                                         */
      __IOM uint32_t IRPTEN93   : 2;            /*!< Interrupt enable for GPIO 93                                              */
      __IOM uint32_t OUTCFG93   : 2;            /*!< Pin IO mode selection for GPIO pin 93                                     */
      __IOM uint32_t DS93       : 2;            /*!< Drive strength selection for GPIO 93                                      */
      __IOM uint32_t SR93       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG93  : 3;            /*!< Pullup/Pulldown configuration for GPIO 93                                 */
      __IOM uint32_t NCESRC93   : 5;            /*!< IOMSTR Chip Select 93, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL93   : 1;            /*!< Polarity select for NCE for GPIO 93                                       */
      __IOM uint32_t TIMERSEL93 : 1;            /*!< Select if CT93 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN93     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN93     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG93 : 3;           /*!< Pullup/Pulldown configuration for GPIO 93 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG93_b;
  } ;

  union {
    __IOM uint32_t PINCFG94;                    /*!< Controls the operation of GPIO pin 94.                                    */

