AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL97   : 4;            /*!< Function select for GPIO pin 97                                           */
      __IOM uint32_t INPEN97    : 1;            /*!< Input enable for GPIO 97                                                  */
      __IOM uint32_t RDZERO97   : 1;            /*!< Return 0 for read data on GPIO 97                                         */
      __IOM uint32_t IRPTEN97   : 2;            /*!< Interrupt enable for GPIO 97                                              */
      __IOM uint32_t OUTCFG97   : 2;            /*!< Pin IO mode selection for GPIO pin 97                                     */
      __IOM uint32_t DS97       : 2;            /*!< Drive strength selection for GPIO 97                                      */
      __IOM uint32_t SR97       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG97  : 3;            /*!< Pullup/Pulldown configuration for GPIO 97                                 */
      __IOM uint32_t NCESRC97   : 5;            /*!< IOMSTR Chip Select 97, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL97   : 1;            /*!< Polarity select for NCE for GPIO 97                                       */
      __IOM uint32_t TIMERSEL97 : 1;            /*!< Select if CT97 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN97     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN97     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG97 : 3;           /*!< Pullup/Pulldown configuration for GPIO 97 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG97_b;
  } ;

  union {
    __IOM uint32_t PINCFG98;                    /*!< Controls the operation of GPIO pin 98.                                    */

    struct {
      __IOM uint32_t FNCSEL98   : 4;            /*!< Function select for GPIO pin 98                                           */
      __IOM uint32_t INPEN98    : 1;            /*!< Input enable for GPIO 98                                                  */
      __IOM uint32_t RDZERO98   : 1;            /*!< Return 0 for read data on GPIO 98                                         */
      __IOM uint32_t IRPTEN98   : 2;            /*!< Interrupt enable for GPIO 98                                              */
      __IOM uint32_t OUTCFG98   : 2;            /*!< Pin IO mode selection for GPIO pin 98                                     */
      __IOM uint32_t DS98       : 2;            /*!< Drive strength selection for GPIO 98                                      */
      __IOM uint32_t SR98       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG98  : 3;            /*!< Pullup/Pulldown configuration for GPIO 98                                 */
      __IOM uint32_t NCESRC98   : 5;            /*!< IOMSTR Chip Select 98, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL98   : 1;            /*!< Polarity select for NCE for GPIO 98                                       */
      __IOM uint32_t TIMERSEL98 : 1;            /*!< Select if CT98 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN98     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN98     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG98 : 3;           /*!< Pullup/Pulldown configuration for GPIO 98 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG98_b;
  } ;

  union {
    __IOM uint32_t PINCFG99;                    /*!< Controls the operation of GPIO pin 99.                                    */

    struct {
      __IOM uint32_t FNCSEL99   : 4;            /*!< Function select for GPIO pin 99                                           */
      __IOM uint32_t INPEN99    : 1;            /*!< Input enable for GPIO 99                                                  */
      __IOM uint32_t RDZERO99   : 1;            /*!< Return 0 for read data on GPIO 99                                         */
      __IOM uint32_t IRPTEN99   : 2;            /*!< Interrupt enable for GPIO 99                                              */
      __IOM uint32_t OUTCFG99   : 2;            /*!< Pin IO mode selection for GPIO pin 99                                     */
      __IOM uint32_t DS99       : 2;            /*!< Drive strength selection for GPIO 99                                      */
      __IOM uint32_t SR99       : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG99  : 3;            /*!< Pullup/Pulldown configuration for GPIO 99                                 */
      __IOM uint32_t NCESRC99   : 5;            /*!< IOMSTR Chip Select 99, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL99   : 1;            /*!< Polarity select for NCE for GPIO 99                                       */
      __IOM uint32_t TIMERSEL99 : 1;            /*!< Select if CT99 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN99     : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN99     : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG99 : 3;           /*!< Pullup/Pulldown configuration for GPIO 99 when in Deeper Sleep            */
            uint32_t            : 1;
    } PINCFG99_b;
  } ;

  union {
    __IOM uint32_t PINCFG100;                   /*!< Controls the operation of GPIO pin 100.                                   */

