AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL100  : 4;            /*!< Function select for GPIO pin 100                                          */
      __IOM uint32_t INPEN100   : 1;            /*!< Input enable for GPIO 100                                                 */
      __IOM uint32_t RDZERO100  : 1;            /*!< Return 0 for read data on GPIO 100                                        */
      __IOM uint32_t IRPTEN100  : 2;            /*!< Interrupt enable for GPIO 100                                             */
      __IOM uint32_t OUTCFG100  : 2;            /*!< Pin IO mode selection for GPIO pin 100                                    */
      __IOM uint32_t DS100      : 2;            /*!< Drive strength selection for GPIO 100                                     */
      __IOM uint32_t SR100      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG100 : 3;            /*!< Pullup/Pulldown configuration for GPIO 100                                */
      __IOM uint32_t NCESRC100  : 5;            /*!< IOMSTR Chip Select 100, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL100  : 1;            /*!< Polarity select for NCE for GPIO 100                                      */
      __IOM uint32_t TIMERSEL100 : 1;           /*!< Select if CT100 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN100    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN100    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG100 : 3;          /*!< Pullup/Pulldown configuration for GPIO 100 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG100_b;
  } ;

  union {
    __IOM uint32_t PINCFG101;                   /*!< Controls the operation of GPIO pin 101.                                   */

    struct {
      __IOM uint32_t FNCSEL101  : 4;            /*!< Function select for GPIO pin 101                                          */
      __IOM uint32_t INPEN101   : 1;            /*!< Input enable for GPIO 101                                                 */
      __IOM uint32_t RDZERO101  : 1;            /*!< Return 0 for read data on GPIO 101                                        */
      __IOM uint32_t IRPTEN101  : 2;            /*!< Interrupt enable for GPIO 101                                             */
      __IOM uint32_t OUTCFG101  : 2;            /*!< Pin IO mode selection for GPIO pin 101                                    */
      __IOM uint32_t DS101      : 2;            /*!< Drive strength selection for GPIO 101                                     */
      __IOM uint32_t SR101      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG101 : 3;            /*!< Pullup/Pulldown configuration for GPIO 101                                */
      __IOM uint32_t NCESRC101  : 5;            /*!< IOMSTR Chip Select 101, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL101  : 1;            /*!< Polarity select for NCE for GPIO 101                                      */
      __IOM uint32_t TIMERSEL101 : 1;           /*!< Select if CT101 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN101    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN101    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG101 : 3;          /*!< Pullup/Pulldown configuration for GPIO 101 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG101_b;
  } ;

  union {
    __IOM uint32_t PINCFG102;                   /*!< Controls the operation of GPIO pin 102.                                   */

    struct {
      __IOM uint32_t FNCSEL102  : 4;            /*!< Function select for GPIO pin 102                                          */
      __IOM uint32_t INPEN102   : 1;            /*!< Input enable for GPIO 102                                                 */
      __IOM uint32_t RDZERO102  : 1;            /*!< Return 0 for read data on GPIO 102                                        */
      __IOM uint32_t IRPTEN102  : 2;            /*!< Interrupt enable for GPIO 102                                             */
      __IOM uint32_t OUTCFG102  : 2;            /*!< Pin IO mode selection for GPIO pin 102                                    */
      __IOM uint32_t DS102      : 2;            /*!< Drive strength selection for GPIO 102                                     */
      __IOM uint32_t SR102      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG102 : 3;            /*!< Pullup/Pulldown configuration for GPIO 102                                */
      __IOM uint32_t NCESRC102  : 5;            /*!< IOMSTR Chip Select 102, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL102  : 1;            /*!< Polarity select for NCE for GPIO 102                                      */
      __IOM uint32_t TIMERSEL102 : 1;           /*!< Select if CT102 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN102    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN102    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG102 : 3;          /*!< Pullup/Pulldown configuration for GPIO 102 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG102_b;
  } ;

  union {
    __IOM uint32_t PINCFG103;                   /*!< Controls the operation of GPIO pin 103.                                   */

