AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FNCSEL103  : 4;            /*!< Function select for GPIO pin 103                                          */
      __IOM uint32_t INPEN103   : 1;            /*!< Input enable for GPIO 103                                                 */
      __IOM uint32_t RDZERO103  : 1;            /*!< Return 0 for read data on GPIO 103                                        */
      __IOM uint32_t IRPTEN103  : 2;            /*!< Interrupt enable for GPIO 103                                             */
      __IOM uint32_t OUTCFG103  : 2;            /*!< Pin IO mode selection for GPIO pin 103                                    */
      __IOM uint32_t DS103      : 2;            /*!< Drive strength selection for GPIO 103                                     */
      __IOM uint32_t SR103      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG103 : 3;            /*!< Pullup/Pulldown configuration for GPIO 103                                */
      __IOM uint32_t NCESRC103  : 5;            /*!< IOMSTR Chip Select 103, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL103  : 1;            /*!< Polarity select for NCE for GPIO 103                                      */
      __IOM uint32_t TIMERSEL103 : 1;           /*!< Select if CT103 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN103    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN103    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG103 : 3;          /*!< Pullup/Pulldown configuration for GPIO 103 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG103_b;
  } ;

  union {
    __IOM uint32_t PINCFG104;                   /*!< Controls the operation of GPIO pin 104.                                   */

    struct {
      __IOM uint32_t FNCSEL104  : 4;            /*!< Function select for GPIO pin 104                                          */
      __IOM uint32_t INPEN104   : 1;            /*!< Input enable for GPIO 104                                                 */
      __IOM uint32_t RDZERO104  : 1;            /*!< Return 0 for read data on GPIO 104                                        */
      __IOM uint32_t IRPTEN104  : 2;            /*!< Interrupt enable for GPIO 104                                             */
      __IOM uint32_t OUTCFG104  : 2;            /*!< Pin IO mode selection for GPIO pin 104                                    */
      __IOM uint32_t DS104      : 2;            /*!< Drive strength selection for GPIO 104                                     */
      __IOM uint32_t SR104      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG104 : 3;            /*!< Pullup/Pulldown configuration for GPIO 104                                */
      __IOM uint32_t NCESRC104  : 5;            /*!< IOMSTR Chip Select 104, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL104  : 1;            /*!< Polarity select for NCE for GPIO 104                                      */
      __IOM uint32_t TIMERSEL104 : 1;           /*!< Select if CT104 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN104    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN104    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG104 : 3;          /*!< Pullup/Pulldown configuration for GPIO 104 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG104_b;
  } ;

  union {
    __IOM uint32_t PINCFG105;                   /*!< Controls the operation of GPIO pin 105.                                   */

    struct {
      __IOM uint32_t FNCSEL105  : 4;            /*!< Function select for GPIO pin 105                                          */
      __IOM uint32_t INPEN105   : 1;            /*!< Input enable for GPIO 105                                                 */
      __IOM uint32_t RDZERO105  : 1;            /*!< Return 0 for read data on GPIO 105                                        */
      __IOM uint32_t IRPTEN105  : 2;            /*!< Interrupt enable for GPIO 105                                             */
      __IOM uint32_t OUTCFG105  : 2;            /*!< Pin IO mode selection for GPIO pin 105                                    */
      __IOM uint32_t DS105      : 2;            /*!< Drive strength selection for GPIO 105                                     */
      __IOM uint32_t SR105      : 1;            /*!< Configure the slew rate                                                   */
      __IOM uint32_t PULLCFG105 : 3;            /*!< Pullup/Pulldown configuration for GPIO 105                                */
      __IOM uint32_t NCESRC105  : 5;            /*!< IOMSTR Chip Select 105, DISP control signals DE, CSX, and CS.
                                                     Polarity is determined by CE_POLARITY field                               */
            uint32_t            : 1;
      __IOM uint32_t NCEPOL105  : 1;            /*!< Polarity select for NCE for GPIO 105                                      */
      __IOM uint32_t TIMERSEL105 : 1;           /*!< Select if CT105 is used by Non-secure Timer or Radio Subsystem
                                                     Timer                                                                     */
            uint32_t            : 2;
      __IOM uint32_t FIEN105    : 1;            /*!< Force input enable active regardless of function selected. Otherwise
                                                     the selected function will enable the input only when needed              */
      __IOM uint32_t FOEN105    : 1;            /*!< Force output enable active regardless of function selected.
                                                     Otherwise the selected function will enable the output
                                                     only when needed                                                          */
      __IOM uint32_t DSPULLCFG105 : 3;          /*!< Pullup/Pulldown configuration for GPIO 105 when in Deeper Sleep           */
            uint32_t            : 1;
    } PINCFG105_b;
  } ;

  union {
    __IOM uint32_t PINCFG106;                   /*!< Controls the operation of GPIO pin 106.                                   */

