AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t WTS3       : 32;           /*!< GPIO127-96 Sets pin state. Writing a 1 to any bit sets the corresponding
                                                     bit in the WT register if the GPIO is enabled for output.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTS3_b;
  } ;

  union {
    __IOM uint32_t WTC0;                        /*!< GPIO Output Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t WTC0       : 32;           /*!< GPIO31-0 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTC0_b;
  } ;

  union {
    __IOM uint32_t WTC1;                        /*!< GPIO Output Clear 1 (63-32)                                               */

    struct {
      __IOM uint32_t WTC1       : 32;           /*!< GPIO63-32 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTC1_b;
  } ;

  union {
    __IOM uint32_t WTC2;                        /*!< GPIO Output Clear 2 (95-64)                                               */

    struct {
      __IOM uint32_t WTC2       : 32;           /*!< GPIO95-64 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTC2_b;
  } ;

  union {
    __IOM uint32_t WTC3;                        /*!< GPIO Output Clear 3 (127-96)                                              */

    struct {
      __IOM uint32_t WTC3       : 32;           /*!< GPIO127-96 Clears pin state. Writing a 1 to any bit clears the
                                                     corresponding bit in the WT register if the GPIO is enabled
                                                     for output. Writing a value of 0 has no effect on the corresponding
                                                     bit in the WT register. Status reads should be made via
                                                     the WT Register.                                                          */
    } WTC3_b;
  } ;

  union {
    __IOM uint32_t EN0;                         /*!< GPIO Enable 0 (31-0)                                                      */

    struct {
      __IOM uint32_t EN0        : 32;           /*!< GPIO31-0 Enables tri-state pin output. Writing a 1 to any bit
                                                     enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN0_b;
  } ;

  union {
    __IOM uint32_t EN1;                         /*!< GPIO Enable 1 (63-32)                                                     */

    struct {
      __IOM uint32_t EN1        : 32;           /*!< GPIO63-32 Enables tri-state pin output. Writing a 1 to any bit
                                                     enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN1_b;
  } ;

  union {
    __IOM uint32_t EN2;                         /*!< GPIO Enable 2 (95-64)                                                     */

    struct {
      __IOM uint32_t EN2        : 32;           /*!< GPIO95-64 Enables tri-state pin output. Writing a 1 to any bit
                                                     enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN2_b;
  } ;

  union {
    __IOM uint32_t EN3;                         /*!< GPIO Enable 3 (127-96)                                                    */

    struct {
      __IOM uint32_t EN3        : 32;           /*!< GPIO127-96 Enables tri-state pin output. Writing a 1 to any
                                                     bit enables, and writing a 0 to any bit disables, the output
                                                     for the corresponding GPIO. Reads return output enable/disable
                                                     status of GPIO.                                                           */
    } EN3_b;
  } ;

  union {
    __IOM uint32_t ENS0;                        /*!< GPIO Enable Set 0 (31-0)                                                  */

