AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t ENS0       : 32;           /*!< GPIO31-0 Sets pin tri-state output enables. Writing a 1 to any
                                                     bit sets the corresponding bit in the EN register. Writing
                                                     a value of 0 has no effect on the corresponding bit in
                                                     the EN register. Status reads should be made to the EN
                                                     Register.                                                                 */
    } ENS0_b;
  } ;

  union {
    __IOM uint32_t ENS1;                        /*!< GPIO Enable Set 1 (63-32)                                                 */

    struct {
      __IOM uint32_t ENS1       : 32;           /*!< GPIO63-32 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS1_b;
  } ;

  union {
    __IOM uint32_t ENS2;                        /*!< GPIO Enable Set 2 (95-64)                                                 */

    struct {
      __IOM uint32_t ENS2       : 32;           /*!< GPIO95-64 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS2_b;
  } ;

  union {
    __IOM uint32_t ENS3;                        /*!< GPIO Enable Set 3 (127-96)                                                */

    struct {
      __IOM uint32_t ENS3       : 32;           /*!< GPIO127-96 Sets pin tri-state output enables. Writing a 1 to
                                                     any bit sets the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENS3_b;
  } ;

  union {
    __IOM uint32_t ENC0;                        /*!< GPIO Enable Clear 0 (31-0)                                                */

    struct {
      __IOM uint32_t ENC0       : 32;           /*!< GPIO31-0 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC0_b;
  } ;

  union {
    __IOM uint32_t ENC1;                        /*!< GPIO Enable Clear 1 (63-32)                                               */

    struct {
      __IOM uint32_t ENC1       : 32;           /*!< GPIO63-32 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC1_b;
  } ;

  union {
    __IOM uint32_t ENC2;                        /*!< GPIO Enable Clear 2 (95-64)                                               */

    struct {
      __IOM uint32_t ENC2       : 32;           /*!< GPIO95-64 Clears pin tri-state output enables. Writing a 1 to
                                                     any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC2_b;
  } ;

  union {
    __IOM uint32_t ENC3;                        /*!< GPIO Enable Clear 3 (127-96)                                              */

    struct {
      __IOM uint32_t ENC3       : 32;           /*!< GPIO127-96 Clears pin tri-state output enables. Writing a 1
                                                     to any bit clears the corresponding bit in the EN register.
                                                     Writing a value of 0 has no effect on the corresponding
                                                     bit in the EN register. Status reads should be made to
                                                     the EN Register.                                                          */
    } ENC3_b;
  } ;

  union {
    __IOM uint32_t IOM0IRQ;                     /*!< IOM0 IRQ select for flow control.                                         */

    struct {
      __IOM uint32_t IOM0IRQ    : 7;            /*!< IOM0 IRQ pad select.                                                      */
            uint32_t            : 25;
    } IOM0IRQ_b;
  } ;

  union {
    __IOM uint32_t IOM1IRQ;                     /*!< IOM1 IRQ select for flow control.                                         */

