AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO0 : 1;            /*!< GPIO0 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO1 : 1;            /*!< GPIO1 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO2 : 1;            /*!< GPIO2 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO3 : 1;            /*!< GPIO3 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO4 : 1;            /*!< GPIO4 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO5 : 1;            /*!< GPIO5 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO6 : 1;            /*!< GPIO6 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO7 : 1;            /*!< GPIO7 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO8 : 1;            /*!< GPIO8 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO9 : 1;            /*!< GPIO9 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO10 : 1;           /*!< GPIO10 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO11 : 1;           /*!< GPIO11 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO12 : 1;           /*!< GPIO12 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO13 : 1;           /*!< GPIO13 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO14 : 1;           /*!< GPIO14 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO15 : 1;           /*!< GPIO15 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO16 : 1;           /*!< GPIO16 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO17 : 1;           /*!< GPIO17 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO18 : 1;           /*!< GPIO18 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO19 : 1;           /*!< GPIO19 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO20 : 1;           /*!< GPIO20 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO21 : 1;           /*!< GPIO21 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO22 : 1;           /*!< GPIO22 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO23 : 1;           /*!< GPIO23 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO24 : 1;           /*!< GPIO24 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO25 : 1;           /*!< GPIO25 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO26 : 1;           /*!< GPIO26 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO27 : 1;           /*!< GPIO27 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO28 : 1;           /*!< GPIO28 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO29 : 1;           /*!< GPIO29 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO30 : 1;           /*!< GPIO30 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO31 : 1;           /*!< GPIO31 MCU N1-priority interrupt                                          */
    } MCUN1INT0STAT_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0CLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t MCUN1GPIO0 : 1;            /*!< GPIO0 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO1 : 1;            /*!< GPIO1 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO2 : 1;            /*!< GPIO2 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO3 : 1;            /*!< GPIO3 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO4 : 1;            /*!< GPIO4 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO5 : 1;            /*!< GPIO5 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO6 : 1;            /*!< GPIO6 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO7 : 1;            /*!< GPIO7 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO8 : 1;            /*!< GPIO8 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO9 : 1;            /*!< GPIO9 MCU N1-priority interrupt                                           */
      __IOM uint32_t MCUN1GPIO10 : 1;           /*!< GPIO10 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO11 : 1;           /*!< GPIO11 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO12 : 1;           /*!< GPIO12 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO13 : 1;           /*!< GPIO13 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO14 : 1;           /*!< GPIO14 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO15 : 1;           /*!< GPIO15 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO16 : 1;           /*!< GPIO16 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO17 : 1;           /*!< GPIO17 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO18 : 1;           /*!< GPIO18 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO19 : 1;           /*!< GPIO19 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO20 : 1;           /*!< GPIO20 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO21 : 1;           /*!< GPIO21 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO22 : 1;           /*!< GPIO22 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO23 : 1;           /*!< GPIO23 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO24 : 1;           /*!< GPIO24 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO25 : 1;           /*!< GPIO25 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO26 : 1;           /*!< GPIO26 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO27 : 1;           /*!< GPIO27 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO28 : 1;           /*!< GPIO28 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO29 : 1;           /*!< GPIO29 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO30 : 1;           /*!< GPIO30 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO31 : 1;           /*!< GPIO31 MCU N1-priority interrupt                                          */
    } MCUN1INT0CLR_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT0SET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

