AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t MCUN1GPIO32 : 1;           /*!< GPIO32 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO33 : 1;           /*!< GPIO33 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO34 : 1;           /*!< GPIO34 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO35 : 1;           /*!< GPIO35 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO36 : 1;           /*!< GPIO36 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO37 : 1;           /*!< GPIO37 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO38 : 1;           /*!< GPIO38 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO39 : 1;           /*!< GPIO39 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO40 : 1;           /*!< GPIO40 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO41 : 1;           /*!< GPIO41 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO42 : 1;           /*!< GPIO42 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO43 : 1;           /*!< GPIO43 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO44 : 1;           /*!< GPIO44 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO45 : 1;           /*!< GPIO45 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO46 : 1;           /*!< GPIO46 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO47 : 1;           /*!< GPIO47 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO48 : 1;           /*!< GPIO48 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO49 : 1;           /*!< GPIO49 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO50 : 1;           /*!< GPIO50 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO51 : 1;           /*!< GPIO51 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO52 : 1;           /*!< GPIO52 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO53 : 1;           /*!< GPIO53 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO54 : 1;           /*!< GPIO54 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO55 : 1;           /*!< GPIO55 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO56 : 1;           /*!< GPIO56 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO57 : 1;           /*!< GPIO57 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO58 : 1;           /*!< GPIO58 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO59 : 1;           /*!< GPIO59 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO60 : 1;           /*!< GPIO60 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO61 : 1;           /*!< GPIO61 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO62 : 1;           /*!< GPIO62 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO63 : 1;           /*!< GPIO63 MCU N1-priority interrupt                                          */
    } MCUN1INT1SET_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT2EN;                 /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t MCUN1GPIO64 : 1;           /*!< GPIO64 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO65 : 1;           /*!< GPIO65 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO66 : 1;           /*!< GPIO66 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO67 : 1;           /*!< GPIO67 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO68 : 1;           /*!< GPIO68 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO69 : 1;           /*!< GPIO69 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO70 : 1;           /*!< GPIO70 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO71 : 1;           /*!< GPIO71 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO72 : 1;           /*!< GPIO72 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO73 : 1;           /*!< GPIO73 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO74 : 1;           /*!< GPIO74 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO75 : 1;           /*!< GPIO75 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO76 : 1;           /*!< GPIO76 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO77 : 1;           /*!< GPIO77 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO78 : 1;           /*!< GPIO78 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO79 : 1;           /*!< GPIO79 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO80 : 1;           /*!< GPIO80 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO81 : 1;           /*!< GPIO81 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO82 : 1;           /*!< GPIO82 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO83 : 1;           /*!< GPIO83 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO84 : 1;           /*!< GPIO84 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO85 : 1;           /*!< GPIO85 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO86 : 1;           /*!< GPIO86 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO87 : 1;           /*!< GPIO87 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO88 : 1;           /*!< GPIO88 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO89 : 1;           /*!< GPIO89 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO90 : 1;           /*!< GPIO90 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO91 : 1;           /*!< GPIO91 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO92 : 1;           /*!< GPIO92 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO93 : 1;           /*!< GPIO93 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO94 : 1;           /*!< GPIO94 MCU N1-priority interrupt                                          */
      __IOM uint32_t MCUN1GPIO95 : 1;           /*!< GPIO95 MCU N1-priority interrupt                                          */
    } MCUN1INT2EN_b;
  } ;

  union {
    __IOM uint32_t MCUN1INT2STAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

