AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t RESETGPU   : 32;           /*!< On write, resets the GPU (CHECK address!).                                */
    } SYSCLEAR_b;
  } ;

  union {
    __IOM uint32_t DRAWCMD;                     /*!< Rasterizer drawing command.                                               */

    struct {
      __IOM uint32_t START      : 3;            /*!< Start the draw command                                                    */
      __IOM uint32_t RSVD       : 29;           /*!< This bitfield is reserved.                                                */
    } DRAWCMD_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0;                     /*!< Stores only integer values. For greater accurancy DRAWPT0X and
                                                     DRAWPT0Y registers are used which are 16, 16 fixed point.                 */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< vertex 0 X coordinate (integer value)                                     */
      __IOM uint32_t COORDY     : 16;           /*!< vertex 0 Y coordinate (integer value)                                     */
    } DRAWPT0_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1;                     /*!< Stores only integer values. Vertex 1 drawing primitive. Stores
                                                     only integer values. For greater accurancy DRAWPT1X and
                                                     DRAWPT1Y registers are used which are 16, 16 fixed point.                 */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< vertex 0 X coordinate (integer value)                                     */
      __IOM uint32_t COORDY     : 16;           /*!< vertex 0 Y coordinate (integer value)                                     */
    } DRAWPT1_b;
  } ;
  __IM  uint32_t  RESERVED6;

  union {
    __IOM uint32_t CLIPMIN;                     /*!< Clipping rectangle upper left vertex.                                     */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< upper left X coordinate                                                   */
      __IOM uint32_t COORDY     : 16;           /*!< upper left Y coordinate                                                   */
    } CLIPMIN_b;
  } ;

  union {
    __IOM uint32_t CLIPMAX;                     /*!< Clipping rectangle bottom right vertex.                                   */

    struct {
      __IOM uint32_t COORDX     : 16;           /*!< bottom right X coordinate                                                 */
      __IOM uint32_t COORDY     : 16;           /*!< bottom right Y coordinate                                                 */
    } CLIPMAX_b;
  } ;

  union {
    __IOM uint32_t RASTCTRL;                    /*!< Rasterizer matrix multiplication control                                  */

    struct {
      __IOM uint32_t RSVD0      : 24;           /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BYPASS     : 1;            /*!< BYPASS_VMM, vertx matrix multiplications are bypassed                     */
      __IOM uint32_t RSVD25     : 1;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t RSVD26     : 2;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BYPASSMM   : 1;            /*!< BYPASS_MM, matrix multiplications are bypassed                            */
      __IOM uint32_t ADD        : 1;            /*!< adds 0.5 to X and Y                                                       */
      __IOM uint32_t RSVD30     : 2;            /*!< This bitfield is reserved.                                                */
    } RASTCTRL_b;
  } ;

  union {
    __IOM uint32_t DRAWCODEPTR;                 /*!< FIXME - register description needed here.                                 */

    struct {
      __IOM uint32_t FRGND      : 16;           /*!< the pointer for the instruction that will be executed for foreground
                                                     pixel                                                                     */
      __IOM uint32_t BKGND      : 16;           /*!< the pointer for the instruction that will be executed for background
                                                     pixel                                                                     */
    } DRAWCODEPTR_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0X;                    /*!< X coordinate of Vertex 0 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW0X     : 32;           /*!< X coordinate                                                              */
    } DRAWPT0X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0Y;                    /*!< Y coordinate of Vertex 0 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW0Y     : 32;           /*!< Y coordinate                                                              */
    } DRAWPT0Y_b;
  } ;

  union {
    __IOM uint32_t DRAWPT0Z;                    /*!< FIXME - register description needed here.                                 */

    struct {
      __IOM uint32_t DRAW0Z     : 32;           /*!< This bitfield is reserved.                                                */
    } DRAWPT0Z_b;
  } ;

  union {
    __IOM uint32_t DRAWCOLOR;                   /*!< FIXME - register description needed here.                                 */

    struct {
      __IOM uint32_t RASTPRIM   : 32;           /*!< Rasterizer drawing                                                        */
    } DRAWCOLOR_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1X;                    /*!< X coordinate of Vertex 1 drawing primitive 16, 16 fixed point.            */

    struct {
      __IOM uint32_t DRAW1X     : 32;           /*!< X coordinate                                                              */
    } DRAWPT1X_b;
  } ;

  union {
    __IOM uint32_t DRAWPT1Y;                    /*!< Y coordinate of Vertex 1 drawing primitive 16, 16 fixed point.            */

