AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t RXFFM      : 1;            /*!< Receive FIFO interrupt mask. Will assert interrupt when = 1
                                                     and RXFFI is asserted                                                     */
      __IOM uint32_t TXFFM      : 1;            /*!< Transmit FIFO interrupt mask. Will assert interrupt when = 1
                                                     and TXFFI is asserted                                                     */
      __IOM uint32_t RXFM       : 1;            /*!< Receive FIFO interrupt mask. Will assert interrupt when = 1
                                                     and RXFI is asserted                                                      */
      __IOM uint32_t TXEM       : 1;            /*!< Transmit FIFO interrupt mask. Will assert interrupt when = 1
                                                     and TXEI is asserted                                                      */
      __IOM uint32_t RXDMAM     : 1;            /*!< Receive FIFO interrupt mask. Will assert interrupt when = 1
                                                     and cimdmareq_rx is asserted                                              */
      __IOM uint32_t TXDMAM     : 1;            /*!< Transmit FIFO interrupt mask. Will assert interrupt when = 1
                                                     and cimdmareq_tx is asserted                                              */
            uint32_t            : 10;
      __IOM uint32_t RXFFI      : 1;            /*!< Receive fifo high limit interrupt                                         */
      __IOM uint32_t TXFFI      : 1;            /*!< Transmit fifo low limit interrupt                                         */
      __IOM uint32_t RXFI       : 1;            /*!< RX Full interrupt. RX unit attempted to write to a full FIFO              */
      __IOM uint32_t TXEI       : 1;            /*!< TX Empty interrupt. TX unit attempted to read an empty FIFO               */
      __IOM uint32_t RXDMAI     : 1;            /*!< RX dma interrupt                                                          */
      __IOM uint32_t TXDMAI     : 1;            /*!< TX dma interrupt                                                          */
            uint32_t            : 10;
    } IPBIRPT_b;
  } ;

  union {
    __IOM uint32_t IPCOREID;                    /*!< Returns the core ID of the IPB core, and used to write the I2S
                                                     validity mask.                                                            */

    struct {
            uint32_t            : 16;
      __IOM uint32_t COREID     : 8;            /*!< Core ID of the IPB core                                                   */
      __IOM uint32_t COREFAM    : 8;            /*!< Core Family. Also bit 31 is used to set the I2S validity bit
                                                     when a write is done.                                                     */
    } IPCOREID_b;
  } ;

  union {
    __IOM uint32_t AMQCFG;                      /*!< Control the enablement of the ASRC module and the source of
                                                     the MCLK used in the IPB core.                                            */

    struct {
      __IOM uint32_t MCLKSRC    : 1;            /*!< MCLK source. 1: Output of nco_clk divider. 0: MCLK from ambiq
                                                     clock configuration directly                                              */
      __IOM uint32_t ASRCEN     : 1;            /*!< ASRC sub module enable. 0: Enabled. 1: Disabled/Bypassed                  */
      __IOM uint32_t FIX8B16B   : 1;            /*!< FIX8B16B bug 1: Enabled. 0: Disabled/Bypassed                             */
      __IOM uint32_t FIXTDM     : 1;            /*!< FIXTDM bug 1: Enabled. 0: Disabled/Bypassed                               */
            uint32_t            : 28;
    } AMQCFG_b;
  } ;
  __IM  uint32_t  RESERVED2[2];

  union {
    __IOM uint32_t INTDIV;                      /*!< Integer divide value for the nco_clk divider                              */

    struct {
      __IOM uint32_t INTDIV     : 32;           /*!< Integer divide value for internal clock divider                           */
    } INTDIV_b;
  } ;

  union {
    __IOM uint32_t FRACDIV;                     /*!< Fractional divide value for the nco_clk divider                           */

    struct {
      __IOM uint32_t FRACDIV    : 32;           /*!< Fractional divide value for internal clock divider                        */
    } FRACDIV_b;
  } ;
  __IM  uint32_t  RESERVED3[38];

  union {
    __IOM uint32_t CLKCFG;                      /*!< Provides clock selection and control for I2S clocks                       */

    struct {
      __IOM uint32_t MCLKEN     : 1;            /*!< Enable for the master audio clock.                                        */
            uint32_t            : 3;
      __IOM uint32_t FSEL       : 5;            /*!< Select the input clock frequency for the MCLK.Whenever changing
                                                     the clock source here, the MISC_HFRC2FRC bit in the CLKGEN
                                                     module must first be set. The sequence for changing the
                                                     clock source regardless of clock selection is to first
                                                     force HFRC2 on by setting the CLKGEN_MISC_HFRC2FRC bit,
                                                     select the clock source in this field, clear the CLKGEN_MISC_HFRC2FRC
                                                     bit only if HFRC2 is NOT selected, and then engage the
                                                     peripheral.If HFRC2 is the clock source, then shutting
                                                     the module down cleanly requires switching to HFRC, for
                                                     example, and then disabling the HFRC2 by clearing the CLKGEN_MISC_HFRC2FR
                                                     bit. 0: HFRC2_62MHz 1: HFRC2_31MHz 2: HFRC2_16MHz 3: HFRC2_8MHz
                                                     4: HFRC2_4MHz 5: HFRC2_2MHz 6: HFRC2_977KHz 7: HFRC2_488KHz
                                                     8: HFRC_24MHz 9: HFRC_12MHz 10: HFRC_6MHz 11: HFRC_3MHz
                                                     12: HFRC_1_5MHz 13: HFRC_750KHz 14: HFRC_375KHz 15: XTHS_EXTREF_CLK
                                                     16: XTHS_16MHz 17: XTHS_8MHz 18: XTHS_4MHz 19: XTHS_2MHz
                                                     20: XTHS_1MHz 21: XTHS_500KHz 22: HFRC_48MHz                              */
            uint32_t            : 3;
      __IOM uint32_t REFCLKEN   : 1;            /*!< FUTURE USE Enable for the reference clock                                 */
            uint32_t            : 3;
      __IOM uint32_t REFFSEL    : 3;            /*!< FUTURE USE Select the input clock frequency for the ref_clk.
                                                     0: HFRC_48MHz 1: HFRC_48MHz_GATED 2: XT_24MHz 3: HFRC2_48MHz              */
            uint32_t            : 1;
      __IOM uint32_t DIV3       : 1;            /*!< 0: no change to the clock selected by FSEL 1: frequency divide-by-3
                                                     of the clock selected by FSEL                                             */
            uint32_t            : 11;
    } CLKCFG_b;
  } ;
  __IM  uint32_t  RESERVED4[63];

  union {
    __IOM uint32_t DMACFG;                      /*!< Configuration control of the DMA process, including the direction
                                                     of DMA, and enablement of DMA                                             */

