AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t TXTARGADDR : 32;           /*!< Address bits of the target byte address for source of TX write
                                                     DMA.                                                                      */
    } TXDMAADDR_b;
  } ;

  union {
    __IOM uint32_t TXDMASTAT;                   /*!< Status of the TX DMA operation currently in progress.                     */

    struct {
      __IOM uint32_t TXDMATIP   : 1;            /*!< TX DMA Transfer In Progress indicator. 1 will indicate that
                                                     a DMA transfer is active. The DMA transfer may be waiting
                                                     on data, transferring data, or waiting for priority.All
                                                     of these will be indicated with a 1. A 0 will indicate
                                                     that the DMA is fully complete and no further transactions
                                                     will be done. This bit is read only.                                      */
      __IOM uint32_t TXDMACPL   : 1;            /*!< TX DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t TXDMAERR   : 1;            /*!< TX DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
            uint32_t            : 29;
    } TXDMASTAT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< To enable next DMA job                                                    */

    struct {
      __IOM uint32_t RXDMAENNEXT : 1;           /*!< Indicate to HW the next RX DMA job. RXTARGADDRNEXT and RXTOTCNTNEXT
                                                     needs to be valid before setting this bit. HW will autoclear
                                                     this bit when this job is serviced. SW should read back
                                                     this bit after setting it. If it reads back 0, it means
                                                     SW can load another set of RXTARGADDRNEXT and RXTOTCNTNEXT
                                                     and set this bit again. If it reads back 1, it means the
                                                     HW is servicing a DMA job, and the next DMA job is yet
                                                     to be loaded. SW needs to wait for RXDMACPL interrupt to
                                                     setup the next job.                                                       */
      __IOM uint32_t TXDMAENNEXT : 1;           /*!< Indicate to HW the next TX DMA job. TXTARGADDRNEXT and TXTOTCNTNEXT
                                                     needs to be valid before setting this bit. HW will autoclear
                                                     this bit when this job is serviced. SW should read back
                                                     this bit after setting it. If it reads back 0, it means
                                                     SW can load another set of TXTARGADDRNEXT and TXTOTCNTNEXT
                                                     and set this bit again. If it reads back 1, it means the
                                                     HW is servicing a DMA job, and the next DMA job is yet
                                                     to be loaded. SW needs to wait for TXDMACPL interrupt to
                                                     setup the next job.                                                       */
            uint32_t            : 30;
    } DMAENNEXTCTRL_b;
  } ;

  union {
    __IOM uint32_t RXDMATOTCNTNEXT;             /*!< Contains the total count of samples to be stored for the next
                                                     RX DMA operation.                                                         */

    struct {
      __IOM uint32_t RXTOTCNTNEXT : 12;         /*!< Number of 32b audio samples to transfer for next RX DMA.                  */
            uint32_t            : 20;
    } RXDMATOTCNTNEXT_b;
  } ;

  union {
    __IOM uint32_t RXDMAADDRNEXT;               /*!< The address which the next DMA operation will store the incoming
                                                     audio samples.                                                            */

    struct {
      __IOM uint32_t RXTARGADDRNEXT : 32;       /*!< Address bits of the target byte address for source of next RX
                                                     write DMA.                                                                */
    } RXDMAADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t TXDMATOTCNTNEXT;             /*!< Contains the total count of samples to be read and transmitted
                                                     for the next TX DMA operation.                                            */

    struct {
      __IOM uint32_t TXTOTCNTNEXT : 12;         /*!< Number of 32b audio samples to transmit in next TX DMA                    */
            uint32_t            : 20;
    } TXDMATOTCNTNEXT_b;
  } ;

  union {
    __IOM uint32_t TXDMAADDRNEXT;               /*!< The address which the next DMA operation will fetch the audio
                                                     samples.                                                                  */

