AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t VERSION    : 32;           /*!< Major/Minor version of I3C HCI that the Host Controller implements.
                                                     Lowest 8 bits encode the minor number and revision. Each
                                                     4 bits in this filed are encoded as binary encoded decimals.              */
    } HCIVERSION_b;
  } ;

  union {
    __IOM uint32_t HCCONTROL;                   /*!< Host Controller Control register                                          */

    struct {
      __IOM uint32_t IBAINCLUDE : 1;            /*!< Include I3C Broadcast Address - This bit controls whether the
                                                     I3C broadcast address (0x7E) is included for private transfers.
                                                     If the I3C broadcast address is not included for private
                                                     transfers, then IBIs driven from Slaves might not win the
                                                     arbitration, potentially delaying acceptance of the IBIs.
                                                     Values: 0x0. Do not include I3C Broadcast Address for Private
                                                     Transfers 0x1. Include I3C Broadcast Address for Private
                                                     Transfers Table 4 :HC Control Register Fields                             */
            uint32_t            : 3;
      __IOM uint32_t DATABYTEORDERMODE : 1;     /*!< Data Byte Ordering Mode This field indicates the supported byte
                                                     ordering mode. An implementer may choose the byte ordering
                                                     mode according to the expected byte ordering of the Host
                                                     system. Values: 1'b0: Little Endian ordering (i.e., the
                                                     byte at bits[7:0] is first) 1'b1: Big Endian ordering (i.e.,
                                                     the byte at bits[31:24] is first); The IP currently supports
                                                     Little Endian Ordering                                                    */
            uint32_t            : 1;
      __IOM uint32_t MODESELECTOR : 1;          /*!< DMA/PIO Mode Selector Indicates the current operating mode (DMA
                                                     or PIO) of the Host Controller for its Controller Logic
                                                     (i.e., Active Controller mode). This configuration shall
                                                     only be changed when the Host Controller is in DISABLED
                                                     state. The Driver shall explicitly set this bit to indicate
                                                     the desired operating mode. If only one operating mode
                                                     is supported, then this bit shall be Read-Only. If both
                                                     operating modes are supported, then PIO Mode shall be the
                                                     default (i.e., 1'b1 reset value). This register is writeable,
                                                     only if both PIO Mode and DMA Mode are supported, and the
                                                     Host Controller implements both Register Sets. PIO Mode
                                                     can only be selected if register PIO_SECTION_OFFSET is
                                                     valid. DMA Mode can only be selected if register RING_HEADERS_SECTION_OFF
                                                     ET is valid. Values: 1'b0: DMA: DMA Mode enabled 1'b1:
                                                     PIO: PIO Mode enabled                                                     */
      __IOM uint32_t I2CDEVPRESENT : 1;         /*!< I2C Device Present on Bus Indicates whether or not any Legacy
                                                     I2C Devices are present on the I3C Bus. Whenever this bit
                                                     is set, the Host Controller shall use the HDR-TSL protocol
                                                     (Ternary Symbol Legacy Inclusive Bus) for HDR-TS Transfers.
                                                     The specific Mode of the transfer (SDR, DDR, HDR-TS) is
                                                     controlled on a per- Command basis. The Host Controller
                                                     shall use this field to select either TSL (1'b1) or TSP
                                                     (1'b0) for HDR-TS transfers. Values: 1'b0: DISABLED: Legacy
                                                     inclusive Bus Mode disabled 1'b1: ENABLED: Legacy inclusive
                                                     (mix) Bus Mode enabled                                                    */
      __IOM uint32_t HOTJOINCTRL : 1;           /*!< Hot-Join ACK/NACK Control - This bit acts as global control
                                                     to either ACK (1'b0) or NACK (1'b1) all Hot-Join Requests
                                                     arriving from the Devices on the I3C Bus. If set to NACK
                                                     (1'b1), then the NACK will be followed by the Broadcast
                                                     CCC to disable Hot-Join. Values: 1'b0: ACK: ACK the Hot-Join
                                                     request 1'b1: NACK: NACK and send Broadcast CCC to disable
                                                     Hot-Join                                                                  */
            uint32_t            : 3;
      __IOM uint32_t HALTONCMDSEQTIMEOUT : 1;   /*!< Halt on Command Sequence Timeout This bit acts as global control
                                                     to halt Host Controller operations if a command sequence
                                                     timeout condition occurs, and this causes such a sequence
                                                     to be terminated Values: 1'b0: DISABLE: Continue processing
                                                     after termination: 1'b1: ENABLE: Halt processing, enter
                                                     the Halt state indicated with field RESUME Note: Currently,
                                                     the IP does not support clock stalling and the related
                                                     timeout. In the HCI specification, on stall TO, it states
                                                     only terminate the sequence but it does not define the
                                                     sequence to terminate. Also, the I3C specification recommends
                                                     avoiding the clock stalling unless it is unavoidable. For
                                                     now, we have connected logic 0 to the respective register
                                                     bit.                                                                      */
            uint32_t            : 16;
      __IOM uint32_t ABORT      : 1;            /*!< Host Controller Abort - When set to 1, this bit allows the Host
                                                     Controller to relinquish control of the I3C Bus before
                                                     completing the currently issued transfer. In response to
                                                     an ABORT request, the Host Controller issues the STOP condition
                                                     on the I3C Bus after the complete data byte is transferred
                                                     or received. The Driver shall clear the ABORT bit to allow
                                                     operation on the Bus. Values: 0x0 RUNNING Host Controller
                                                     Running 0x1 ABORTED Host Controller Aborted                               */
      __IOM uint32_t RESUME     : 1;            /*!< Host Controller Resume - This bit is used to resume Host Controller
                                                     operation following the Halt state. The Host Controller
                                                     enters the Halt state (as indicated in register PRESENT_STATE)
                                                     as a result of any type of error occurring in a transfer.
                                                     The error type is indicated by the field ERR_STATUS in
                                                     register RESPONSE_QUEUE_PORT). After the Host Controller
                                                     has entered the Halt state, the application must write
                                                     the value 1'b1 to the RESUME bit to resume Host Controller
                                                     operation. The Host Controller shall auto-clear the RESUME
                                                     bit once it has resumed making transfers, i.e. has initiated
                                                     the next Command. Values: 0x0 RUNNING Host Controller Running
                                                     0x1 SUSPENDED Host Controller Suspended                                   */
      __IOM uint32_t BUSENABLE  : 1;            /*!< Host Controller Bus Enable - Enables or disables the operation
                                                     on the I3C Bus by the Host Controller. If the software
                                                     sets this bit, then it also confirms that initialization
                                                     is done, and that the Host Controller can use the programmed
                                                     register values (e.g., generation of SCL on IBI detection,
                                                     etc.). If this bit is not set, then the Host Controller
                                                     shall not generate SCL for incoming IBI. Software may disable
                                                     the Host Controller bus operation while it is active, However,
                                                     if a disable request occurs while receiving IBI, the actual
                                                     disabling will not occur until reception of the IBI is
                                                     complete. If a disable request occurs while the Host Controller
                                                     still has additional Commands queued for transfers, then
                                                     the actual disabling will not occur until transmission
                                                     of all queued Commands is complete (i.e., until the Host
                                                     Controller encounters a Command with TOC set to 1). The
                                                     Host Controller shall then return to the Idle state (as
                                                     indicated in register PRESENT_STATE). When the software
                                                     reads the value 1'b0 from this field, this indicates that
                                                     the Host Controller bus operation disable operation has
                                                     completed. Values: 0x0 DISABLED The Host Controller bus
                                                     operation is Disabled 0x1 ENABLED The Host Controller bus
                                                     operation is Enabled                                                      */
    } HCCONTROL_b;
  } ;

  union {
    __IOM uint32_t DEVICEADDR;                  /*!< Device Address Register                                                   */

