AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
            uint32_t            : 16;
      __IOM uint32_t DYNAMICADDR : 7;           /*!< Device Dynamic Address - This field is used to program the Host
                                                     Controller Device's Dynamic Address in Active Controller
                                                     mode, before passing Controller-role to another Controller.
                                                     In Active Controller mode, the software shall program the
                                                     Dynamic Address as it self-assigns its Dynamic Address.
                                                     If operating as a Secondary Controller, then the Primary
                                                     Controller shall assign the Dynamic Address (i.e., during
                                                     the ENTDAA or SETDASA/SETAASA procedure) or when an Active
                                                     Controller changes the Dynamic Address (i.e., using the
                                                     SETNEWDA CCC). This field contains a valid Dynamic Address
                                                     when field DYNAMIC_ADDR_VALID contains the value 1'b1.                    */
            uint32_t            : 8;
      __IOM uint32_t DYNAMICADDRVALID : 1;      /*!< Dynamic Address Valid - This bit indicates whether or not the
                                                     value in the DYNAMIC_ADDR field is valid. This bit must
                                                     be set to 1'b1 before passing Controller-role to another
                                                     Controller. In Active Controller mode, the software shall
                                                     set this bit to 1'b1 as it self-assigns its Dynamic Address.
                                                     This requires the Host Controller to act as the Primary
                                                     Controller of the I3C Bus. If operating as a Secondary
                                                     Controller (i.e., in Standby Controller mode), then the
                                                     Host Controller shall set this bit to 1'b1 when the Active
                                                     Controller assigns the Dynamic Address Values: 1'b0: The
                                                     Dynamic Address field is not valid 1'b1: The Dynamic Address
                                                     field is valid Note :- This register shall only be written
                                                     when the Host Controller is operating in Active Controller
                                                     mode. If the Host Controller is operating as a Secondary
                                                     Controller (i.e., in Standby Controller mode), then this
                                                     register shall be read-only, and the contents shall be
                                                     set by other logic within the Host Controller.                            */
    } DEVICEADDR_b;
  } ;

  union {
    __IOM uint32_t HCCAPABILITIES;              /*!< Hardware Capabilities Register identifies capabilities of the
                                                     Master Host Controller hardware                                           */

    struct {
            uint32_t            : 2;
      __IOM uint32_t COMBOCOMMAND : 1;          /*!< Defines whether Host Controller supports Combo Command Transfers
                                                     Values: 0x0 DISABLED Combo Transfer is not supported 0x1
                                                     ENABLED Combo Transfer is supported                                       */
      __IOM uint32_t AUTOCOMMAND : 1;           /*!< Defines whether the Host Controller supports Auto- Command functionality.
                                                     Values: 0x0: DISABLED: Auto-Command is not supported 1'b1:
                                                     ENABLED: Auto-Command is supported                                        */
            uint32_t            : 1;
      __IOM uint32_t STANDBYCRCAP : 1;          /*!< Defines whether the Host Controller supports handoff of the
                                                     Active Controller role to another Device on the I3C Bus.
                                                     Values: 0x0: DISABLED: Not capable of acting as Standby
                                                     Controller. 0x1: ENABLED: Capable acting as a Standby Controller
                                                     (i.e. Secondary Controller).                                              */
      __IOM uint32_t HDRDDREN   : 1;            /*!< Defines whether the Host Controller supports HDR-DDR transfers.
                                                     Values: 0x0 DISABLED HDR-DDR not supported 0x1 ENABLED
                                                     HDR-DDR supported                                                         */
      __IOM uint32_t HDRTSEN    : 1;            /*!< Defines whether the Host Controller supports HDR-Ternary transfers.
                                                     Selection of HDR-TSP vs. HDRTSL depends on the value of
                                                     field I2C_DEV_PRESENT in register HC_CONTROL. Values: 1'b0:
                                                     DISABLED: HDR-Ternary is not supported. 1'b1: ENABLED:
                                                     HDR-Ternary is supported.                                                 */
            uint32_t            : 2;
      __IOM uint32_t CMDCCDEFBYTE : 1;          /*!< Defines whether the Host Controller supports transfer commands
                                                     that indicate CCCs with Defining Bytes.                                   */
            uint32_t            : 9;
      __IOM uint32_t CMDSIZE    : 2;            /*!< Defines the size and structure of the Command Descriptor supported
                                                     by the Host Controller. Values: 2'b00: 2 DWORDs All other
                                                     values: Reserved for future use.                                          */
            uint32_t            : 6;
      __IOM uint32_t SGCAPABILITYCREN : 1;      /*!< Defines whether the Host Controller supports Scatter-Gather.
                                                     Values: 1'b0: DISABLED: Scatter-Gather is not supported
                                                     for this capability 1'b1: ENABLED: Scatter-Gather is supported
                                                     for this capability                                                       */
      __IOM uint32_t SGCAPABILITYIBIEN : 1;     /*!< Defines whether the Host Controller supports Scatter-Gather.
                                                     Values: 1'b0: DISABLED: Scatter-Gather is not supported
                                                     for this capability 1'b1: ENABLED: Scatter-Gather is supported
                                                     for this capability                                                       */
      __IOM uint32_t SGCAPABILITYDCEN : 1;      /*!< Defines whether the Host Controller supports Scatter-Gather.
                                                     Values: 1'b0: DISABLED: Scatter-Gather is not supported
                                                     for this capability 1'b1: ENABLED: Scatter-Gather is supported
                                                     for this capability                                                       */
            uint32_t            : 1;
    } HCCAPABILITIES_b;
  } ;

  union {
    __IOM uint32_t RESETCTRL;                   /*!< Reset Control Register is used to reset specific functional
                                                     areas of Host Controller, including buffer resets.                        */

