AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SOFTRST    : 1;            /*!< Core Software Reset On Driver setting this bit to 0x1, the Host
                                                     Controller shall be reset and disabled. All registers shall
                                                     return to their reset values, and the software shall re-initialize
                                                     the Controller. This field is cleared automatically upon
                                                     Host Controller reset completion. This field also resets
                                                     all Queues in the Host Controller. This field does not
                                                     reset any Ring Headers in the Host Controller. Note: Programming
                                                     this field while it contains a value of 0x1 may result
                                                     in undefined behavior.                                                    */
      __IOM uint32_t CMDQUEUERST : 1;           /*!< Command Queue Software Reset On software setting this bit to
                                                     1'b1, the Command Queues in the Controller shall be flushed.
                                                     This field shall be cleared automatically upon Command
                                                     Queue reset completion. This field is valid for PIO Mode
                                                     only.                                                                     */
      __IOM uint32_t RESPQUEUERST : 1;          /*!< Response Queue Software Reset On software setting this bit to
                                                     1'b1, the Response Queues in the Controller shall be flushed.
                                                     This field shall be cleared automatically upon Response
                                                     Queue reset completion. This field is valid for PIO Mode
                                                     only.                                                                     */
      __IOM uint32_t TXFIFORST  : 1;            /*!< Transmit Queue Buffer Software Reset On software setting this
                                                     bit to 1'b1, the Tx Queues in the Controller shall be flushed.
                                                     This field shall be cleared automatically upon Tx Data
                                                     Queue reset completion. This field is valid for PIO Mode
                                                     only.                                                                     */
      __IOM uint32_t RXFIFORST  : 1;            /*!< Receive Queue Buffer Software Reset On software setting this
                                                     bit to 1'b1, the Rx Queues in the Controller shall be flushed.
                                                     This field shall be cleared automatically upon completion
                                                     of Rx Data Queue reset. This field is valid for PIO Mode
                                                     only.                                                                     */
      __IOM uint32_t IBIQUEUERST : 1;           /*!< IBI Queue Buffer Software Reset On software setting this bit
                                                     to 1'b1, the IBI Queues in the Controller shall be flushed.
                                                     This field shall be cleared automatically upon completion
                                                     of IBI Queue reset. This field is valid for PIO Mode only.                */
            uint32_t            : 26;
    } RESETCTRL_b;
  } ;

  union {
    __IOM uint32_t PRESENTSTATE;                /*!< Present State                                                             */

    struct {
            uint32_t            : 2;
      __IOM uint32_t CURRENTCONTROLLER : 1;     /*!< Active Controller This bit indicates whether or not the Host
                                                     Controller is presently the Active Controller on the I3C
                                                     Bus. The Active Controller is the Controller capable Device
                                                     on the I3C Bus that owns the SCL line. Values: 1'b0: NOT_BUS_OWNER:
                                                     The Host Controller is not the Active Controller, and must
                                                     request and acquire Bus ownership before initiating any
                                                     transfer. 1'b1: BUS_OWNER: The Host Controller is the Active
                                                     Controller, and as a result can initiate transfers.                       */
            uint32_t            : 29;
    } PRESENTSTATE_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t INTRSTATUS;                  /*!< Interrupt Status Register is used to reflect status of outstanding
                                                     interrupts. The status fields are RW1C (Write 1 to clear).                */

    struct {
            uint32_t            : 10;
      __IOM uint32_t HCINTERNALERRSTAT : 1;     /*!< Host Controller Internal Error Status Reflects the interrupt
                                                     status that is populated based on any non-recoverable internal
                                                     error of the Host Controller. Note: Currently this is not
                                                     supported.                                                                */
      __IOM uint32_t HCSEQCANCELSTAT : 1;       /*!< Host Controller Cancelled Transaction Sequence The I3C Bus Controller
                                                     Logic was forced to cancel a transaction sequence.                        */
      __IOM uint32_t HCWARNCMDSEQSTALLSTAT : 1; /*!< Host Controller Command Sequence Stall/Timeout The I3C Bus Controller
                                                     Logic experienced a command sequence stall condition (warning)
                                                     or timeout (error). Note:- Currently this is not supported.               */
      __IOM uint32_t HCERRCMDSEQTIMEOUTSTAT : 1;/*!< Host Controller Command Sequence Stall/Timeout The I3C Bus Controller
                                                     Logic experienced a command sequence stall condition (warning)
                                                     or timeout (error). Note:- Currently this is not supported.               */
            uint32_t            : 18;
    } INTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t INTRSTATUSENABLE;            /*!< Interrupt Status Enable Register is used to enable reporting
                                                     of outstanding interrupts.                                                */

