AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t IBIDATA    : 32;           /*!< Data read from IBI Data Buffer. This register is mapped to the
                                                     IBI Ring Data Buffer.The IBI Data is always packed in 4-byte
                                                     aligned and put to the IBI Ring. If the incoming data is
                                                     not aligned to the 4-bytes, then there will be unused bytes
                                                     in the end location of the IBI transfer. Table 48 : IBI
                                                     Data Port Register Fields                                                 */
    } IBIPORT_b;
  } ;

  union {
    __IOM uint32_t QUEUETHLDCTRL;               /*!< QUEUE_THLD_CTRL                                                           */

    struct {
      __IOM uint32_t CMDEMPTYBUFTHLD : 8;       /*!< Command Ready Buffer Threshold in DWORDs Controls the minimum
                                                     number of empty Command Queue entries needed to trigger
                                                     the CMD_QUEUE_READY_STAT interrupt. If this field is greater
                                                     than (QUEUE_SIZE.CR_QUEUE_SIZE 1), then only the number
                                                     of bits required to address the full buffer depth will
                                                     be considered. Values: 0: Interrupt is issued when Command
                                                     Queue is completely empty N: Interrupt is issued when Command
                                                     Queue contains N entries                                                  */
      __IOM uint32_t RESPBUFTHLD : 8;           /*!< Response Ready Buffer Threshold in DWORDs Controls the minimum
                                                     number of Response Queue entries needed to trigger the
                                                     RESP_READY_STAT interrupt. If this field is greater than
                                                     (QUEUE_SIZE.CR_QUEUE_SIZE 1), then only the number of bits
                                                     required to address the full buffer depth will be considered.
                                                     Values: 0: Interrupt is issued when response Queue contains
                                                     1 entry (DWORD) N: Interrupt is triggered when Response
                                                     Queue contains N+1 entries (DWORD)                                        */
      __IOM uint32_t IBIDATATHLD : 8;           /*!< IBI Data Threshold This is the IBI Data segment size, in DWORDs
                                                     (4 Bytes). Supported Values: Minimum: 1 (4 Bytes) Maximum:
                                                     63 (252 Bytes), provided that the configured IBI Queue
                                                     depth is GE 64. In PIO Mode, this field allows the incoming
                                                     IBI Data to be sliced into multiple segments generating
                                                     status individually, to support cut- through readout of
                                                     a long IBI Payload Data. When Asynchronous Timing Control
                                                     mode is supported, this field should be set to a value
                                                     of 4 or more to allow the single data segment to contain
                                                     the entire Master timestamp value (i.e., both MREF and
                                                     MC2).                                                                     */
      __IOM uint32_t IBISTATUSTHLD : 8;         /*!< IBI Status Threshold in DWORDs Controls generation of the IBI_STATUS_THLD_STAT
                                                     interrupt, based on the value of the IBI Queues Outstanding
                                                     IBI Status count. Values: 0: Interrupt is generated when
                                                     the Outstanding IBI Status count is GE 1 N: Interrupt is
                                                     generated when the Outstanding IBI Status is GE N+1 Each
                                                     IBI Status entry can represent either the complete IBI
                                                     payload (if the IBI payload byte size LE 4*IBI_DATA_THLD),
                                                     or a segment of the IBI payload (if the IBI payload byte
                                                     size GT 4*IBI_DATA_THLD).                                                 */
    } QUEUETHLDCTRL_b;
  } ;

  union {
    __IOM uint32_t DATABUFFERTHLDCTRL;          /*!< DATA_BUFFER_THLD_CTRL                                                     */

    struct {
      __IOM uint32_t TXBUFTHLD  : 3;            /*!< Transmit Buffer Threshold Minimum number of empty Transmit FIFO
                                                     entries, in DWORDs, that will trigger the TX_THLD_STAT
                                                     interrupt. The software must program a value less than
                                                     QUEUE_SIZE.TX_DATA_BUFFER_SIZE in this register. Values:
                                                     0x0: Interrupt triggers at 2 Tx Buffer entries, DWORDs
                                                     0x1: Interrupt triggers at 4 Tx Buffer entries, DWORDs
                                                     0x2: Interrupt triggers at 8 Tx Buffer entries, DWORDs
                                                     0x3: Interrupt triggers at 16 Tx Buffer entries, DWORDs
                                                     0x4: Interrupt triggers at 32 Tx Buffer entries, DWORDs
                                                     0x5: Interrupt triggers at 64 Tx Buffer entries, DWORDs
                                                     0x6: Interrupt triggers at 128 Tx Buffer entries, DWORDs
                                                     0x7: Interrupt triggers at 256 Tx Buffer entries, DWORDs                  */
            uint32_t            : 5;
      __IOM uint32_t RXBUFTHLD  : 3;            /*!< Receive Buffer Threshold Minimum number of Receive FIFO entries
                                                     in DWORDs that will trigger the RX_THLD_STAT interrupt.
                                                     The software must program a value less than QUEUE_SIZE.RX_DATA_BUFFER_SIZ
                                                     in this register. Values: 0x0: Interrupt triggers at 2
                                                     Rx Buffer entries, DWORDs 0x1: Interrupt triggers at 4
                                                     Rx Buffer entries, DWORDs 0x2: Interrupt triggers at 8
                                                     Rx Buffer entries, DWORDs 0x3: Interrupt triggers at 16
                                                     Rx Buffer entries, DWORDs 0x4: Interrupt triggers at 32
                                                     Rx Buffer entries, DWORDs 0x5: Interrupt triggers at 64
                                                     Rx Buffer entries, DWORDs 0x6: Interrupt triggers at 128
                                                     Rx Buffer entries, DWORDs 0x7: Interrupt triggers at 256
                                                     Rx Buffer entries, DWORDs                                                 */
            uint32_t            : 5;
      __IOM uint32_t TXSTARTTHLD : 3;           /*!< Transmit (Transfer) Start Threshold in DWORDs When preparing
                                                     to initiate a Write Transfer on the I3C Bus, the Host Controller
                                                     shall wait until the Transmit Buffer has at least the indicated
                                                     number of locations available. Two optional configurable
                                                     Modes are available: Store and Forward Mode If the TX_START_THLD
                                                     field is set to the Transmit Buffer size, then the Host
                                                     Controller shall delay initiation of the Write Command
                                                     as follows: If the data length to be transferred is GT
                                                     the Transmit Buffer size, then the Host Controller shall
                                                     wait until the Transmit FIFO is completely full. If the
                                                     data length to be transferred is LT the Transmit Buffer
                                                     size, then the Host Controller shall wait until enough
                                                     Transmit FIFO locations are available to store the data
                                                     to be transferred. Threshold Mode If the TX_START_THLD
                                                     field value is LT the Transmit Buffer size, then the Host
                                                     Controller shall initiate the Write Command as soon as
                                                     the indicated number of Transmit FIFO locations are empty.
                                                     Values: 0x0: Wait for 2 DWORDs 0x1: Wait for 4 DWORDs 0x2:
                                                     Wait for 8 DWORDs 0x3: Wait for 16 DWORDs 0x4: Wait for
                                                     32 DWORDs 0x5: Wait for 64 DWORDs 0x6: Wait for 128 DWORDs
                                                     0x7: Wait for 256 DWORDs                                                  */
            uint32_t            : 5;
      __IOM uint32_t RXSTARTTHLD : 3;           /*!< Receive Start Threshold When preparing to initiate a Read Transfer
                                                     on the I3C Bus, the Host Controller shall wait until the
                                                     Receive Buffer has at least the indicated number of empty
                                                     locations in DWORDs. Two optional configurable Modes are
                                                     available: Store and Forward Mode If the RX_START_THLD
                                                     field is set to the Receive Buffer size, then the Host
                                                     Controller shall delay initiation of the Read Command as
                                                     follows: If the data length to be transferred is GT the
                                                     Receive Buffer size, then the Host Controller shall wait
                                                     until the Receive FIFO is completely empty. If the data
                                                     length to be transferred is LT the Receive Buffer size,
                                                     then the Host Controller shall wait until enough Receive
                                                     FIFO locations are available to store the data to be transferred.
                                                     Threshold Mode If the RX_START_THLD field value is LT the
                                                     Receive Buffer size, then the Host Controller shall initiate
                                                     the Read Command as soon as the indicated number of Receive
                                                     FIFO locations are empty. Values: 0x0: Wait for 2 empty
                                                     DWORDs 0x1: Wait for 4 empty DWORDs 0x2: Wait for 8 empty
                                                     DWORDs 0x3: Wait for 16 empty DWORDs 0x4: Wait for 32 empty
                                                     DWORDs 0x5: Wait for 64 empty DWORDs 0x6: Wait for 128
                                                     empty DWORDs 0x7: Wait for 256 empty DWORDs                               */
            uint32_t            : 5;
    } DATABUFFERTHLDCTRL_b;
  } ;

  union {
    __IOM uint32_t QUEUESIZECTRL;               /*!< QUEUE_SIZE_CTRL                                                           */

