AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t RH0OFFSET  : 32;           /*!< Ring Header 0 Descriptor Offset. HCI Base Adress relative offset
                                                     to Ring Header descriptor for ring bundle index 0.                        */
    } RH0OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH1OFFSET;                   /*!< Ring Header 1 Offset                                                      */

    struct {
      __IOM uint32_t RH1OFFSET  : 32;           /*!< Ring Header 0 Descriptor Offset. HCI Base Adress relative offset
                                                     to Ring Header descriptor for ring bundle index 1.                        */
    } RH1OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH2OFFSET;                   /*!< Ring Header 2 Offset                                                      */

    struct {
      __IOM uint32_t RH2OFFSET  : 32;           /*!< Ring Header 0 Descriptor Offset. HCI Base Adress relative offset
                                                     to Ring Header descriptor for ring bundle index 2.                        */
    } RH2OFFSET_b;
  } ;

  union {
    __IOM uint32_t RH3OFFSET;                   /*!< Ring Header 3 Offset                                                      */

    struct {
      __IOM uint32_t RH3OFFSET  : 32;           /*!< Ring Header 0 Descriptor Offset. HCI Base Adress relative offset
                                                     to Ring Header descriptor for ring bundle index 3.                        */
    } RH3OFFSET_b;
  } ;
  __IM  uint32_t  RESERVED8[7];

  union {
    __IOM uint32_t CRSETUP;                     /*!< CR_SETUP                                                                  */

    struct {
      __IOM uint32_t RINGSIZE   : 8;            /*!< Size of Command / Response ring. Driver shall allocate (XFER_SZ
                                                     * RING_SIZE) Bytes for Command Ring, and (RESP_SZ * RING_SIZE)
                                                     for Response Ring. Valid values 0-255. Table 26 : Command/Response
                                                     Ring Control Register Fields                                              */
            uint32_t            : 8;
      __IOM uint32_t RESPSTRUCTSIZE : 8;        /*!< Response descriptor size, in Bytes. Size of the structure describing
                                                     response (Response Descriptor)                                            */
      __IOM uint32_t XFERSTRUCTSIZE : 8;        /*!< Transfer descriptor size, in Bytes. Size of the structure describing
                                                     transfer (Transfer Descriptor)                                            */
    } CRSETUP_b;
  } ;

  union {
    __IOM uint32_t IBISETUP;                    /*!< IBI_SETUP                                                                 */

    struct {
      __IOM uint32_t CHUNKCOUNT : 10;           /*!< IBI Data Ring Chunk Count Number of Data Chunks on IBI Data
                                                     Ring. The size in bytes of the IBI Data Ring is CHUNK_COUNT
                                                     * CHUNK_SIZE. Valid Values: 0-0x3FF                                       */
      __IOM uint32_t CHUNKSIZE  : 3;            /*!< IBI Data Ring Data Chunk Size Size per Data Chunk on the IBI
                                                     Data Ring. Values: 0: 4 bytes per Data Chunk 1: 8 bytes
                                                     per Data Chunk 2: 16 bytes per Data Chunk 3: 32 bytes per
                                                     Data Chunk 4: 64 bytes per Data Chunk 5: 128 bytes per
                                                     Data Chunk 6: 256 bytes per Data Chunk 7: Reserved, do
                                                     not use                                                                   */
            uint32_t            : 3;
      __IOM uint32_t IBISTATUSRINGSIZE : 8;     /*!< IBI Status Ring Size IBI Status Ring size (in IBI Status Descriptor
                                                     entries). Valid Values: 0-255                                             */
      __IOM uint32_t IBISTATUSSTRUCTSIZE : 8;   /*!< IBI Status Structure Size IBI Status Descriptor structure size
                                                     (in bytes).                                                               */
    } IBISETUP_b;
  } ;

  union {
    __IOM uint32_t CHUNKCONTROL;                /*!< CHUNK_CONTROL                                                             */

    struct {
      __IOM uint32_t CHUNKCOUNTER : 32;         /*!< Chunk Counter This is a monotonic counter that the software
                                                     Driver would increment by the number of Chunks freed up,
                                                     providing the Host Controller with the number of Data Chunks
                                                     freed. The Driver software shall reset this field before
                                                     transitioning the Ring Bundle to the Enabled state. Table
                                                     28 : Chunk Control (CHUNK_CONTROL) Register                               */
    } CHUNKCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED9;

  union {
    __IOM uint32_t RHINTRSTATUS;                /*!< RH_INTR_STATUS                                                            */

    struct {
            uint32_t            : 5;
      __IOM uint32_t RHTRANSFERABORTSTAT : 1;   /*!< Transfer Abort Status The Host Controller shall write 1'b1 to
                                                     this field to indicate that a transfer operation has been
                                                     aborted. To clear, write 1'b0 to this bit.                                */
      __IOM uint32_t IBIRINGFULLSTAT : 1;       /*!< IBI Ring Full Condition Error Status. The Host Controller shall
                                                     write 1'b1 to this field to indicate lack of space on IBI
                                                     Status or IBI Data Rings upon receiving IBI.                              */
            uint32_t            : 2;
      __IOM uint32_t RHTRANSFERERRSTAT : 1;     /*!< Transfer Error Status The Host Controller shall write 1'b1 to
                                                     this field to indicate that an error (i.e., any error)
                                                     has occurred during an I3C Bus transfer. The Error Type
                                                     for this error event can be found in the Response Descriptor
                                                     structure corresponding to this transfer. To clear, write
                                                     1'b0 to this bit.                                                         */
      __IOM uint32_t RINGOPSTAT : 1;            /*!< Ring Operation Status The Host Controller shall write 1'b1 to
                                                     this field to indicate that the Rings state has changed
                                                     to Running, Aborted, or Stopped. To clear, write 1'b0 to
                                                     this bit.                                                                 */
      __IOM uint32_t TRANSFERCOMPLETIONSTAT : 1;/*!< Transfer Completion Status The Host Controller shall write 1'b1
                                                     to this field to indicate successful completion of a transfer,
                                                     for all Transfer Descriptors featuring IOC. To clear, write
                                                     1'b0 to this bit.                                                         */
      __IOM uint32_t IBIREADYSTAT : 1;          /*!< IBI Ready Status The Host Controller shall write 1'b1 to this
                                                     field to indicate that an IBI has been received. To clear,
                                                     write 1'b0 to this bit.                                                   */
            uint32_t            : 19;
    } RHINTRSTATUS_b;
  } ;

  union {
    __IOM uint32_t RHINTRSTATUSENABLE;          /*!< RH_INTR_STATUS_ENABLE                                                     */

