AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
            uint32_t            : 5;
      __IOM uint32_t RHTRANSFERABORTSTATEN : 1; /*!< When set to 1'b1, the corresponding _STAT bit in register RH_INTR_STATUS
                                                     shall be set upon an appropriate hardware event.                          */
      __IOM uint32_t IBIRINGFULLSTATEN : 1;     /*!< IBI Ring Full Condition Status Enable. Enables the corresponding
                                                     interrupt bit. When set to 1'b1, IBI_RING_FULL_STAT interrupts
                                                     shall be logged.                                                          */
            uint32_t            : 2;
      __IOM uint32_t RHTRANSFERERRSTATEN : 1;   /*!< When set to 1'b1, the corresponding _STAT bit in register RH_INTR_STATUS
                                                     shall be set upon an appropriate hardware event.                          */
      __IOM uint32_t RINGOPSTATEN : 1;          /*!< When set to 1'b1, the corresponding _STAT bit in register RH_INTR_STATUS
                                                     shall be set upon an appropriate hardware event.                          */
      __IOM uint32_t RHTRANSFERCOMPLETIONSTATEN : 1;/*!< When set to 1'b1, the STAT_EN corresponding _STAT bit in register
                                                     RH_INTR_STATUS shall be set upon an appropriate hardware
                                                     event.                                                                    */
      __IOM uint32_t IBIREADYSTATEN : 1;        /*!< When set to 1'b1, the corresponding _STAT bit in register RH_INTR_STATUS
                                                     shall be set upon an appropriate hardware event.                          */
            uint32_t            : 19;
    } RHINTRSTATUSENABLE_b;
  } ;

  union {
    __IOM uint32_t RHINTRSIGNALENABLE;          /*!< RH_INTR_SIGNAL_ENABLE                                                     */

    struct {
            uint32_t            : 5;
      __IOM uint32_t RHTRANSFERABORTSIGNALEN : 1;/*!< When set to 1'b1, and the corresponding interrupt status is
                                                     set, the Host Controller shall assert an interrupt to the
                                                     Host.                                                                     */
      __IOM uint32_t IBIRINGFULLSIGNALEN : 1;   /*!< IBI ring full signal enable                                               */
            uint32_t            : 2;
      __IOM uint32_t RHTRANSFERERRSIGNALEN : 1; /*!< When set to 1'b1, and the corresponding interrupt status is
                                                     set, the Host Controller shall assert an interrupt to the
                                                     Host.                                                                     */
      __IOM uint32_t RINGOP     : 1;            /*!< When set to 1'b1, and the corresponding interrupt status is
                                                     set, the Host Controller shall assert an interrupt to the
                                                     Host.                                                                     */
      __IOM uint32_t RHTRANSFERCOMPLETIONSIGNALEN : 1;/*!< When set to 1'b1, and the SIGNAL_EN corresponding interrupt
                                                     status is set, the Host Controller shall assert an interrupt
                                                     to the Host.                                                              */
      __IOM uint32_t IBIREADYSIGNALEN : 1;      /*!< When set to 1'b1, and the corresponding interrupt status is
                                                     set, the Host Controller shall assert an interrupt to the
                                                     Host.                                                                     */
            uint32_t            : 19;
    } RHINTRSIGNALENABLE_b;
  } ;

  union {
    __IOM uint32_t RHINTRFORCE;                 /*!< RH_INTR_FORCE                                                             */

    struct {
            uint32_t            : 5;
      __IOM uint32_t TRANSFERABORTFORCE : 1;    /*!< For software testing, helps mimic assertion of the corresponding
                                                     interrupt. Requires prior configuration of the corresponding
                                                     bits in registers INTR_EN and INTR_STAT_EN.                               */
      __IOM uint32_t IBIRINGFULLFORCE : 1;      /*!< FIXME - Description needed.                                               */
            uint32_t            : 2;
      __IOM uint32_t TRANSFERERRFORCE : 1;      /*!< FIXME - Description needed.                                               */
      __IOM uint32_t RINGOPFORCE : 1;           /*!< INTR_EN and INTR_STAT_EN.                                                 */
      __IOM uint32_t TRANSFERCOMPLETIONFORCE : 1;/*!< interrupt. Requires prior configuration of the corresponding
                                                     bits in registers                                                         */
      __IOM uint32_t IBIREADYFORCE : 1;         /*!< For software testing, helps mimic assertion of the corresponding          */
            uint32_t            : 19;
    } RHINTRFORCE_b;
  } ;

  union {
    __IOM uint32_t RHSTATUS;                    /*!< RH_STATUS                                                                 */

    struct {
      __IOM uint32_t ENABLED    : 1;            /*!< Ring Enabled Values: 1'b1: Ring enabled 1'b0: Ring disabled
                                                     If the Ring is disenabled, then no operation on the Ring
                                                     shall be possible.                                                        */
      __IOM uint32_t RUNNING    : 1;            /*!< Ring Running Values: 1'b1: Ring running 1'b0: Ring not running
                                                     (stopped) If the Ring is not running, then the Enqueue
                                                     Pointer update shall not trigger the commands.                            */
      __IOM uint32_t ABORTED    : 1;            /*!< Ring Aborted Values: 1'b1: Ring aborted If the Ring is aborted,
                                                     then it shall wait for Abort condition clearing and Enqueue
                                                     Pointer Write (Doorbell) in order to resume operation.
                                                     1'b0: Ring not aborted                                                    */
      __IOM uint32_t LOCKED     : 1;            /*!< Ring Locked Indicates lock status of Ring Values: 1'b1: Ring
                                                     locked 1'b0: Ring not locked                                              */
            uint32_t            : 28;
    } RHSTATUS_b;
  } ;

  union {
    __IOM uint32_t RHCONTROL;                   /*!< RH_CONTROL                                                                */

