AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Ring Enable Request If the Ring Bundle is enabled for hardware
                                                     processing, then the ENABLED bit in register RH_STATUS
                                                     shall have the value 1'b1. A transition of this bit to
                                                     1'b1 (Enable) shall reset all hardware internal pointers
                                                     (if any). Values: 1'b1: Ring Enable request 1'b0: Ring
                                                     Disable request                                                           */
      __IOM uint32_t RS         : 1;            /*!< Ring Run / Stop Request If the Ring Bundle is running, then
                                                     the RUNNING bit in register RH_STATUS shall have the value
                                                     1'b1. The Driver may use this bit to dynamically pause
                                                     operation of a given Ring Bundle. The Host Controller shall
                                                     stop the Ring Bundle gracefully at the first possible opportunity
                                                     (boundary). The software Driver shall only toggle this
                                                     bit if the ENABLE field already has value 1'b1 (Ring Enable
                                                     requested). Values: 1'b1: Ring Start request 1'b0: Ring
                                                     Stop request                                                              */
      __IOM uint32_t RHABORT    : 1;            /*!< Ring Abort Request Values: 1'b1: Ring Abort request 1'b0: Ring
                                                     Abort clear request                                                       */
            uint32_t            : 29;
    } RHCONTROL_b;
  } ;

  union {
    __IOM uint32_t RHOPERATION1;                /*!< RH_OPERATION1                                                             */

    struct {
      __IOM uint32_t CRENQPTR   : 8;            /*!< Command / Response Ring Enqueue Pointer                                   */
      __IOM uint32_t CRSWDEQPTR : 8;            /*!< Command / Response Ring SW Dequeue Pointer                                */
      __IOM uint32_t IBISWDEQPTR : 8;           /*!< IBI Status Ring SW Dequeue Pointer                                        */
            uint32_t            : 8;
    } RHOPERATION1_b;
  } ;

  union {
    __IOM uint32_t RHOPERATION2;                /*!< RH_OPERATION2                                                             */

    struct {
      __IOM uint32_t CRDEQPTR   : 8;            /*!< Command / Response Ring Dequeue Pointer Table 36 : Ring Operation
                                                     Register Fields                                                           */
            uint32_t            : 8;
      __IOM uint32_t IBIENQPTR  : 8;            /*!< IBI Status Ring SW Dequeue Pointer                                        */
            uint32_t            : 8;
    } RHOPERATION2_b;
  } ;

  union {
    __IOM uint32_t RHCMDRINGBASELO;             /*!< RH_CMD_RING_BASE_LO                                                       */

    struct {
      __IOM uint32_t RHCMDRINGBASELO : 32;      /*!< Command Ring Base Address Low Lower 32 bits of pointer to physical
                                                     memory allocated for the Command Ring. The Command Ring
                                                     is DWORD aligned, so the last two address bits will always
                                                     be 2b00.                                                                  */
    } RHCMDRINGBASELO_b;
  } ;

  union {
    __IOM uint32_t RHCMDRINGBASEHI;             /*!< RH_CMD_RING_BASE_HI                                                       */

    struct {
      __IOM uint32_t RHCMDRINGBASEHI : 32;      /*!< Command Ring Base Address High Upper 32 bits of pointer to physical
                                                     memory allocated for Command Ring                                         */
    } RHCMDRINGBASEHI_b;
  } ;

  union {
    __IOM uint32_t RHRESPRINGBASELO;            /*!< RH_RESP_RING_BASE_LO                                                      */

    struct {
      __IOM uint32_t RHSPRINGBASELO : 32;       /*!< Response Ring Base Address Low Lower 32 bits of pointer to physical
                                                     memory allocated for the Response Ring. Because the Response
                                                     Ring is DWORD aligned, the lowest two address bits will
                                                     always be 2b00.                                                           */
    } RHRESPRINGBASELO_b;
  } ;

  union {
    __IOM uint32_t RHRESPRINGBASEHI;            /*!< RH_RESP_RING_BASE_HI                                                      */

    struct {
      __IOM uint32_t RHRESPRINGBASEHI : 32;     /*!< Response Ring Base Address High Upper 32 bits of pointer to
                                                     physical memory allocated for Response Ring                               */
    } RHRESPRINGBASEHI_b;
  } ;

  union {
    __IOM uint32_t RHIBISTATUSRINGBASELO;       /*!< RH_IBI_STATUS_RING_BASE_LO                                                */

    struct {
      __IOM uint32_t RHIBISTATBASELO : 32;      /*!< IBI Status Ring Base Address Low Lower 32 bits of pointer to
                                                     physical memory allocated for the IBI Status Ring. Because
                                                     the IBI Status Ring is DWORD aligned, the lowest two address
                                                     bits will always be 2b00.                                                 */
    } RHIBISTATUSRINGBASELO_b;
  } ;

  union {
    __IOM uint32_t RHIBISTATUSRINGBASEHI;       /*!< RH_IBI_STATUS_RING_BASE_HI                                                */

