AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t DCMDCMP    : 1;            /*!< Triggered DMA from Command complete event. Bit is read only
                                                     and can be cleared by disabling the DCMDCMP trigger enable
                                                     or by disabling DMA.                                                      */
      __IOM uint32_t DTHR       : 1;            /*!< Triggered DMA from THR event. Bit is read only and can be cleared
                                                     by disabling the DTHR trigger enable or by disabling DMA.                 */
      __IOM uint32_t DTOTCMP    : 1;            /*!< DMA triggered when DCMDCMP = 0, and the amount of data in the
                                                     FIFO was enough to complete the DMA operation (greater
                                                     than or equal to current TOTCOUNT) when the command completed.
                                                     This trigger is default active when the DCMDCMP trigger
                                                     isdisabled and there is enough data in the FIFO to complete
                                                     the DMA operation.                                                        */
            uint32_t            : 29;
    } DMATRIGSTAT_b;
  } ;

  union {
    __IOM uint32_t DMACFG;                      /*!< Configuration control of the DMA process, including the direction
                                                     of DMA, and enablement of DMA                                             */

    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation.
                                                     This should be the last DMA related register set prior
                                                     to issuing the command                                                    */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 6;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power off module after DMA is complete. If this bit is active,
                                                     the module will request to power off the supply it is attached
                                                     to. If there are other units still requiring power from
                                                     the same domain, power down will not be performed.                        */
            uint32_t            : 22;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< Contains the number of bytes to be transferred for this DMA
                                                     transaction. This register is decremented as the data is
                                                     transferred, and will be 0 at the completion of the DMA
                                                     operation.                                                                */

    struct {
      __IOM uint32_t TOTCOUNT   : 12;           /*!< Triggered DMA from Command complete event occured. Bit is read
                                                     only and can be cleared by disabling the DTHR trigger enable
                                                     or by disabling DMA.                                                      */
            uint32_t            : 20;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< The source or destination address internal the SRAM for the
                                                     DMA data. For write operations, this can only be SRAM data
                                                     (ADDR bit 28 = 1); For read operations, this can ve either
                                                     SRAM or FLASH (ADDR bit 28 = 0)                                           */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Bits [28:0] of the target byte address for source of DMA (either
                                                     read or write). The address can be any byte alignment,
                                                     and does not have to be word aligned. In cases of non-word
                                                     aligned addresses, the DMA logic will take care for ensuring
                                                     only the target bytes are read/written.                                   */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< Status of the DMA operation currently in progress.                        */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress indicator. 1 will indicate that a DMA
                                                     transfer is active. The DMA transfer may be waiting on
                                                     data, transferring data, or waiting for priority.All of
                                                     these will be indicated with a 1. A 0 will indicate that
                                                     the DMA is fully complete and no further transactions will
                                                     be done. This bit is read only.                                           */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete. This signals the end of the DMA operation.
                                                     This bit can be cleared by writing to 0, and will also
                                                     be cleared when a new DMA is started.                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error. This active high bit signals an error was encountered
                                                     during the DMA operation. The bit can be cleared by writing
                                                     to 0. Once set, this bit will remain set until cleared
                                                     by software.                                                              */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;

  union {
    __IOM uint32_t CQCFG;                       /*!< Controls parameters and options for execution of the command
                                                     queue operation. To enable command queue, create this in
                                                     memory, set the address, and enable it with a write to
                                                     CQEN                                                                      */

