AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CQEN       : 1;            /*!< Command queue enable. When set, will enable the processing of
                                                     the command queue and fetches of address/data pairs will
                                                     proceed from the word address within the CQADDR register.
                                                     Can be disabledusing a CQ executed write to this bit as
                                                     well.                                                                     */
      __IOM uint32_t CQPRI      : 1;            /*!< Sets the Priority of the command queue dma request                        */
      __IOM uint32_t CM4MSPIFLGSEL : 2;         /*!< Selects the MPSI/CM4 modules used for sourcing the CQFLAG [11:8].         */
            uint32_t            : 28;
    } CQCFG_b;
  } ;

  union {
    __IOM uint32_t CQADDR;                      /*!< The SRAM address which will be fetched next execution of the
                                                     CQ operation. This register is updated as the CQ operation
                                                     progresses, and is the live version of the register. The
                                                     register can also bewritten by the Command Queue operation
                                                     itself, allowing the relocation of successive CQ fetches.
                                                     In this case, the new CQ address will be used for the next
                                                     CQ address/data fetch                                                     */

    struct {
            uint32_t            : 2;
      __IOM uint32_t CQADDR     : 30;           /*!< Bits 28:2 of target byte address for source of CQ . The buffer
                                                     must be aligned on a word boundary                                        */
    } CQADDR_b;
  } ;

  union {
    __IOM uint32_t CQSTAT;                      /*!< Provides the status of the command queue operation. If the command
                                                     queue is disabled, these bits will be cleared. The bits
                                                     are read only                                                             */

    struct {
      __IOM uint32_t CQTIP      : 1;            /*!< Command queue Transfer In Progress indicator. 1 will indicate
                                                     that a CQ transfer is active and this will remain active
                                                     even when paused waiting for external event.                              */
      __IOM uint32_t CQPAUSED   : 1;            /*!< Command queue operation is currently paused.                              */
      __IOM uint32_t CQERR      : 1;            /*!< Command queue processing Error. This active high bit signals
                                                     that an error was encountered during the CQ operation.                    */
            uint32_t            : 29;
    } CQSTAT_b;
  } ;

  union {
    __IOM uint32_t CQFLAGS;                     /*!< Command Queue Flag                                                        */

    struct {
      __IOM uint32_t CQFLAGS    : 16;           /*!< Current flag status (read-only). Bits [7:0] are software controllable
                                                     and bits [15:8] are hardware status.                                      */
      __IOM uint32_t CQIRQMASK  : 16;           /*!< Mask the bits used to generate the command queue interrupt.
                                                     A '1' in the bit position will enable the pause event to
                                                     trigger the interrupt, if the CQWT_int interrupt is enabled.
                                                     Bits definitions are the same as CQPAUSE                                  */
    } CQFLAGS_b;
  } ;

  union {
    __IOM uint32_t CQSETCLEAR;                  /*!< Set/Clear the command queue software pause flags on a per-bit
                                                     basis. Contains 3 fields, allowing for setting, clearing
                                                     or toggling the value in the software flags. Priority when
                                                     the same bitis enabled in each field is toggle, then set,
                                                     then clear.                                                               */

    struct {
      __IOM uint32_t CQFSET     : 8;            /*!< Set CQFlag status bits. Will set to 1 the value of any SWFLAG
                                                     with a '1' in the corresponding bit position of this field                */
      __IOM uint32_t CQFTGL     : 8;            /*!< Toggle the indicated bit. Will toggle the value of any SWFLAG
                                                     with a '1' in the corresponding bit position of this field                */
      __IOM uint32_t CQFCLR     : 8;            /*!< Clear CQFlag status bits. Will clear to 0 any SWFLAG with a
                                                     '1' in the corresponding bit position of this field                       */
            uint32_t            : 8;
    } CQSETCLEAR_b;
  } ;

  union {
    __IOM uint32_t CQPAUSEEN;                   /*!< Enables a flag to pause an active command queue operation. If
                                                     a bit is '1' and the corresponding bit in the CQFLAG register
                                                     is '1', CQ processing will halt until either value is changed
                                                     to '0'.                                                                   */

    struct {
      __IOM uint32_t CQPEN      : 16;           /*!< Enables the specified event to pause command processing when
                                                     active                                                                    */
            uint32_t            : 16;
    } CQPAUSEEN_b;
  } ;

  union {
    __IOM uint32_t CQCURIDX;                    /*!< Current index value, targeted to be written by register write
                                                     operations within the command queue. This is compared to
                                                     the CQENDIDX and will stop the CQ operation if bit 15 of
                                                     the CQPAUSEEN is '1' andthis current index equals the CQENDIDX
                                                     register value. This will only pause when the values are
                                                     equal.                                                                    */

