AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTEN_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSTAT;               /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSTAT_b;
  } ;

  union {
    __IOM uint32_t REGACCINTCLR;                /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTCLR_b;
  } ;

  union {
    __IOM uint32_t REGACCINTSET;                /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t REGACC     : 32;           /*!< Register access interrupts.                                               */
    } REGACCINTSET_b;
  } ;
} IOSLAVEFD0_Type;                              /*!< Size = 544 (0x220)                                                        */



/* =========================================================================================================================== */
/* ================                                          MCUCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Miscellaneous Control Logic (MCUCTRL)
  */

typedef struct {                                /*!< MCUCTRL Structure                                                         */

  union {
    __IOM uint32_t CHIPPN;                      /*!< Chip Information                                                          */

    struct {
      __IOM uint32_t RSVD       : 1;            /*!< This field is reserved.                                                   */
      __IOM uint32_t TEMP       : 2;            /*!< Temperature.                                                              */
      __IOM uint32_t PINS       : 3;            /*!< Number of pins for this package.                                          */
      __IOM uint32_t PKG        : 2;            /*!< Package type.                                                             */
      __IOM uint32_t REVMIN     : 4;            /*!< Minor revision.                                                           */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major revision. Please use the CHIPREV register for device identification. */
      __IOM uint32_t SRAMSIZE   : 4;            /*!< SRAM size. Please use the SKU register for determining memory
                                                     sizing.                                                                   */
      __IOM uint32_t MRAMSIZE   : 3;            /*!< MRAM size. Please use the SKU register for determining memory
                                                     sizing.                                                                   */
      __IOM uint32_t DEVTYPE    : 1;            /*!< Device type                                                               */
      __IOM uint32_t PN         : 8;            /*!< Apollo family device type.                                                */
    } CHIPPN_b;
  } ;

  union {
    __IOM uint32_t CHIPID0;                     /*!< Unique Chip ID 0                                                          */

    struct {
      __IOM uint32_t CHIPID0    : 32;           /*!< Unique chip ID 0. For APOLLO CHIPID0 value is 0x0                         */
    } CHIPID0_b;
  } ;

  union {
    __IOM uint32_t CHIPID1;                     /*!< Unique Chip ID 1                                                          */

    struct {
      __IOM uint32_t CHIPID1    : 32;           /*!< Unique chip ID 1. For APOLLO CHIPID1 value is 0x0                         */
    } CHIPID1_b;
  } ;

  union {
    __IOM uint32_t CHIPREV;                     /*!< Chip Revision                                                             */

    struct {
      __IOM uint32_t REVMIN     : 4;            /*!< Minor Revision ID.                                                        */
      __IOM uint32_t REVMAJ     : 4;            /*!< Major Revision ID.                                                        */
      __IOM uint32_t SIPART     : 12;           /*!< Silicon Part ID                                                           */
            uint32_t            : 12;
    } CHIPREV_b;
  } ;

  union {
    __IOM uint32_t VENDORID;                    /*!< Unique Vendor ID                                                          */

    struct {
      __IOM uint32_t VENDORID   : 32;           /*!< Unique Vendor ID                                                          */
    } VENDORID_b;
  } ;

  union {
    __IOM uint32_t SKU;                         /*!< Unique Chip SKU                                                           */

    struct {
      __IOM uint32_t SKUSRAMSIZE : 1;           /*!< SRAM SKU dictates the available memory for MCU. All of the System
                                                     SRAM (1.7MB) available by default.                                        */
            uint32_t            : 1;
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< MRAM size SKU. All of 2MB Available by default.                           */
      __IOM uint32_t SKUDISP    : 1;            /*!< Display Controller SKU Setting                                            */
      __IOM uint32_t SKUTURBOSPOT : 2;          /*!< High performance mode for MCU and DSPs.                                   */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< MIPI DSI SKU Setting.                                                     */
      __IOM uint32_t SKUGFX     : 1;            /*!< GFX available                                                             */
      __IOM uint32_t SKUUSB     : 1;            /*!< USB available                                                             */
      __IOM uint32_t SKUSECURESPOT : 1;         /*!< Secure boot feature                                                       */
      __IOM uint32_t SKURADIODISABLE : 1;       /*!< Radio disabled.                                                           */
      __IOM uint32_t SKURADIOBTBLE : 1;         /*!< Radio is enabled with BT+BLE Multimode                                    */
      __IOM uint32_t SKURADIOMM : 1;            /*!< Radio is enabled with BLE or BLE+802.15.4                                 */
            uint32_t            : 1;
      __IOM uint32_t SKUDTCM    : 4;            /*!< DTCM size.                                                                */
      __IOM uint32_t SKUFPU     : 1;            /*!< FPU feature                                                               */
      __IOM uint32_t SKUMVE     : 2;            /*!< MVE feature                                                               */
      __IOM uint32_t SKUCM4DEBUG : 1;           /*!< Selects control of the CM4 DEBUG features.                                */
            uint32_t            : 9;
    } SKU_b;
  } ;

  union {
    __IOM uint32_t SKUOVERRIDE;                 /*!< Override register for Chip SKU                                            */

