AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SKUSRAMSIZE : 1;           /*!< Override for sram size sku                                                */
            uint32_t            : 1;
      __IOM uint32_t SKUMRAMSIZE : 2;           /*!< Override for mram size sku                                                */
      __IOM uint32_t SKUDISP    : 1;            /*!< Override for DISP sku                                                     */
      __IOM uint32_t SKUTURBOSPOT : 2;          /*!< Override for turbo spot sku                                               */
      __IOM uint32_t SKUMIPIDSI : 1;            /*!< Override for mipi dsi sku. NOTE: SKUMIPIDSI == 1 and SKUDISP
                                                     == 0 is NOT a valid configuration. SKUMIPIDSI=1 must be
                                                     followed by SKUDISP=1                                                     */
      __IOM uint32_t SKUGFX     : 1;            /*!< Override for gfx sku                                                      */
      __IOM uint32_t SKUUSB     : 1;            /*!< Override for usb sku                                                      */
      __IOM uint32_t SKURADIODISABLE : 1;       /*!< Override for radio disable sku                                            */
      __IOM uint32_t SKURADIOBTBLE : 1;         /*!< Override for radio BT+BLE only sku                                        */
      __IOM uint32_t SKURADIOBLE : 1;           /*!< Override for radio BLE or BLE+802.15.4 sku                                */
            uint32_t            : 2;
      __IOM uint32_t CFGDTCMSZ  : 4;            /*!< DTCM size feature (only 2 DTCM configurations are allowed: 0x8
                                                     - 128K, 0x9 - 256K)                                                       */
      __IOM uint32_t CFGFPU     : 1;            /*!< FPU feature                                                               */
      __IOM uint32_t CFGMVE     : 2;            /*!< MVE feature                                                               */
      __IOM uint32_t SKUCM4DEBUG : 1;           /*!< Selects between AMBIQ CM4 DEBUG vs Runtime Debug                          */
            uint32_t            : 9;
    } SKUOVERRIDE_b;
  } ;
  __IM  uint32_t  RESERVED;

  union {
    __IOM uint32_t DEBUGGER;                    /*!< Debugger Control                                                          */

    struct {
      __IOM uint32_t LOCKOUT    : 32;           /*!< Lockout of debugger (SWD).                                                */
    } DEBUGGER_b;
  } ;
  __IM  uint32_t  RESERVED1;

  union {
    __IOM uint32_t ACRG;                        /*!< Active Current Reference Generator Control                                */

    struct {
      __IOM uint32_t ACRGSWE    : 1;            /*!< Software enablement for ACRG register. A value of 1 will allow
                                                     writes to the register                                                    */
      __IOM uint32_t ACRGPWD    : 1;            /*!< Power down the ACRG.                                                      */
      __IOM uint32_t ACRGIBIASSEL : 1;          /*!< Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must
                                                     be set for this to take effect. The inversion of this register
                                                     is driven to analog.                                                      */
      __IOM uint32_t ACRGTRIM   : 5;            /*!< ACRG Trim value                                                           */
            uint32_t            : 24;
    } ACRG_b;
  } ;
  __IM  uint32_t  RESERVED2[6];

  union {
    __IOM uint32_t VREFGEN2;                    /*!< Voltage Reference Generator 2 Control                                     */

    struct {
      __IOM uint32_t TVRGCVREFTRIM : 7;         /*!< Calibrated Voltage Reference Generator tc trim (bottom transistor)        */
      __IOM uint32_t TVRGCTEMPCOTRIM : 5;       /*!< TVRGC tempcompensation trim init value                                    */
      __IOM uint32_t TVRGCSELVREF : 1;          /*!< TVRGC sel vref init value                                                 */
      __IOM uint32_t TVRGCPDNB  : 1;            /*!< TVRGC pdnb init value                                                     */
      __IOM uint32_t TVRGCHSENRESDIV : 1;       /*!< TVRGC hsenable resdiv init value                                          */
      __IOM uint32_t TVRGCCURRENTTRIM : 1;      /*!< TVRGC Current trim init value                                             */
      __IOM uint32_t TVRGCREFBOOST : 1;         /*!< Enables voltage boost of TVRGC.                                           */
      __IOM uint32_t TVRGCBODTRIM : 2;          /*!< Brown-out detect trim for VDDC ; brown-out circuit takes reference
                                                     from TVRGC.                                                               */
            uint32_t            : 13;
    } VREFGEN2_b;
  } ;

  union {
    __IOM uint32_t VREFGEN3;                    /*!< Voltage Reference Generator 3 Control                                     */

    struct {
      __IOM uint32_t TVRGCLVVREFTRIM : 7;       /*!< TVRGCLV Voltage Reference Generator trim (bottom transistor)              */
      __IOM uint32_t TVRGCLVTEMPCOTRIM : 5;     /*!< TVRGCLV tempco trim init value                                            */
      __IOM uint32_t TVRGCLVSELVREF : 1;        /*!< TVRGCLV sel vref init value                                               */
      __IOM uint32_t TVRGCLVPDNB : 1;           /*!< TVRGCLV pdnb init value                                                   */
      __IOM uint32_t TVRGCLVHSENRESDIV : 1;     /*!< TVRGCLV hsenable resdiv init value                                        */
      __IOM uint32_t TVRGCLVCURRENTTRIM : 1;    /*!< TVRGCLV Current trim init value                                           */
      __IOM uint32_t TVRGCLVREFBOOST : 1;       /*!< Enables voltage boost of TVRGCLV.                                         */
      __IOM uint32_t TVRGCLVBODTRIM : 2;        /*!< Brown-out detect trim for VDDCLV ; brown-out circuit takes reference
                                                     from TVRGCLV.                                                             */
            uint32_t            : 13;
    } VREFGEN3_b;
  } ;

  union {
    __IOM uint32_t VREFGEN4;                    /*!< Voltage Reference Generator 4 Control                                     */

