AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t TVRGFVREFTRIM : 7;         /*!< TVRGF Voltage Reference Generator trim (bottom transistor)                */
      __IOM uint32_t TVRGFTEMPCOTRIM : 5;       /*!< TVRGF tempo trim init value                                               */
            uint32_t            : 1;
      __IOM uint32_t TVRGFPWLTEMPCOTRIM : 5;    /*!< Calibrated Voltage Reference Generator pwl tc trim (bottom transistor)    */
      __IOM uint32_t TVRGFPDNB  : 1;            /*!< TVRGF pdnb init value                                                     */
      __IOM uint32_t TVRGFHSENRESDIV : 1;       /*!< TVRGF hsenable resdiv init value                                          */
      __IOM uint32_t TVRGFCURRENTTRIM : 1;      /*!< TVRGF Current trim init value                                             */
      __IOM uint32_t TVRGFPWLGAINADJ : 1;       /*!< Adjust the gain of the piece-wise linear (PWL) circuit for TVRGF.         */
      __IOM uint32_t TVRGFBODTRIM : 2;          /*!< Brown-out detect trim for VDDF ; brown-out circuit takes reference
                                                     from TVRGF.                                                               */
      __IOM uint32_t TVRGFSELVREF : 2;          /*!< TVRGF sel vref init value                                                 */
            uint32_t            : 6;
    } VREFGEN4_b;
  } ;

  union {
    __IOM uint32_t VREFGEN5;                    /*!< Voltage Reference Generator 5 Control                                     */

    struct {
      __IOM uint32_t TVRGSVREFTRIM : 7;         /*!< TVRGS Voltage Reference Generator trim (bottom transistor)                */
      __IOM uint32_t TVRGSTEMPCOTRIM : 5;       /*!< TVRGS tempo trim init value                                               */
      __IOM uint32_t TVRGSSELVREF : 1;          /*!< TVRGS sel vref init value                                                 */
      __IOM uint32_t TVRGSPWLTEMPCOTRIM : 5;    /*!< Calibrated Voltage Reference Generator pwl tc trim (bottom transistor)    */
      __IOM uint32_t TVRGSPDNB  : 1;            /*!< TVRGS pdnb init value                                                     */
      __IOM uint32_t TVRGSHSENRESDIV : 1;       /*!< TVRGS hsenable resdiv init value                                          */
      __IOM uint32_t TVRGSCURRENTTRIM : 1;      /*!< TVRGS Current trim init value                                             */
      __IOM uint32_t TVRGSPWLGAINADJ : 1;       /*!< Adjust the gain of the piece-wise linear (PWL) circuit for TVRGS.         */
      __IOM uint32_t TVRGSBODTRIM : 2;          /*!< Brown-out detect trim for VDDS ; brown-out circuit takes reference
                                                     from TVRGS.                                                               */
            uint32_t            : 8;
    } VREFGEN5_b;
  } ;

  union {
    __IOM uint32_t VREFBUF;                     /*!< Voltage Reference BUF Control                                             */

    struct {
      __IOM uint32_t VREFBUFVOLTTRIM : 6;       /*!< VREFBUF voltage trim init value                                           */
      __IOM uint32_t VREFBUFPDNB : 1;           /*!< VREGBUF pdnb init value                                                   */
      __IOM uint32_t VREFBUFMISCTRIM : 6;       /*!< VREFBUF MISC trim init value                                              */
      __IOM uint32_t VREFBUFIBIASTRIM : 1;      /*!< VREFBUFIBIAS trim init value                                              */
      __IOM uint32_t VREFBUFCCOMPTRIM : 3;      /*!< VREFBUF ccomp trim init value                                             */
            uint32_t            : 15;
    } VREFBUF_b;
  } ;
  __IM  uint32_t  RESERVED3[2];

  union {
    __IOM uint32_t VRCTRL;                      /*!< Overrides for Voltage Regulators Controls                                 */

    struct {
      __IOM uint32_t CORELDOOVER : 1;           /*!< Override control for CORE LDO signals                                     */
      __IOM uint32_t CORELDOPDNB : 1;           /*!< CORE LDO PDNB control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOACTIVEEARLY : 1;    /*!< CORE LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when CORELDOOVER = 1                                               */
      __IOM uint32_t CORELDOACTIVE : 1;         /*!< CORE LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when CORELDOOVER = 1                                                      */
      __IOM uint32_t CORELDOCOLDSTARTEN : 1;    /*!< CORE LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set CORELDOOVER.                                           */
      __IOM uint32_t MEMLDOOVER : 1;            /*!< Override control for MEM LDO signals                                      */
      __IOM uint32_t MEMLDOPDNB : 1;            /*!< MEM LDO PDNB control. Override signal for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOACTIVEEARLY : 1;     /*!< MEM LDO EARLY ACTIVE control. Override for PWRCTRL going to
                                                     analog when MEMLDOOVER = 1                                                */
      __IOM uint32_t MEMLDOACTIVE : 1;          /*!< MEM LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when MEMLDOOVER = 1                                                       */
      __IOM uint32_t MEMLDOCOLDSTARTEN : 1;     /*!< MEM LDO COLDSTART EN control. This is a shadow backed register
                                                     and no need to set MEMLDOOVER.                                            */
      __IOM uint32_t MEMLDOTVRGFCVRGSEL : 2;    /*!< Selects the input reference for MEMLDO.                                   */
            uint32_t            : 1;
      __IOM uint32_t ANALDOOVER : 1;            /*!< Override control for ANALDO signals                                       */
      __IOM uint32_t ANALDOPDNB : 1;            /*!< ANALDO PDNB control. Override for PWRCTRL going to analog when
                                                     ANALDOOVER = 1                                                            */
      __IOM uint32_t ANALDOACTIVE : 1;          /*!< ANALDO LDO ACTIVE control. Override for PWRCTRL going to analog
                                                     when ANALDOOVER = 1                                                       */
      __IOM uint32_t SIMOBUCKOVER : 1;          /*!< Override control for SIMO BUCK signals                                    */
      __IOM uint32_t SIMOBUCKPDNB : 1;          /*!< SIMO BUCK PDNB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKRSTB : 1;          /*!< SIMO BUCK RSTB control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
      __IOM uint32_t SIMOBUCKACTIVE : 1;        /*!< SIMO BUCK ACTIVE control. Override for PWRCTRL going to analog
                                                     when SIMOBUCKOVER = 1                                                     */
            uint32_t            : 12;
    } VRCTRL_b;
  } ;
  __IM  uint32_t  RESERVED4[7];

  union {
    __IOM uint32_t LDOREG1;                     /*!< CORELDO trims Reg                                                         */

