AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SCRATCH0   : 32;           /*!< Scratch register 0.                                                       */
    } SCRATCH0_b;
  } ;

  union {
    __IOM uint32_t SCRATCH1;                    /*!< This register reserved for Ambiq INTERNAL use only. Do not modify.        */

    struct {
      __IOM uint32_t SCRATCH1   : 32;           /*!< Scratch register 1.                                                       */
    } SCRATCH1_b;
  } ;
  __IM  uint32_t  RESERVED15[14];

  union {
    __IOM uint32_t DBGR1;                       /*!< Read-only debug 1                                                         */

    struct {
      __IOM uint32_t ONETO8     : 32;           /*!< Read-only register for communication validation                           */
    } DBGR1_b;
  } ;

  union {
    __IOM uint32_t DBGR2;                       /*!< Read-only debug 2                                                         */

    struct {
      __IOM uint32_t COOLCODE   : 32;           /*!< Read-only register for communication validation                           */
    } DBGR2_b;
  } ;
  __IM  uint32_t  RESERVED16[5];

  union {
    __IOM uint32_t WICCONTROL;                  /*!< This register is responsible for WIC Control and Configuration            */

    struct {
      __IOM uint32_t DEEPISWIC  : 1;            /*!< Indicates SLEEPDEEP is WIC SLEEP or Normal SLEEP                          */
            uint32_t            : 31;
    } WICCONTROL_b;
  } ;
  __IM  uint32_t  RESERVED17[12];

  union {
    __IOM uint32_t DBGCTRL;                     /*!< Debug subsystem Control. Determines the debug components enable
                                                     and clk frequency.                                                        */

    struct {
      __IOM uint32_t DBGTPIUTRACEENABLE : 1;    /*!< TPIU TRACE Enable field. When set, the Cayenne TPIU is enabled
                                                     and data can be streamed out trace data from ARM ITM and
                                                     ETM modules through TRACEDATA ports                                       */
      __IOM uint32_t DBGTPIUCLKSEL : 3;         /*!< This field selects the frequency of the ARM TPIU port.                    */
      __IOM uint32_t TPIUBUSY   : 1;            /*!< CM55 TPIUBUSY status.                                                     */
      __IOM uint32_t PWRDBGQACTIVE : 1;         /*!< CM55 PWRDBGQACTIVE status.                                                */
            uint32_t            : 2;
      __IOM uint32_t DBGETBENABLE : 1;          /*!< ETB NOT AVAILABLE. THIS BIT HAS NO FUNCTIONAL IMPLICATION.                */
            uint32_t            : 3;
      __IOM uint32_t DBGTSCLKSEL : 3;           /*!< This field selects the frequency of the ARM M4 dbg ts port.               */
            uint32_t            : 17;
    } DBGCTRL_b;
  } ;
  __IM  uint32_t  RESERVED18[4];

  union {
    __IOM uint32_t OTAPOINTER;                  /*!< OTA (Over the Air) Update Pointer/Status. Reset only by POA               */

    struct {
      __IOM uint32_t OTAVALID   : 1;            /*!< Indicates that an OTA update is valid                                     */
      __IOM uint32_t OTASBRUPDATE : 1;          /*!< This field must be 1 for SBR or 0 for SBL.                                */
      __IOM uint32_t OTASBR     : 1;            /*!< This bit (ignored in the 32-bit OTA address) indicates operation
                                                     as indicated by the following enums.                                      */
      __IOM uint32_t OTAPOINTER : 29;           /*!< This register has different function depending on SBR or SBL.
                                                     For SBR update, this register contains the address of the
                                                     OTA image. For SBL update, this register points to the
                                                     OTA Descriptor, which must be in MRAM. Since the low 3
                                                     bits have special meaning and are masked (see enums below),
                                                     the pointer is required to be on an 8-byte boundary.                      */
    } OTAPOINTER_b;
  } ;
  __IM  uint32_t  RESERVED19[6];

  union {
    __IOM uint32_t APBDMACTRL;                  /*!< DMA Control Register. Determines misc settings for DMA operation          */

    struct {
      __IOM uint32_t DMAENABLE  : 1;            /*!< Enable the DMA controller. When disabled, DMA requests will
                                                     be ignored by the controller                                              */
      __IOM uint32_t DECODEABORT : 1;           /*!< APB Decode Abort. When set, the APB bridge will issue a data
                                                     abort (bus fault) on transactions to peripherals that are
                                                     powered down. When set to 0, writes are quietly discarded
                                                     and reads return 0.                                                       */
            uint32_t            : 6;
      __IOM uint32_t HYSTERESIS : 8;            /*!< This field determines how long the DMA engine of apb/disp/gfx
                                                     will remain active during deep sleep before shutting down
                                                     and returning the system to full deep sleep. Values are
                                                     based on a 94KHz clock and are roughly 10us increments
                                                     for a range of ~10us to 2.55ms                                            */
            uint32_t            : 16;
    } APBDMACTRL_b;
  } ;

  union {
    __IOM uint32_t FORCEAXICLKEN;               /*!< Force AXI Clock Enabled                                                   */

