AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FRCAXICLKEN : 1;           /*!< This bit will override the AXI fabric clock enable logic to
                                                     force it on.                                                              */
      __IOM uint32_t FRCAXICGCLKEN : 1;         /*!< This bit will override the AXI fabric local clock gaters enable
                                                     logic to force them on.                                                   */
      __IOM uint32_t FRCCM55SAHBCGCLKEN : 1;    /*!< This bit will override the AXI fabric sahb port clock gater
                                                     enable logic to force them on.                                            */
      __IOM uint32_t FRCAPBDMACGCLKEN : 1;      /*!< This bit will override the APBDMA local clock gaters enable
                                                     logic to force them on.                                                   */
            uint32_t            : 28;
    } FORCEAXICLKEN_b;
  } ;
  __IM  uint32_t  RESERVED20[44];

  union {
    __IOM uint32_t KEXTCLKSEL;                  /*!< Locks the state of the EXTCLKSEL register from writes. This
                                                     is done to prevent errant writes to the register, as this
                                                     could cause the chip to halt. Write a value of 0x53 to
                                                     unlock write access to the EXTCLKSEL register. Once unlocked,
                                                     the register will read back a 1 to undicate this is unlocked.
                                                     Writing the register with any other value other than 0x53
                                                     will enable the lock.                                                     */

    struct {
      __IOM uint32_t KEXTCLKSEL : 32;           /*!< Key register value.                                                       */
    } KEXTCLKSEL_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK0;                   /*!< This register allows for enabling/disabling simobuck rails via
                                                     *comp_en signals. CCM (continuous-current mode) operation
                                                     can be enabled/disabled here. Analog primary switch trim
                                                     bits are also in this register. These fields should be
                                                     set before enabling simobuck, except for ccm_en which can
                                                     be dynamically enabled/disabled.                                          */

    struct {
      __IOM uint32_t VDDCRXCOMPEN : 1;          /*!< Enable the VDDC rail.                                                     */
      __IOM uint32_t VDDFRXCOMPEN : 1;          /*!< Enable the VDDF rail.                                                     */
      __IOM uint32_t VDDSRXCOMPEN : 1;          /*!< Enable the VDDS rail.                                                     */
      __IOM uint32_t VDDCLVRXCOMPEN : 1;        /*!< Enable the VDDC LV rail.                                                  */
      __IOM uint32_t VDDRFRXCOMPEN : 1;         /*!< Enable the VDDRF rail.                                                    */
      __IOM uint32_t CCMEN      : 1;            /*!< Enable CCM in simobuck.                                                   */
      __IOM uint32_t DEEPSLEEPCCMEN : 1;        /*!< Allow simobuck CCM operation in deepsleep.                                */
      __IOM uint32_t PMOSDRVSTRTRIM : 4;        /*!< Trim bits to increase drive-strength of PMOS switch in primary
                                                     switch. THERMOMETER coding.                                               */
      __IOM uint32_t NMOSDRVSTRTRIM : 4;        /*!< Trim bits to increase drive-strength of NMOS switch in primary
                                                     switch. THERMOMETER coding.                                               */
      __IOM uint32_t TPNDELAYTRIM : 2;          /*!< Decreases non-overlap delay when switching from pmos to nmos
                                                     switch (code 3 is min non-overlap).                                       */
      __IOM uint32_t TNPDELAYTRIM : 2;          /*!< Decreases non-overlap delay when switching from NMOS to PMOS
                                                     switch (code 3 is min non-overlap).                                       */
      __IOM uint32_t TRIMCHANGEDLYPOST : 2;     /*!< Delay used on the trims valid assertion after trims are changed.          */
      __IOM uint32_t TRIMCHANGEDLYPRE : 2;      /*!< Delay used on the trims valid de-assertion before trims are
                                                     changed.                                                                  */
      __IOM uint32_t SIMOBUCKHPTRIMEN : 1;      /*!< Enable the simobuck HP mode trim                                          */
            uint32_t            : 8;
    } SIMOBUCK0_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK1;                   /*!< 1. All control signals that affect SIMOBUCK clocking. Simobuck
                                                     supports 2 sources for its high-speed (TONCLK) clock --
                                                     HFRC and local oscillator. Simobuck supports 3 sources
                                                     for its medium-speed (RX) clock -- HFRC, local oscillator,
                                                     and LFRC.                                                                 */

    struct {
      __IOM uint32_t RXCLKLOCALDIVSEL : 3;      /*!< Divide the simobuck internal local oscillator. Nominal osc freq
                                                     is 14MHz. Supports even divide ratios: 0,2,4,8,16,32,64,128.              */
      __IOM uint32_t RXCLKHFRCDIVSEL : 3;       /*!< Divide the HFRC TONCLK input to simoubuck to create RX CLK derived
                                                     from HFRC. Supports even/odd divide ratios in between [3,10].             */
      __IOM uint32_t RXCLKALLOWUSEHFRC : 1;     /*!< Allow simobuck to use the HFRC clock as RX clock in active operation
                                                     after startup.                                                            */
      __IOM uint32_t RXCLKFORCEUSEHFRC : 1;     /*!< Force RX CLK to use HFRC-based clock.                                     */
      __IOM uint32_t RXCLKDEEPSLEEPTOACTDELAY : 3;/*!< Sets delay in number of charge cycles before RX CLK (and subsequently
                                                     TON CLK) switch to using HFRC-based clock instead of local
                                                     oscillator.                                                               */
      __IOM uint32_t RXCLKFORCEUSELOCALCLK : 1; /*!< Force RX CLK to use the local oscillator as its clock source.             */
      __IOM uint32_t RXCLKLOCALCLKENFORCE : 1;  /*!< Force RX local oscillator to be enabled.                                  */
      __IOM uint32_t RXCLKMUXFORCEEN : 1;       /*!< Enable forcing RX CLK output mux to be enabled.                           */
      __IOM uint32_t RXCLKMUXFORCESEL : 1;      /*!< IF RXCLKMUXFORCEEN==1, this bit is select signal of output mux
                                                     for RX CLK. 0 --> HFRC OR local oscillator (high-speed).
                                                     1 --> LFRC (low-speed).                                                   */
      __IOM uint32_t TONCLKFORCEUSEHFRC : 1;    /*!< Force TON CLK to use HFRC-based clock.                                    */
      __IOM uint32_t TONCLKFORCEUSELOCALCLK : 1;/*!< Force TON CLK to use local oscillator.                                    */
      __IOM uint32_t TONCLKLOCALCLKENFORCE : 1; /*!< Forces the local oscillator for TON CLK to be enabled.                    */
      __IOM uint32_t TONCLKLOCALFREQTRIM : 2;   /*!< Trim the local TON oscillator frequency. Higher code gives higher
                                                     frequency.                                                                */
      __IOM uint32_t SIMOBUCKHFRCPWRDNOVREN : 1;/*!< Override Enable bit to override the SIMOBUCK control that allows
                                                     HFRC to be powered down when SIMOBUCK is in LP state.                     */
      __IOM uint32_t SIMOBUCKHFRCPWRDNOVRVAL : 1;/*!< Override value. Ensure SIMOBUCKHFRCPWRDNOVREN is set.                    */
            uint32_t            : 10;
    } SIMOBUCK1_b;
  } ;

  union {
    __IOM uint32_t SIMOBUCK2;                   /*!< Low Voltage (LV) (VDDH LE 2.2V) TON Trims for VDDF and VDDS.              */

