AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SRAMRPROT2 : 32;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
    } SRAMRPROT2_b;
  } ;

  union {
    __IOM uint32_t SRAMRPROT3;                  /*!< These bits read-protect system SRAM from non-cpu access in 16KB
                                                     chunks.                                                                   */

    struct {
      __IOM uint32_t SRAMRPROT3 : 16;           /*!< Read protect SRAM from non-cpu access. Each bit provides write
                                                     protection for an 16KB region of memory. When set to 1,
                                                     the region will be protected from non-cpu reads, when set
                                                     to 0, DMA may read the region.                                            */
            uint32_t            : 16;
    } SRAMRPROT3_b;
  } ;
  __IM  uint32_t  RESERVED26[21];

  union {
    __IOM uint32_t SDIO0CTRL;                   /*!< SDIO0/eMMC Control                                                        */

    struct {
      __IOM uint32_t SDIO0SYSCLKEN : 1;         /*!< SDIO0 system clock enable.                                                */
      __IOM uint32_t SDIO0XINCLKEN : 1;         /*!< SDIO0 serial clock source enable.                                         */
      __IOM uint32_t SDIO0ITAPCHGWIN : 1;       /*!< This is used to gate the output of the Tap Delay lines so as
                                                     to avoid glithches being propagated into the Core. This
                                                     signal should be asserted few clocks before the itapdlysel
                                                     changes and should be asserted for few clocks after.                      */
      __IOM uint32_t SDIO0ITAPDLYENA : 1;       /*!< Used to enable selective Tap delay line on the Looped back SD
                                                     Clock (rxclk_in). This signal along with the itapdlysel[4:0]
                                                     selects the the amount of delay to be inserted on the line.
                                                     When Tuning is enabled (for SDR104 and optionally for SDR50),
                                                     this signal is ignored and internalcontrols are used instead.
                                                     This should not be asserted when operating in DS mode.                    */
      __IOM uint32_t SDIO0ITAPDLYSEL : 5;       /*!< Selects one of the 32 Taps on the rxclk_in line. This is effective
                                                     only when itapdlyena is asserted and Tuning is not enabled.               */
      __IOM uint32_t SDIO0OTAPDLYENA : 1;       /*!< Used to enable the selective Tap delay on the sdcard_clk so
                                                     as to generate the delayed sdcard_clk. This is used to
                                                     latch the CMD/DAT outputs to generate delay on them w.r.t
                                                     CLK going out. This signal along with otapdlysel[3:0] selects
                                                     the amount of delay to be inserted on the Clock line. This
                                                     signal should not be asserted when operating in DS mode.                  */
      __IOM uint32_t SDIO0OTAPDLYSEL : 4;       /*!< Selects one of the 16 Taps on the sdcard_clk. This is effective
                                                     only when otapdlyena is asserted.                                         */
      __IOM uint32_t SDIO0ASYNCWKUPENA : 1;     /*!< SDIO0 asynchronous wakeup mode. 0: Synchronous wakeup mode,
                                                     1: Asynchronous wakeup mode                                               */
      __IOM uint32_t SDIO0XINCLKSEL : 2;        /*!< Select clock source for SDIO0 xin_clk.                                    */
      __IOM uint32_t SDIO0CMDOPENDRAINEN : 1;   /*!< SDIO0 CMD line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
      __IOM uint32_t SDIO0DATOPENDRAINEN : 1;   /*!< SDIO0 DAT line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
            uint32_t            : 13;
    } SDIO0CTRL_b;
  } ;

  union {
    __IOM uint32_t SDIO1CTRL;                   /*!< SDIO1/eMMC Control                                                        */

    struct {
      __IOM uint32_t SDIO1SYSCLKEN : 1;         /*!< SDIO1 system clock enable.                                                */
      __IOM uint32_t SDIO1XINCLKEN : 1;         /*!< SDIO1 serial clock source enable.                                         */
      __IOM uint32_t SDIO1ITAPCHGWIN : 1;       /*!< This is used to gate the output of the Tap Delay lines so as
                                                     to avoid glithches being propagated into the Core. This
                                                     signal should be asserted few clocks before the itapdlysel
                                                     changes and should be asserted for few clocks after.                      */
      __IOM uint32_t SDIO1ITAPDLYENA : 1;       /*!< Used to enable selective Tap delay line on the Looped back SD
                                                     Clock (rxclk_in). This signal along with the itapdlysel[4:0]
                                                     selects the the amount of delay to be inserted on the line.
                                                     When Tuning is enabled (for SDR104 and optionally for SDR50),
                                                     this signal is ignored and internalcontrols are used instead.
                                                     This should not be asserted when operating in DS mode.                    */
      __IOM uint32_t SDIO1ITAPDLYSEL : 5;       /*!< Selects one of the 32 Taps on the rxclk_in line. This is effective
                                                     only when itapdlyena is asserted and Tuning is not enabled.               */
      __IOM uint32_t SDIO1OTAPDLYENA : 1;       /*!< Used to enable the selective Tap delay on the sdcard_clk so
                                                     as to generate the delayed sdcard_clk. This is used to
                                                     latch the CMD/DAT outputs to generate delay on them w.r.t
                                                     CLK going out. This signal along with otapdlysel[3:0] selects
                                                     the amount of delay to be inserted on the Clock line. This
                                                     signal should not be asserted when operating in DS mode.                  */
      __IOM uint32_t SDIO1OTAPDLYSEL : 4;       /*!< Selects one of the 16 Taps on the sdcard_clk. This is effective
                                                     only when otapdlyena is asserted.                                         */
      __IOM uint32_t SDIO1ASYNCWKUPENA : 1;     /*!< SDIO1 asynchronous wakeup mode. 0: Synchronous wakeup mode,
                                                     1: Asynchronous wakeup mode                                               */
      __IOM uint32_t SDIO1XINCLKSEL : 2;        /*!< Select clock source for SDIO1 xin_clk.                                    */
      __IOM uint32_t SDIO1CMDOPENDRAINEN : 1;   /*!< SDIO1 CMD line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
      __IOM uint32_t SDIO1DATOPENDRAINEN : 1;   /*!< SDIO1 DAT line configured as open-drian. 0: Push-pull mode,
                                                     1: Open-drain mode                                                        */
            uint32_t            : 13;
    } SDIO1CTRL_b;
  } ;

  union {
    __IOM uint32_t PDMCTRL;                     /*!< PDM Control                                                               */

