AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t PDMGLOBALEN : 1;           /*!< PDM global enable to allow all PDMs to have synchronized interface
                                                     clocks and FIFO sampling.                                                 */
            uint32_t            : 31;
    } PDMCTRL_b;
  } ;
  __IM  uint32_t  RESERVED27[16];

  union {
    __IOM uint32_t DSIBIST;                     /*!< DPHY BIST register for the Analog testing                                 */

    struct {
      __IOM uint32_t DSIBISTLP  : 1;            /*!< To enable the BIST this bit (dln_loop_back in hardware) needs
                                                     to be set to 1. This signal internally asserts the clock
                                                     for the BIST modules.                                                     */
      __IOM uint32_t DSIBISTFORCEERR : 1;       /*!< bist_force_error in hardware                                              */
      __IOM uint32_t DSIBISTMODE : 2;           /*!< {bist_en_esc_lp, bist_en_esc_hs} in hardware.                             */
            uint32_t            : 4;
      __IOM uint32_t DSIBISTSEED : 8;           /*!< bist_seed in hardware                                                     */
            uint32_t            : 11;
      __IOM uint32_t DSIBISTERRRXHSSYNC : 1;    /*!< Indicates the sync error conditions in HS mode.                           */
      __IOM uint32_t DSIBISTERRRXHS : 1;        /*!< Indicates the normal error conditions in HS mode.                         */
      __IOM uint32_t DSIBISTERRRXESCSYNC : 1;   /*!< Indicates the sync error conditions in LP mode.                           */
      __IOM uint32_t DSIBISTERRRXESC : 1;       /*!< Indicates the normal error conditions in LP mode. Also indicates
                                                     the RxClkEsc mode error.                                                  */
      __IOM uint32_t DSIBISTDONE : 1;           /*!< Status of the BIST engine, indicates the completion as well
                                                     as error conditions.                                                      */
    } DSIBIST_b;
  } ;

  union {
    __IOM uint32_t SSRAMMISCCTRL;               /*!< SRAM PWR Check for Different Masters                                      */

    struct {
      __IOM uint32_t GFXSRAMCHK : 1;            /*!< Control bit for the sram power domain checking in GFX.                    */
      __IOM uint32_t DISPSRAMCHK : 1;           /*!< Control bit for the sram power domain checking in DC.                     */
      __IOM uint32_t CM4SRAMCHK : 1;            /*!< Control bit for the sram power domain checking in CM4                     */
            uint32_t            : 29;
    } SSRAMMISCCTRL_b;
  } ;
  __IM  uint32_t  RESERVED28[2];

  union {
    __IOM uint32_t DISPSTATUS;                  /*!< Status for display subsystem                                              */

    struct {
      __IOM uint32_t DSISTATUS  : 3;            /*!< Indicates the stop state of DSI lanes. bit0: clock lane, bit1:
                                                     data lane 0, bit2: data lane 1                                            */
            uint32_t            : 29;
    } DISPSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED29[6];

  union {
    __IOM uint32_t CPUCFG;                      /*!< CPU config                                                                */

    struct {
      __IOM uint32_t INITTCMDIS : 2;            /*!< INIT TCM disable                                                          */
      __IOM uint32_t INITPAHBDIS : 1;           /*!< InitPAHB disable                                                          */
      __IOM uint32_t INITL1RSTDIS : 1;          /*!< Init L1 reset diable                                                      */
      __IOM uint32_t CFGNSSTCALIB : 26;         /*!< CFGNSST calib value                                                       */
            uint32_t            : 2;
    } CPUCFG_b;
  } ;
  __IM  uint32_t  RESERVED30[2];

  union {
    __IOM uint32_t PLLCTL0;                     /*!< This register controls power down and enable for various features
                                                     of the system PLL                                                         */

    struct {
      __IOM uint32_t FOUTVCOPD  : 1;            /*!< System PLL VCO rate output clock power down, connected to PLL
                                                     pin FOUTVCOPD                                                             */
      __IOM uint32_t FOUTPOSTDIVPD : 1;         /*!< System PLL post divider power down, connected to PLL pin FOUTPOSTDIVPD.
                                                     Must enable when using 4-phase outputs                                    */
      __IOM uint32_t FOUT4PHASEPD : 1;          /*!< System PLL 4-phase clock generator power down, connected to
                                                     PLL pin FOUT4PHASEPD                                                      */
      __IOM uint32_t DSMPD      : 1;            /*!< System PLL DSM (delta-sigma modulator) power down, connected
                                                     to PLL pin DSMPD                                                          */
      __IOM uint32_t DACPD      : 1;            /*!< System PLL noise canceling DAC power down, connected to PLL
                                                     pin DACPD                                                                 */
      __IOM uint32_t FREFSEL    : 2;            /*!< System PLL reference clock select, connected to PLL pin FREF              */
            uint32_t            : 1;
      __IOM uint32_t BYPASS     : 1;            /*!< System PLL bypass, connected to PLL pin BYPASS                            */
      __IOM uint32_t VCOSELECT  : 1;            /*!< System PLL VCO range select, connected to PLL pin VCOSEL                  */
            uint32_t            : 19;
      __IOM uint32_t SYSPLLPDB  : 1;            /*!< System PLL enable. When the PLL is enabled, SW must ensure that
                                                     the PLL receives adequate current by forcing the LDO to
                                                     be in active mode:SIMOBUCKACTIVE = 1 (in BUCK mode)MEMLDOACTIVE
                                                     = 1 (in LDO mode).                                                        */
      __IOM uint32_t SYSPLLVDDHPDN : 1;         /*!< System PLL VDDH power down                                                */
      __IOM uint32_t SYSPLLVDDFPDN : 1;         /*!< System PLL VDDF power down                                                */
    } PLLCTL0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV0;                     /*!< This register sets the fractional portion of the feedback divider
                                                     when the system PLL is in fractional mode. Refer to the
                                                     PLLTS22ULPHVLPFRACA datasheet for more details                            */

