AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t FRAC       : 24;           /*!< System PLL feedback divide value (fractional portion), connected
                                                     to PLL pin FRAC[23:0]. Do not change FRAC while the clock
                                                     is in use as it can make the clock unstable. First disable
                                                     the clock, change FRAC, and then enable the clock. Default
                                                     Value of 0x6AAAAB indicates 250MHz output                                 */
            uint32_t            : 8;
    } PLLDIV0_b;
  } ;

  union {
    __IOM uint32_t PLLDIV1;                     /*!< This register sets the integer portion of the feedback divider
                                                     along with the other dividers in the system PLL. Refer
                                                     to the PLLTS22ULPHVLPFRACA datasheet for more details                     */

    struct {
      __IOM uint32_t REFDIV     : 6;            /*!< System PLL reference divide value, connnected to PLL pin REFDIV[5:0].
                                                     Valid range is 1 to 63. A setting of 0 will send 1 to the
                                                     PLL                                                                       */
            uint32_t            : 2;
      __IOM uint32_t POSTDIV2   : 3;            /*!< System PLL post divide 2 setting, connected to PLL pin POSTDIV2[2:0].
                                                     Valid range is 1 to 7. A setting of 0 will send 1 to the
                                                     PLL. Total post divide is POSTDIV1*POSTDIV2. The value
                                                     of POSTDIV1 should be maximized before enabling POSTDIV2.                 */
            uint32_t            : 1;
      __IOM uint32_t POSTDIV1   : 3;            /*!< System PLL post divide 1 setting, connected to PLL pin POSTDIV1[2:0].
                                                     Valid range is 1 to 7. A setting of 0 will send 1 to the
                                                     PLL. Total post divide is POSTDIV1*POSTDIV2                               */
            uint32_t            : 1;
      __IOM uint32_t FBDIV      : 12;           /*!< System PLL feedback divide value, connected to PLL pin FBDIV[11:0].
                                                     Valid range is 10 to 960 in integer mode, 10 to 96 in fractional
                                                     mode. Do not change FBDIV while the clock is in use as
                                                     it can make the clock unstable. First disable the clock,
                                                     change FBDIV, and then enable the clock                                   */
            uint32_t            : 4;
    } PLLDIV1_b;
  } ;

  union {
    __IOM uint32_t PLLSTAT;                     /*!< This register indicates the system PLL status                             */

    struct {
      __IOM uint32_t LOCK       : 1;            /*!< System PLL lock signal, connected to PLL pin LOCK. Indicates
                                                     no cycle slip between the feedback clock and FPFD for 128
                                                     consecutive cycles                                                        */
            uint32_t            : 31;
    } PLLSTAT_b;
  } ;

  union {
    __IOM uint32_t PLLMUXCTL;                   /*!< This register selects clock sources for the clocks that may
                                                     be driven by the system PLL                                               */

    struct {
      __IOM uint32_t PDMPLLCLKSEL : 2;          /*!< PDM PLL clock select                                                      */
      __IOM uint32_t USBPLLCLKSEL : 1;          /*!< USB PLL clock select                                                      */
      __IOM uint32_t I2S0PLLCLKSEL : 2;         /*!< I2S0 PLL clock select                                                     */
            uint32_t            : 27;
    } PLLMUXCTL_b;
  } ;
  __IM  uint32_t  RESERVED31;

  union {
    __IOM uint32_t CM4CODEBASE;                 /*!< NVM lowest addrss CM4 can access                                          */

    struct {
            uint32_t            : 4;
      __IOM uint32_t CM4CODEBASE : 28;          /*!< CM4 code base address in nvm address space, can be set from
                                                     0x40000to 0x5FFFF(2MB),16Bytes align                                      */
    } CM4CODEBASE_b;
  } ;

  union {
    __IOM uint32_t RADIOFINECNT;                /*!< This register indicates the fine counter current value                    */

    struct {
      __IOM uint32_t FINECNT    : 10;           /*!< Radio Fine counter current value                                          */
            uint32_t            : 22;
    } RADIOFINECNT_b;
  } ;

  union {
    __IOM uint32_t RADIOCLKNCNT;                /*!< This register indicates the CLKN counter current value                    */

    struct {
      __IOM uint32_t CLKNCNT    : 28;           /*!< Radio CLKN counter current value                                          */
            uint32_t            : 4;
    } RADIOCLKNCNT_b;
  } ;
} MCUCTRL_Type;                                 /*!< Size = 1276 (0x4fc)                                                       */



/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Multi-bit SPI Master (MSPI0)
  */

typedef struct {                                /*!< MSPI0 Structure                                                           */

  union {
    __IOM uint32_t CTRL;                        /*!< This register is used to enable individual PIO based transactions
                                                     to a device on the bus. The CFG register must be programmed
                                                     properly for the transfer, and the ADDR and INSTR registers
                                                     should be programmed if the SENDI and SENDA fields are
                                                     enabled.                                                                  */

