AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t START      : 1;            /*!< Write to 1 to initiate a PIO transaction on the bus (typically
                                                     the entire register should be written at once with this
                                                     bit set).                                                                 */
      __IOM uint32_t STATUS     : 1;            /*!< Command status: 1 indicates command has completed. Cleared by
                                                     writing 1 to this bit or starting a new transfer.                         */
      __IOM uint32_t BUSY       : 1;            /*!< Command status: 1 indicates controller is busy (command in progress)      */
      __IOM uint32_t CONT       : 1;            /*!< Continuation transfer. When 1, indicates that the MSPI will
                                                     hold CE low after the transaction completes. This is included
                                                     for compatibility with IOM module since the MSPI transfer
                                                     module can handle most cases in a single transfer. NOTE:
                                                     CONT functionality only works with CLKDIV=2 (24 MHz).                     */
      __IOM uint32_t PIODEV     : 1;            /*!< Selects the Device configutation to use for PIO requests                  */
      __IOM uint32_t SENDA      : 1;            /*!< Indicates whether an address phase should be sent (see ADDR
                                                     register and ASIZE field in CFG register)                                 */
      __IOM uint32_t SENDI      : 1;            /*!< Indicates whether an instruction phase should be sent (see INSTR
                                                     field and ISIZE field in CFG register)                                    */
      __IOM uint32_t TXRX       : 1;            /*!< 1 Indicates a TX operation, 0 indicates an RX operation of XFERBYTES      */
      __IOM uint32_t BIGENDIAN  : 1;            /*!< 1 indicates data in FIFO is in big endian format (MSB first);
                                                     0 indicates little endian data (default, LSB first).                      */
      __IOM uint32_t PIOSCRAMBLE : 1;           /*!< Enables data scrambling for PIO opertions. This should only
                                                     be used for data operations and never for commands to a
                                                     device.                                                                   */
      __IOM uint32_t ENTURN     : 1;            /*!< Indicates whether TX->RX turnaround cycles should be enabled
                                                     for this operation (see TURNAROUND field in CFG register).                */
      __IOM uint32_t ENDCX      : 1;            /*!< Enable DCX signal on data [1]                                             */
      __IOM uint32_t ENWLAT     : 1;            /*!< Enable Write Latency Counter (time between address and first
                                                     data byte). Counter value is WRITELATENCY.                                */
      __IOM uint32_t HALFWORDREVERSE : 1;       /*!< Reverse bytes in half-word. Little endian data: {[7:0],[15:8],[23:16],[31:24]}
                                                     -> {[15:8],[7:0],[31:24],[23:16]}; big endian data: {[31:24],[23:16],[15:
                                                     ],[7:0]} -> {[23:16],[31:24],[7:0],[15:8]}                                */
            uint32_t            : 2;
      __IOM uint32_t XFERBYTES  : 16;           /*!< Number of bytes to transmit or receive (based on TXRX bit)                */
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t CTRL1;                       /*!< These registers are used to enable individual PIO based transactions
                                                     to a device on the bus. The CFG register must be programmed
                                                     properly for the transfer, and the ADDR and INSTR registers
                                                     should be programmed if the SENDI and SENDA fields are
                                                     enabled.                                                                  */

    struct {
      __IOM uint32_t PIOMIXED   : 4;            /*!< Provides override controls for data operations where instruction,
                                                     address, and data may transfer in different rates.                        */
            uint32_t            : 28;
    } CTRL1_b;
  } ;

  union {
    __IOM uint32_t ADDR;                        /*!< Optional Address field to send for PIO transfers                          */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Optional Address field to send (after optional instruction field)
                                                     - qualified by ASIZE in CMD register. NOTE: This register
                                                     is aliased to DMADEVADDR.                                                 */
    } ADDR_b;
  } ;

  union {
    __IOM uint32_t INSTR;                       /*!< Optional Instruction field to send for PIO transfers                      */

    struct {
      __IOM uint32_t INSTR      : 16;           /*!< Optional Instruction field to send (1st byte) - qualified by
                                                     ISEND/ISIZE                                                               */
            uint32_t            : 16;
    } INSTR_b;
  } ;

  union {
    __IOM uint32_t TXFIFO;                      /*!< TX Data FIFO                                                              */

    struct {
      __IOM uint32_t TXFIFO     : 32;           /*!< Data to be transmitted. Data should normally be aligned to the
                                                     LSB (pad the upper bits with zeros) unless BIGENDIAN is
                                                     set.                                                                      */
    } TXFIFO_b;
  } ;

  union {
    __IOM uint32_t RXFIFO;                      /*!< RX Data FIFO                                                              */

