AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t DMAEN      : 2;            /*!< DMA Enable. Setting this bit to EN will start the DMA operation           */
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
      __IOM uint32_t DMADEV     : 1;            /*!< DMA Device Select                                                         */
      __IOM uint32_t DMAPRI     : 2;            /*!< Sets the Priority of the DMA request                                      */
            uint32_t            : 11;
      __IOM uint32_t DMATXEMPT  : 1;            /*!< For DMA_M2P, only start when DMA fifo is not empty.                       */
      __IOM uint32_t DMAPWROFF  : 1;            /*!< Power off MSPI domain upon completion of DMA operation.                   */
            uint32_t            : 13;
    } DMACFG_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress indicator. 1 will indicate that a DMA
                                                     transfer is active. The DMA transfer may be waiting on
                                                     data, transferring data, or waiting for priority. All of
                                                     these will be indicated with a 1. A 0 will indicate that
                                                     the DMA is fully complete and no further transactions will
                                                     be done.                                                                  */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete. This signals the end of the DMA operation.         */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error. This active high bit signals that an error was encountered
                                                     during the DMA operation.                                                 */
      __IOM uint32_t SCRERR     : 1;            /*!< Scrambling Access Alignment Error. This active high bit signals
                                                     that a scrambling operation was specified for a non-word
                                                     aligned DEVADDR.                                                          */
            uint32_t            : 28;
    } DMASTAT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t TARGADDR   : 32;           /*!< Target byte address for source of DMA (either read or write).
                                                     In cases of non-word aligned addresses, the DMA logic will
                                                     take care for ensuring only the target bytes are read/written.            */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMADEVADDR;                  /*!< DMA Device Address                                                        */

    struct {
      __IOM uint32_t DEVADDR    : 32;           /*!< SPI Device address for automated DMA transactions (both read
                                                     and write).                                                               */
    } DMADEVADDR_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
      __IOM uint32_t TOTCOUNT   : 24;           /*!< Total Transfer Count in bytes.                                            */
            uint32_t            : 8;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMABCOUNT;                   /*!< DMA BYTE Transfer Count                                                   */

    struct {
      __IOM uint32_t BCOUNT     : 8;            /*!< Burst transfer size in bytes. This is the number of bytes transferred
                                                     when a FIFO trigger event occurs. Recommended value is
                                                     32.                                                                       */
            uint32_t            : 24;
    } DMABCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATHRESH;                   /*!< Indicates FIFO level at which a DMA should be triggered. For
                                                     most configurations, a setting of 8 is recommended for
                                                     both read and write operations.                                           */

    struct {
      __IOM uint32_t DMATXTHRESH : 5;           /*!< DMA transfer FIFO level trigger. For read operations, DMA is
                                                     triggered when the FIFO level is greater than this value.
                                                     For write operations, DMA is triggered when the FIFO level
                                                     is less than this level. Each DMA operation will consist
                                                     of BCOUNT bytes.                                                          */
            uint32_t            : 3;
      __IOM uint32_t DMARXTHRESH : 5;           /*!< DMA transfer FIFO level trigger. For read operations, DMA is
                                                     triggered when the FIFO level is greater than this value.
                                                     For write operations, DMA is triggered when the FIFO level
                                                     is less than this level. Each DMA operation will consist
                                                     of BCOUNT bytes. This value should not be set more than
                                                     ALTRXFIFOFULL.                                                            */
            uint32_t            : 19;
    } DMATHRESH_b;
  } ;
  __IM  uint32_t  RESERVED4[57];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

