AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CQENDIDX   : 8;            /*!< Can be used to indicate the end position of the command queue.
                                                     A CQ hardware status bit indices when CURIDX != ENDIDX
                                                     so that the CQ can be paused when it reaches the end pointer.             */
            uint32_t            : 24;
    } CQENDIDX_b;
  } ;
} MSPI0_Type;                                   /*!< Size = 712 (0x2c8)                                                        */



/* =========================================================================================================================== */
/* ================                                            OTP                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief OTP Controller (OTP)
  */

typedef struct {                                /*!< OTP Structure                                                             */
  __IM  uint32_t  RESERVED[168];

  union {
    __IOM uint32_t RNG;                         /*!< RNG Data                                                                  */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< Provides high-quality random number bits (32 bits each time)
                                                     for security usage.                                                       */
    } RNG_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t INTERRUPT;                   /*!< OTP Controller interrupt enable and status.                               */

    struct {
      __IOM uint32_t PWRSUPPLY  : 1;            /*!< Problem with power supply.                                                */
      __IOM uint32_t OUTDATA    : 1;            /*!< Conflict with output data.                                                */
      __IOM uint32_t PARITYINPUT : 1;           /*!< Input parity check failure.                                               */
      __IOM uint32_t SHIELDFAULT : 1;           /*!< Metal shielding fault.                                                    */
      __IOM uint32_t ACCESSPERMISSION : 1;      /*!< Access permission error.                                                  */
      __IOM uint32_t PARITYPSM  : 1;            /*!< Parity error of the FSM.                                                  */
      __IOM uint32_t PARITYCRITREG : 1;         /*!< Parity error of critical reg.                                             */
            uint32_t            : 1;
      __IOM uint32_t RNGFAIL    : 1;            /*!< RNG health check failure.                                                 */
      __IOM uint32_t RNGCLKOFF  : 1;            /*!< RNG internal clock is turned off.                                         */
            uint32_t            : 6;
      __IOM uint32_t IEPWRSUPPLY : 1;           /*!< Enable PWRSUPPLY interrupts.                                              */
      __IOM uint32_t IEOUTDATA  : 1;            /*!< Enable OUTDATA interrupts.                                                */
      __IOM uint32_t IEPARITYINPUT : 1;         /*!< Enable PARITYINPUT interrupts.                                            */
      __IOM uint32_t IESHIELFFAULT : 1;         /*!< Enable SHIELDFAULT interrupts.                                            */
      __IOM uint32_t IEACCESSPERMISSION : 1;    /*!< Enable ACCESSPERMISSION interrupts.                                       */
      __IOM uint32_t IEPARITYPSM : 1;           /*!< Enable PARITYPSM interrupts.                                              */
      __IOM uint32_t IEPARITYCRITREG : 1;       /*!< Enable PARITYCRITREG interrupts.                                          */
            uint32_t            : 1;
      __IOM uint32_t IERNGFAIL  : 1;            /*!< Enable RNGFAIL interrupts.                                                */
      __IOM uint32_t IERNGCLKOFF : 1;           /*!< Enable RNGCLKOFF interrupts.                                              */
            uint32_t            : 6;
    } INTERRUPT_b;
  } ;
  __IM  uint32_t  RESERVED2[4];

  union {
    __IOM uint32_t PTMSTAT;                     /*!< OTP Controller Status                                                     */

    struct {
      __IOM uint32_t BUSY       : 1;            /*!< Controller Busy.                                                          */
      __IOM uint32_t PTM_ERROR  : 1;            /*!< PTM Error.                                                                */
      __IOM uint32_t WARNING    : 1;            /*!< PTM is re-run or not initialized                                          */
      __IOM uint32_t INCORRECT  : 1;            /*!< PTM data is not correctly set                                             */
      __IOM uint32_t FORBID     : 1;            /*!< PTM locked                                                                */
            uint32_t            : 3;
      __IOM uint32_t FAILCNT    : 4;            /*!< Number of failed OTP cells                                                */
            uint32_t            : 20;
    } PTMSTAT_b;
  } ;
  __IM  uint32_t  RESERVED3[14];

  union {
    __IOM uint32_t PUFUID;                      /*!< Word 0 of Static PUF UID                                                  */

    struct {
      __IOM uint32_t DATA       : 32;           /*!< Word 0 of Static UID                                                      */
    } PUFUID_b;
  } ;
} OTP_Type;                                     /*!< Size = 772 (0x304)                                                        */



/* =========================================================================================================================== */
/* ================                                           PDM0                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief PDM Audio (PDM0)
  */

typedef struct {                                /*!< PDM0 Structure                                                            */

  union {
    __IOM uint32_t CTRL;                        /*!< PDM Control                                                               */

