AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
            uint32_t            : 4;
      __IOM uint32_t RSTB       : 1;            /*!< Reset IP core. 0 puts the core in reset; 1 takes the core out
                                                     of reset.                                                                 */
      __IOM uint32_t PCMPACK    : 1;            /*!< Enable PCM packing. Only 24-bit unpacked mode supported.                  */
      __IOM uint32_t EN         : 1;            /*!< PDM enable register                                                       */
      __IOM uint32_t CLKGATEMODE : 1;           /*!< Clock gating mode. 0 = clock always enabled when DMA is enabled.
                                                     1 = clock is enabled when there is actual DMA transfer                    */
      __IOM uint32_t I2SMASTERMODE : 1;         /*!< i2s master mode enable.                                                   */
      __IOM uint32_t I2SNUMBCLKSINHALFWDCLK : 1;/*!< 0 for 32 cycels, 1 for 48cycles.                                          */
            uint32_t            : 22;
    } CTRL_b;
  } ;

  union {
    __IOM uint32_t CORECFG0;                    /*!< PDM to PCM Core Configuration                                             */

    struct {
      __IOM uint32_t LRSWAP     : 1;            /*!< Left/Right channel swap when = 1                                          */
      __IOM uint32_t SOFTMUTE   : 1;            /*!< Soft mute enable when = 1                                                 */
      __IOM uint32_t SCYCLES    : 3;            /*!< Set number of PDMA_CKO cycles during gain setting changes or
                                                     soft mute                                                                 */
      __IOM uint32_t HPGAIN     : 4;            /*!< Adjust High Pass filter coefficients                                      */
      __IOM uint32_t ADCHPD     : 1;            /*!< Disable high pass filter when = 1                                         */
      __IOM uint32_t MCLKDIV    : 5;            /*!< PDMA_CKO frequency divisor.MCLKDIV >= 0FMCLKQ = FHMCLKA / (MCLKDIV
                                                     + 1)                                                                      */
      __IOM uint32_t SINCRATE   : 7;            /*!< Synchronous decimation rate.SINC_RATE = OSR /2. OSR = Fsin /
                                                     Fsout.Even values between 16 and 64 allowed.                              */
      __IOM uint32_t PGAL       : 5;            /*!< Left Channel PGA Gain: +1.5dB/step, -12dB ~ +34.5dB;enum name
                                                     = M12_0DB value = 0x0 desc = Left channel PGA gain = -12.0
                                                     dB                                                                        */
      __IOM uint32_t PGAR       : 5;            /*!< Right Channel PGA Gain:+1.5dB/step, -12dB ~ +34.5dB;                      */
    } CORECFG0_b;
  } ;

  union {
    __IOM uint32_t CORECFG1;                    /*!< PDM to PCM Extra Configuration                                            */

    struct {
      __IOM uint32_t PCMCHSET   : 2;            /*!< PCM output chanel 0xsetting                                               */
      __IOM uint32_t DIVMCLKQ   : 2;            /*!< Divide down ratio for generating internal master MCLKQ.DIVMCLKQ
                                                     > 0. DIVMCLKQ = 0 PROHIBITED.Recommend value of 1.Fmclkq
                                                     = Fpdmclk/(DIVMCLKQ+1).                                                   */
      __IOM uint32_t CKODLY     : 3;            /*!< PDMA_CKO clock phase delay in terms of PDMCLK period to internal
                                                     sampler                                                                   */
      __IOM uint32_t SELSTEP    : 1;            /*!< Fine grain step size for smooth PGA or Softmute attenuation
                                                     transition0: 0.13dB1: 0.26dB                                              */
      __IOM uint32_t CASES      : 4;            /*!< PDMA_CKO clock phase delay in terms of PDMCLK period to internal
                                                     sampler                                                                   */
            uint32_t            : 1;
      __IOM uint32_t HPON       : 1;            /*!< Select LP or HP Mode Operation, Active High                               */
      __IOM uint32_t I2SON      : 1;            /*!< Enalbe/disable I2S Interface.                                             */
      __IOM uint32_t PCMON      : 1;            /*!< Enable PCMA_DATA_L/R and PCMA_VALID, 0 = Disabled or Gated,
                                                     1 = Enabled or Pass-Through to SOC.                                       */
      __IOM uint32_t SET0       : 16;           /*!< Keep Default Values, LP Mode Operation                                    */
    } CORECFG1_b;
  } ;

  union {
    __IOM uint32_t CORECTRL;                    /*!< PDM to PCM Control                                                        */

    struct {
      __IOM uint32_t CORECTRL   : 32;           /*!< Overall control of PDM core. Internal use only                            */
    } CORECTRL_b;
  } ;

  union {
    __IOM uint32_t FIFOCNT;                     /*!< FIFO count                                                                */

    struct {
      __IOM uint32_t FIFOCNT    : 6;            /*!< Valid 32-bit entries currently in the FIFO.                               */
            uint32_t            : 26;
    } FIFOCNT_b;
  } ;

  union {
    __IOM uint32_t FIFOREAD;                    /*!< FIFO Read                                                                 */

    struct {
      __IOM uint32_t FIFOREAD   : 32;           /*!< FIFO read data.                                                           */
    } FIFOREAD_b;
  } ;

  union {
    __IOM uint32_t FIFOFLUSH;                   /*!< FIFO Flush                                                                */

