AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t DMAEN      : 1;            /*!< DMA Enable                                                                */
            uint32_t            : 1;
      __IOM uint32_t DMADIR     : 1;            /*!< Direction                                                                 */
            uint32_t            : 5;
      __IOM uint32_t DMAPRI     : 1;            /*!< Sets the Priority of the DMA request                                      */
      __IOM uint32_t DAUTOHIP   : 1;            /*!< Raise priority to high on fifo full, and DMAPRI set to low                */
      __IOM uint32_t DPWROFF    : 1;            /*!< Power Off the ADC System upon DMACPL.                                     */
      __IOM uint32_t NEXTDMAEN  : 1;            /*!< Next DMA Request Feature Enable. When set, SW shall not program
                                                     TOTCOUNT and TARGADDR. Instead, SW shall program TOTCOUNTNEXT
                                                     and TARGADDRNEXT, and load them into HW DMA request pipeline
                                                     using DMAENNEXT bit.                                                      */
      __IOM uint32_t DMAPACKED  : 1;            /*!< PACKED two 16bits data to 32bits data for DMA.                            */
            uint32_t            : 19;
    } DMACFG_b;
  } ;
  __IM  uint32_t  RESERVED2;

  union {
    __IOM uint32_t DMATOTCOUNT;                 /*!< DMA Total Transfer Count                                                  */

    struct {
      __IOM uint32_t TOTCOUNT   : 20;           /*!< Total Transfer Count. The transfer count must be a multiple
                                                     of the THR setting to avoid DMA overruns.                                 */
            uint32_t            : 12;
    } DMATOTCOUNT_b;
  } ;

  union {
    __IOM uint32_t DMATARGADDR;                 /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t LTARGADDR  : 32;           /*!< DMA Target Address. This register is not updated with the current
                                                     address of the DMA, but will remain static with the original
                                                     address during the DMA transfer.                                          */
    } DMATARGADDR_b;
  } ;

  union {
    __IOM uint32_t DMASTAT;                     /*!< DMA Status                                                                */

    struct {
      __IOM uint32_t DMATIP     : 1;            /*!< DMA Transfer In Progress, set by HW, write 1 to clear                     */
      __IOM uint32_t DMACPL     : 1;            /*!< DMA Transfer Complete                                                     */
      __IOM uint32_t DMAERR     : 1;            /*!< DMA Error, set by HW, write 1 to clear                                    */
            uint32_t            : 29;
    } DMASTAT_b;
  } ;
  __IM  uint32_t  RESERVED3;

  union {
    __IOM uint32_t DMATARGADDRNEXT;             /*!< DMA Target Address                                                        */

    struct {
      __IOM uint32_t TARGADDRNEXT : 32;         /*!< Next DMA Target Address. This register is not updated with the
                                                     current address of the DMA, but will remain static with
                                                     the original address during the DMA transfer.                             */
    } DMATARGADDRNEXT_b;
  } ;

  union {
    __IOM uint32_t DMATOTCOUNTNEXT;             /*!< Next DMA Total Count                                                      */

    struct {
      __IOM uint32_t TOTCOUNTNEXT : 20;         /*!< Next Total Transfer Count.                                                */
            uint32_t            : 12;
    } DMATOTCOUNTNEXT_b;
  } ;

  union {
    __IOM uint32_t DMAENNEXTCTRL;               /*!< Enable Next DMA Job                                                       */

    struct {
      __IOM uint32_t DMAENNEXT  : 1;            /*!< SW set this bit after setting up TOTCOUNTNEXT and TARGADDRNEXT
                                                     register fields. HW will then auto-load TOTCOUNTNEXT and
                                                     TARGADDRNEXT values when its current DMA job completes,
                                                     and auto-clear this DMAENNEXT bit. SW can then reload a
                                                     new DMA job with new TOTCOUNTNEXT and TARGADDRNEXT values.                */
            uint32_t            : 31;
    } DMAENNEXTCTRL_b;
  } ;
} PDM0_Type;                                    /*!< Size = 364 (0x16c)                                                        */



/* =========================================================================================================================== */
/* ================                                          PWRCTRL                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief PWR Controller Register Bank (PWRCTRL)
  */

typedef struct {                                /*!< PWRCTRL Structure                                                         */

  union {
    __IOM uint32_t MCUPERFREQ;                  /*!< This register provides the performance mode knobs for MCU. S/w
                                                     should write the *PERFREQ field to desired mode and wait
                                                     for the *PERFACK and check for the *PERFSTATUS. Some times
                                                     system may not allow certain modes but *PERFACK should
                                                     always follow *PERFREQ change.                                            */

