AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t MCUPERFREQ : 2;            /*!< MCU Performance mode request                                              */
      __IOM uint32_t MCUPERFACK : 1;            /*!< Indicates the MCU performance status indicated in STATUS register
                                                     is valid.                                                                 */
      __IOM uint32_t MCUPERFSTATUS : 2;         /*!< MCU Performance mode request                                              */
      __IOM uint32_t WAITFORHP2 : 1;            /*!< This bit decides if the CPU will enter HP1 (192MHz clock) and
                                                     wait until PLL_LOCK is asserted and then switch to HP2
                                                     (245-250MHz) state OR bypass HP1 and directly enter HP2
                                                     state once PLL_LOCK is asserted. This bit is only valid
                                                     if the CPU was requested to enter into HP2 mode by setting
                                                     the MCUPERFREQ to 0x3.                                                    */
            uint32_t            : 23;
      __IOM uint32_t PWRENMCUE  : 1;            /*!< Powerup MCUE power domain                                                 */
      __IOM uint32_t PWRSTMCUE  : 2;            /*!< Power Status MCUE subsystem                                               */
    } MCUPERFREQ_b;
  } ;

  union {
    __IOM uint32_t DEVPWREN;                    /*!< This enables various peripherals power domains.                           */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PWRENIOM0  : 1;            /*!< Power up IO Master 0                                                      */
      __IOM uint32_t PWRENIOM1  : 1;            /*!< Power up IO Master 1                                                      */
      __IOM uint32_t PWRENIOM2  : 1;            /*!< Power up IO Master 2                                                      */
      __IOM uint32_t PWRENIOM3  : 1;            /*!< Power up IO Master 3                                                      */
      __IOM uint32_t PWRENIOM4  : 1;            /*!< Power up IO Master 4                                                      */
      __IOM uint32_t PWRENIOM5  : 1;            /*!< Power up IO Master 5                                                      */
      __IOM uint32_t PWRENI3CPHY : 1;           /*!< Power up I3C PHY                                                          */
            uint32_t            : 1;
      __IOM uint32_t PWRENUART0 : 1;            /*!< Power up UART Controller 0                                                */
      __IOM uint32_t PWRENUART1 : 1;            /*!< Power up UART Controller 1                                                */
            uint32_t            : 2;
      __IOM uint32_t PWRENADC   : 1;            /*!< Power up ADC Digital Controller                                           */
      __IOM uint32_t PWRENMSPI0 : 1;            /*!< Power up MSPI Controller0                                                 */
      __IOM uint32_t PWRENMSPI1 : 1;            /*!< Power up MSPI Controller1                                                 */
      __IOM uint32_t PWRENMSPI2 : 1;            /*!< Power up MSPI Controller2                                                 */
            uint32_t            : 1;
      __IOM uint32_t PWRENGFX   : 1;            /*!< Power up GFX controller                                                   */
      __IOM uint32_t PWRENDISP  : 1;            /*!< Power up DISP controller                                                  */
      __IOM uint32_t PWRENDISPPHY : 1;          /*!< Power up DISP PHY                                                         */
      __IOM uint32_t PWRENCRYPTO : 1;           /*!< Power up CRYPTO module                                                    */
      __IOM uint32_t PWRENSDIO0 : 1;            /*!< Power up SDIO0 controller                                                 */
      __IOM uint32_t PWRENSDIO1 : 1;            /*!< Power up SDIO1 controller                                                 */
      __IOM uint32_t PWRENUSB   : 1;            /*!< Power up USB controller                                                   */
      __IOM uint32_t PWRENUSBPHY : 1;           /*!< Power up USB PHY                                                          */
      __IOM uint32_t PWRENDBG   : 1;            /*!< Powerup DBG power domain                                                  */
      __IOM uint32_t PWRENOTP   : 1;            /*!< Powerup OTP power domain                                                  */
      __IOM uint32_t PWRENIOSFD0 : 1;           /*!< Power up IO FD Slave 0                                                    */
      __IOM uint32_t PWRENIOSFD1 : 1;           /*!< Power up IO FD Slave 1                                                    */
      __IOM uint32_t PWRENI3C   : 1;            /*!< Power up I3C                                                              */
      __IOM uint32_t PWRENNETAOL : 1;           /*!< Power status NETAOL                                                       */
    } DEVPWREN_b;
  } ;

  union {
    __IOM uint32_t DEVPWRSTATUS;                /*!< This provides the power status for the peripheral device domains
                                                     controlled through DEVPWREN register. Value of 1 means
                                                     the device is powred up and ready to be used and 0 means
                                                     its not powered up.                                                       */

    struct {
            uint32_t            : 1;
      __IOM uint32_t PWRSTIOM0  : 1;            /*!< Power status IO Master 0                                                  */
      __IOM uint32_t PWRSTIOM1  : 1;            /*!< Power status IO Master 1                                                  */
      __IOM uint32_t PWRSTIOM2  : 1;            /*!< Power status IO Master 2                                                  */
      __IOM uint32_t PWRSTIOM3  : 1;            /*!< Power status IO Master 3                                                  */
      __IOM uint32_t PWRSTIOM4  : 1;            /*!< Power status IO Master 4                                                  */
      __IOM uint32_t PWRSTIOM5  : 1;            /*!< Power Status IO Master 5                                                  */
      __IOM uint32_t PWRSTI3CPHY : 1;           /*!< Power Status I3C PHY                                                      */
            uint32_t            : 1;
      __IOM uint32_t PWRSTUART0 : 1;            /*!< Power Status UART Controller 0                                            */
      __IOM uint32_t PWRSTUART1 : 1;            /*!< Power Status UART Controller 1                                            */
            uint32_t            : 2;
      __IOM uint32_t PWRSTADC   : 1;            /*!< Power Status ADC Digital Controller                                       */
      __IOM uint32_t PWRSTMSPI0 : 1;            /*!< Power Status MSPI Controller0                                             */
      __IOM uint32_t PWRSTMSPI1 : 1;            /*!< Power Status MSPI Controller1                                             */
      __IOM uint32_t PWRSTMSPI2 : 1;            /*!< Power Status MSPI Controller2                                             */
      __IOM uint32_t PWRSTPLL   : 1;            /*!< Power status PLL                                                          */
      __IOM uint32_t PWRSTGFX   : 1;            /*!< Power Status GFX controller                                               */
      __IOM uint32_t PWRSTDISP  : 1;            /*!< Power Status DISP controller                                              */
      __IOM uint32_t PWRSTDISPPHY : 1;          /*!< Power Status DISP PHY                                                     */
      __IOM uint32_t PWRSTCRYPTO : 1;           /*!< Power Status CRYPTO module                                                */
      __IOM uint32_t PWRSTSDIO0 : 1;            /*!< Power Status SDIO0 controller                                             */
      __IOM uint32_t PWRSTSDIO1 : 1;            /*!< Power Status SDIO1 controller                                             */
      __IOM uint32_t PWRSTUSB   : 1;            /*!< Power Status USB controller                                               */
      __IOM uint32_t PWRSTUSBPHY : 1;           /*!< Power Status USB PHY                                                      */
      __IOM uint32_t PWRSTDBG   : 1;            /*!< Power Status DBG subsystem                                                */
      __IOM uint32_t PWRSTOTP   : 1;            /*!< Power Status OTP                                                          */
      __IOM uint32_t PWRSTIOSFD0 : 1;           /*!< Power status IO FD Slave 0                                                */
      __IOM uint32_t PWRSTIOSFD1 : 1;           /*!< Power status IO FD Slave 1                                                */
      __IOM uint32_t PWRSTI3C   : 1;            /*!< Power status I3C                                                          */
      __IOM uint32_t PWRSTNETAOL : 1;           /*!< Power status NETAOL                                                       */
    } DEVPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t AUDSSPWREN;                  /*!< This enables various power domains in audio subsystem.                    */

