AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t PWRSTMCUL  : 1;            /*!< Power Domain status for MCUL                                              */
      __IOM uint32_t PWRSTMCUH  : 1;            /*!< Power Domain status for MCUH                                              */
            uint32_t            : 26;
      __IOM uint32_t SYSDEEPERSLEEP : 1;        /*!< Indicates all device domains powered down and MCU entered DEEPERSLEEP
                                                     state since it was last cleared. Write 1 to to clear it.                  */
      __IOM uint32_t CORESLEEP  : 1;            /*!< Indicates MCU entered SLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t COREDEEPSLEEP : 1;         /*!< Indicates MCU entered DEEPSLEEP state since it was last cleared.
                                                     Write 1 to to clear it.                                                   */
      __IOM uint32_t SYSDEEPSLEEP : 1;          /*!< Indicates all device domains powered down and MCU entered DEEPSLEEP
                                                     state since it was last cleared. Write 1 to to clear it.                  */
    } SYSPWRSTATUS_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWREN;                  /*!< This register enables the individual banks for the memories.
                                                     When set, power will be enabled to the banks. This register
                                                     works in conjunction with the SSRAMRETCFG register. If
                                                     this register is not set, then power will always be disabled
                                                     to the memory bank.                                                       */

    struct {
      __IOM uint32_t PWRENSSRAM : 2;            /*!< Power up SRAM groups                                                      */
            uint32_t            : 30;
    } SSRAMPWREN_b;
  } ;

  union {
    __IOM uint32_t SSRAMPWRST;                  /*!< It provides the power status for shared sram banks. The status
                                                     here should reflect the enable provided by the SSRAMPWREN
                                                     register.                                                                 */

    struct {
      __IOM uint32_t SSRAMPWRST : 2;            /*!< Each bit corresponds to one 1M SSRAM group. Power Status- 1:ON,
                                                     0:OFF See SSRAMPWREN PWRENSSRAM for bit mapping. For example,
                                                     a value of 2 in this field would mean that SSRAM1 is powered
                                                     up and SSRAM0 is powered down.                                            */
            uint32_t            : 30;
    } SSRAMPWRST_b;
  } ;

  union {
    __IOM uint32_t SSRAMRETCFG;                 /*!< This controls the power down of the Shared SRAM banks in deep
                                                     sleep mode. If this is set, then the power for that SRAM
                                                     bank will be gated when the core goes into deep sleep.
                                                     Upon wake, the data within the SRAMs will be erased. If
                                                     this is not set, retention voltage will be applied to the
                                                     SRAM bank when none of the CPU agents are in powered up
                                                     and active mode. Do not set this if the SRAM bank is used
                                                     as the target for DMA transfer while CPU in deepsleep.                    */

    struct {
      __IOM uint32_t SSRAMPWDSLP : 2;           /*!< Selects which shared SRAM banks are powered down in deep sleep
                                                     mode, causing the contents of the bank to be lost.                        */
      __IOM uint32_t SSRAMACTMCU : 2;           /*!< Keep the memory domain active based on MCU state. Each bit corresponds
                                                     to a domain. 1: Keep SRAM active 0: Wakeup on demand (i.e.
                                                     when MCU is powered up)                                                   */
      __IOM uint32_t SSRAMACTGFX : 2;           /*!< Keep the memory domain active based on GFX state. Each bit corresponds
                                                     to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e.
                                                     when GFX is powered up)                                                   */
      __IOM uint32_t SSRAMACTDISP : 2;          /*!< Keep the memory domain active based on DISP state. Each bit
                                                     corresponds to a domain. 1: Keep SRAM active 0: Powerup
                                                     on demand (i.e. when DISP is powered up)                                  */
            uint32_t            : 24;
    } SSRAMRETCFG_b;
  } ;

  union {
    __IOM uint32_t DEVPWREVENTEN;               /*!< This register controls which feature trigger will result in
                                                     an event to the CPU. It includes all the power on status
                                                     for the core domains. If any bits are set, then if the
                                                     domain is turned on, it will result in an event to the
                                                     ARM core.                                                                 */

    struct {
      __IOM uint32_t MCULEVEN   : 1;            /*!< Control MCUL power-on status event                                        */
      __IOM uint32_t MCUHEVEN   : 1;            /*!< Control MCUH power-on status event                                        */
      __IOM uint32_t HCPAEVEN   : 1;            /*!< Control HCPA power-on status event                                        */
      __IOM uint32_t HCPBEVEN   : 1;            /*!< Control HCPB power-on status event                                        */
      __IOM uint32_t HCPCEVEN   : 1;            /*!< Control HCPC power-on status event                                        */
      __IOM uint32_t ADCEVEN    : 1;            /*!< Control ADC power-on status event                                         */
            uint32_t            : 1;
      __IOM uint32_t AUDEVEN    : 1;            /*!< Control AUD power-on status event                                         */
      __IOM uint32_t MSPIEVEN   : 1;            /*!< Control MSPI power-on status event                                        */
      __IOM uint32_t MSPI1EVEN  : 1;            /*!< Control MSPI1 power-on status event                                       */
      __IOM uint32_t MSPI2EVEN  : 1;            /*!< Control MSPI2 power-on status event                                       */
            uint32_t            : 1;
      __IOM uint32_t PDMEVEN    : 1;            /*!< Control PDM power-on status event                                         */
            uint32_t            : 19;
    } DEVPWREVENTEN_b;
  } ;

  union {
    __IOM uint32_t MEMPWREVENTEN;               /*!< This register controls which power enable for the memories will
                                                     result in an event to the CPU. It includes all the power
                                                     on status for the memory domains. If any bits are set,
                                                     then if the domain is turned on, it will result in an event
                                                     to the ARM core.                                                          */

