AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CORELDOST  : 2;            /*!< Indicates CORELDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t MEMLDOST   : 2;            /*!< Indicates MEMLDO status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP.                                                         */
      __IOM uint32_t SIMOBUCKST : 2;            /*!< Indicates SIMO BUCK status. bit[1] indicates ON/OFF and bit[0]
                                                     indicates ACT/LP                                                          */
            uint32_t            : 26;
    } VRSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED6[33];

  union {
    __IOM uint32_t SRAMCTRL;                    /*!< This register provides additional fine-tune power management
                                                     controls for the SRAMs and the SRAM controller. This includes
                                                     enabling light sleep for the SRAM and TCM banks, and clock
                                                     gating for reduced dynamic power.                                         */

    struct {
            uint32_t            : 1;
      __IOM uint32_t SRAMCLKGATE : 1;           /*!< This bit is 1 if clock gating is allowed for individual system
                                                     SRAMs                                                                     */
      __IOM uint32_t SRAMMASTERCLKGATE : 1;     /*!< This bit is 1 when the master clock gate is enabled (top-level
                                                     clock gate for entire SRAM block)                                         */
            uint32_t            : 5;
      __IOM uint32_t SRAMLIGHTSLEEP : 24;       /*!< Light Sleep enable for each TCM/SRAM bank. When 1, corresponding
                                                     bank will be put into light sleep. For optimal power, banks
                                                     should be put into light sleep while the system is active
                                                     but the bank has minimal or no accesses.                                  */
    } SRAMCTRL_b;
  } ;

  union {
    __IOM uint32_t ADCSTATUS;                   /*!< This provides the power status for various blocks within the
                                                     ADC. These status comes directly from the ADC module and
                                                     is captured through this interface.                                       */

    struct {
      __IOM uint32_t ADCPWD     : 1;            /*!< This bit indicates that the ADC is powered down                           */
      __IOM uint32_t BGTPWD     : 1;            /*!< This bit indicates that the ADC Band Gap is powered down                  */
      __IOM uint32_t VPTATPWD   : 1;            /*!< This bit indicates that the ADC temperature sensor input buffer
                                                     is powered down                                                           */
      __IOM uint32_t VBATPWD    : 1;            /*!< This bit indicates that the ADC VBAT resistor divider is powered
                                                     down                                                                      */
      __IOM uint32_t REFKEEPPWD : 1;            /*!< This bit indicates that the ADC REFKEEP is powered down                   */
      __IOM uint32_t REFBUFPWD  : 1;            /*!< This bit indicates that the ADC REFBUF is powered down                    */
            uint32_t            : 26;
    } ADCSTATUS_b;
  } ;
  __IM  uint32_t  RESERVED7[12];

  union {
    __IOM uint32_t MRAMEXTCTRL;                 /*!< MRAM control register                                                     */

    struct {
      __IOM uint32_t MRAMTMCCLKGATDIS : 1;      /*!< disable last tmc_clk/tmc_clk_inv clock gate                               */
      __IOM uint32_t OTPAUTOWAKEUPCTRL : 1;     /*!< over write rst_auto_wk for TMC IP in otp boot mode; write to
                                                     0 before mram sleep exit to save wakeup time                              */
      __IOM uint32_t MRAMAUTOWAKEUPCTRL : 1;    /*!< over write rst_auto_wk for TMC IP in mram boot mode                       */
      __IOM uint32_t MRAMLPRDYNAMIC : 1;        /*!< bypass lpr dynamic mode                                                   */
            uint32_t            : 28;
    } MRAMEXTCTRL_b;
  } ;
  __IM  uint32_t  RESERVED8;

  union {
    __IOM uint32_t I3CISOCTRL;                  /*!< I3C PHY ISO control register                                              */

    struct {
      __IOM uint32_t I3CISOSEL  : 1;            /*!< If set, the isolation from I3C PHY VDDC signals to VDDIO domain
                                                     will be controlled by I3CISOEN bit. Otherwise, the auto
                                                     detection circuit in I3C PHY will auto isolate when VDDC
                                                     power is off.                                                             */
      __IOM uint32_t I3CISOEN   : 1;            /*!< This bit used only when I3CISOSEL is set. When I3CISOSEL is
                                                     1, I3CISOEN set will isolate I3C PHY VDDC signals to VDDIO
                                                     domain.                                                                   */
            uint32_t            : 30;
    } I3CISOCTRL_b;
  } ;
  __IM  uint32_t  RESERVED9[11];

  union {
    __IOM uint32_t EMONCTRL;                    /*!< Controls each of the energy monitor conuters                              */

    struct {
      __IOM uint32_t FREEZE     : 8;            /*!< Freeze the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run. 1: Stop the counter.                                     */
      __IOM uint32_t CLEAR      : 8;            /*!< Clear the counter. Each bit corresponds to a counter. 0: Let
                                                     the counter run run on its input clk. 1: Clear the counter                */
            uint32_t            : 16;
    } EMONCTRL_b;
  } ;

  union {
    __IOM uint32_t EMONCFG0;                    /*!< The counter increments when the counter is enabled and the mode
                                                     selected here matches the power mode.                                     */

