AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t EMONOVERFLOW0 : 1;         /*!< Energy Monitor counter0 overflow                                          */
      __IOM uint32_t EMONOVERFLOW1 : 1;         /*!< Energy Monitor counter1 overflow                                          */
      __IOM uint32_t EMONOVERFLOW2 : 1;         /*!< Energy Monitor counter2 overflow                                          */
      __IOM uint32_t EMONOVERFLOW3 : 1;         /*!< Energy Monitor counter3 overflow                                          */
      __IOM uint32_t EMONOVERFLOW4 : 1;         /*!< Energy Monitor counter4 overflow                                          */
      __IOM uint32_t EMONOVERFLOW5 : 1;         /*!< Energy Monitor counter5 overflow                                          */
      __IOM uint32_t EMONOVERFLOW6 : 1;         /*!< Energy Monitor counter6 overflow                                          */
      __IOM uint32_t EMONOVERFLOW7 : 1;         /*!< Energy Monitor counter7 overflow                                          */
            uint32_t            : 24;
    } EMONSTATUS_b;
  } ;
} PWRCTRL_Type;                                 /*!< Size = 592 (0x250)                                                        */



/* =========================================================================================================================== */
/* ================                                          RSTGEN                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief MCU Reset Generator (RSTGEN)
  */

typedef struct {                                /*!< RSTGEN Structure                                                          */

  union {
    __IOM uint32_t CFG;                         /*!< Reset configuration register. This controls the reset enables
                                                     for brownout condition, choice of brownout method and for
                                                     the expiration of the watch dog timer.                                    */

    struct {
      __IOM uint32_t BODHREN    : 1;            /*!< Brown out high (2.1v) reset enable.                                       */
      __IOM uint32_t WDREN      : 1;            /*!< Watchdog Timer Reset Enable. NOTE: The WDT module must also
                                                     be configured for WDT reset. This includes enabling the
                                                     RESEN bit in WDTCFG register in Watch dog timer block.                    */
      __IOM uint32_t SECUREWDREN : 1;           /*!< Secure Watchdog Timer Reset Enable. NOTE: The Secure WDT module
                                                     must also be configured for Secure WDT reset. This includes
                                                     enabling the RESEN bit in SECURE_WDTCFG register in Watch
                                                     dog timer block.                                                          */
            uint32_t            : 29;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t SWPOI;                       /*!< This is the software POI reset. writing the key value to this
                                                     register will trigger a POI to the system. This will cause
                                                     a reset to all blocks except for registers in clock gen,
                                                     RTC and the stimer.                                                       */

    struct {
      __IOM uint32_t SWPOIKEY   : 8;            /*!< 0x1B generates a software POI reset. This is a write-only register.
                                                     Reading from this register will yield only all 0s.                        */
            uint32_t            : 24;
    } SWPOI_b;
  } ;

  union {
    __IOM uint32_t SWPOR;                       /*!< This is the CM55 software POR reset. Writing the key value to
                                                     this register will trigger a POR to the system. This will
                                                     cause a reset to all blocks except for registers in clock
                                                     gen, RTC, power management unit, the stimer, and the power
                                                     management unit.                                                          */

    struct {
      __IOM uint32_t SWPORKEY   : 8;            /*!< 0xD4 generates a software POR reset.                                      */
            uint32_t            : 24;
    } SWPOR_b;
  } ;
  __IM  uint32_t  RESERVED[2];

  union {
    __IOM uint32_t SIMOBODM;                    /*!< This register unmasks the individual digital detection brownout
                                                     bits into the interrupt block                                             */

    struct {
      __IOM uint32_t DIGBOEC    : 1;            /*!< Enable the gate into the interrupt block for the digital brownout
                                                     detection on VDDC. Note: The interrupt block must also
                                                     be unmasked for ISR and interrupt status to be set                        */
      __IOM uint32_t DIGBOEF    : 1;            /*!< Enable the gate into the interrupt block for the digital brownout
                                                     detection on VDDF. Note: The interrupt block must also
                                                     be unmasked for ISR and interrupt status to be set                        */
      __IOM uint32_t DIGBOES    : 1;            /*!< Enable the gate into the interrupt block for the digital brownout
                                                     detection on VDDS. Note: The interrupt block must also
                                                     be unmasked for ISR and interrupt status to be set                        */
      __IOM uint32_t DIGBOECLV  : 1;            /*!< Enable the gate into the interrupt block for the digital brownout
                                                     detection on VDDC_LV. Note: The interrupt block must also
                                                     be unmasked for ISR and interrupt status to be set                        */
      __IOM uint32_t DIGBOERF   : 1;            /*!< Enable the gate into the interrupt block for the digital brownout
                                                     detection on VDDRF. Note: The interrupt block must also
                                                     be unmasked for ISR and interrupt status to be set                        */
            uint32_t            : 27;
    } SIMOBODM_b;
  } ;

  union {
    __IOM uint32_t SWRESET;                     /*!< Software reset register                                                   */

