AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SWRSTDBG   : 1;            /*!< Software reset for CM55 DEBUG                                             */
      __IOM uint32_t SWRSTIWIC  : 1;            /*!< Software reset for IWIC                                                   */
      __IOM uint32_t SWRSTEWIC  : 1;            /*!< Reserved field.                                                           */
      __IOM uint32_t SWRSTTPIU  : 1;            /*!< Software reset for TPIU                                                   */
      __IOM uint32_t RSVD4      : 1;            /*!< This field is reserved.                                                   */
            uint32_t            : 27;
    } SWRESET_b;
  } ;
  __IM  uint32_t  RESERVED1[121];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC                                                           */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDF                                                           */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDS                                                           */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC_LV                                                        */
      __IOM uint32_t BODDIGRF   : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDRF                                                          */
            uint32_t            : 26;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC                                                           */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDF                                                           */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDS                                                           */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC_LV                                                        */
      __IOM uint32_t BODDIGRF   : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDRF                                                          */
            uint32_t            : 26;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t BODH       : 1;            /*!< Enables an interrupt that triggers when VCC is below BODH level.          */
      __IOM uint32_t BODDIGC    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC                                                           */
      __IOM uint32_t BODDIGF    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDF                                                           */
      __IOM uint32_t BODDIGS    : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDS                                                           */
      __IOM uint32_t BODDIGCLV  : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDC_LV                                                        */
      __IOM uint32_t BODDIGRF   : 1;            /*!< Enables an interrupt that triggers when brownout detects low
                                                     voltage on VDDRF                                                          */
            uint32_t            : 26;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

