AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t WRTC       : 1;            /*!< Counter write control                                                     */
      __IOM uint32_t RPT        : 3;            /*!< Alarm repeat interval                                                     */
      __IOM uint32_t RSTOP      : 1;            /*!< RTC input clock control                                                   */
      __IOM uint32_t HR1224     : 1;            /*!< Hours Counter mode Only 24HR mode supported                               */
            uint32_t            : 26;
    } RTCCTL_b;
  } ;

  union {
    __IOM uint32_t RTCSTAT;                     /*!< This is the register status for the RTC module.                           */

    struct {
      __IOM uint32_t WRITEBUSY  : 1;            /*!< Indicates that an RTC update (write) is still in progress. Writes
                                                     are initiated by writing the CTTLOW register - CTRUP must
                                                     be written before CTRLOW to be updated (otherwise it will
                                                     retain its current value)                                                 */
            uint32_t            : 31;
    } RTCSTAT_b;
  } ;
  __IM  uint32_t  RESERVED[6];

  union {
    __IOM uint32_t CTRLOW;                      /*!< This counter contains the values for hour, minutes, seconds
                                                     and 100ths of a second Counter.                                           */

    struct {
      __IOM uint32_t CTR100     : 8;            /*!< 100ths of a second Counter. Contains the current value for hundredths
                                                     of a second.                                                              */
      __IOM uint32_t CTRSEC     : 7;            /*!< Seconds Counter. Contains the current value for seconds.                  */
            uint32_t            : 1;
      __IOM uint32_t CTRMIN     : 7;            /*!< Minutes Counter. Contains the current value for minutes.                  */
            uint32_t            : 1;
      __IOM uint32_t CTRHR      : 6;            /*!< Hours Counter. Contains the current value for hour.                       */
            uint32_t            : 2;
    } CTRLOW_b;
  } ;

  union {
    __IOM uint32_t CTRUP;                       /*!< This register contains the day, month and year information.
                                                     It contains which day in the week, and the century as well.
                                                     The information of the century can also be derived from
                                                     the year information. The 31st bit contains the error bit.
                                                     See description in the register bit for condition when
                                                     error is triggered.                                                       */

    struct {
      __IOM uint32_t CTRDATE    : 6;            /*!< Date Counter. Contains the current value for date.                        */
            uint32_t            : 2;
      __IOM uint32_t CTRMO      : 5;            /*!< Months Counter. Contains the current value for months.                    */
            uint32_t            : 3;
      __IOM uint32_t CTRYR      : 8;            /*!< Years Counter. Contains the current value for year.                       */
      __IOM uint32_t CTRWKDY    : 3;            /*!< Weekdays Counter. Contains the current value for weekdays.                */
            uint32_t            : 1;
      __IOM uint32_t CB         : 1;            /*!< Century Bit. CB == 0 assumes the century is 21xx, and CB ==
                                                     1 assumes it is 20xx.                                                     */
      __IOM uint32_t CEB        : 1;            /*!< Century Enable Bit. ERR129 - RTC cannot perform rollover. Century
                                                     Bit toggles when CEB == 1 and Year == 99 and hence cannot
                                                     handle Year rollover from xx99 -> xx00                                    */
            uint32_t            : 1;
      __IOM uint32_t CTERR      : 1;            /*!< Counter read error status. Error is triggered when software
                                                     reads the lower word of the counters, and fails to read
                                                     the upper counter within 1/100 second. This is because
                                                     when the lower counter is read, the upper counter is held
                                                     off from incrementing until it is read so that the full
                                                     time stamp can be read.                                                   */
    } CTRUP_b;
  } ;
  __IM  uint32_t  RESERVED1[2];

  union {
    __IOM uint32_t ALMLOW;                      /*!< This register is the Alarm settings for hours, minutes, second
                                                     and 1/100th seconds settings.                                             */

    struct {
      __IOM uint32_t ALM100     : 8;            /*!< 100ths of a second Alarm. Contains the current value for hundredths
                                                     of a second alarm.                                                        */
      __IOM uint32_t ALMSEC     : 7;            /*!< Seconds Alarm. Contains the current value for second alarm.               */
            uint32_t            : 1;
      __IOM uint32_t ALMMIN     : 7;            /*!< Minutes Alarm. Contains the current value for minute alarm.               */
            uint32_t            : 1;
      __IOM uint32_t ALMHR      : 6;            /*!< Hours Alarm. Contains the current value for hour alarm.                   */
            uint32_t            : 2;
    } ALMLOW_b;
  } ;

  union {
    __IOM uint32_t ALMUP;                       /*!< This register is the alarm settings for week, month and day.              */

