AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t LPHYSTCNT  : 20;           /*!< LP hysteresis count                                                       */
            uint32_t            : 12;
    } LPHYSTCNT_b;
  } ;

  union {
    __IOM uint32_t ACTTHRESH1;                  /*!< Activity threshold for VDDS and VDDF                                      */

    struct {
      __IOM uint32_t ACTTHRESHVDDF : 16;        /*!< VDDF activity threshold for SCM counter comparator                        */
      __IOM uint32_t ACTTHRESHVDDS : 16;        /*!< VDDS activity threshold for SCM counter comparator                        */
    } ACTTHRESH1_b;
  } ;

  union {
    __IOM uint32_t ACTTHRESH2;                  /*!< Activity threshold for VDDC and VDDCLV                                    */

    struct {
      __IOM uint32_t ACTTHRESHVDDCLV : 16;      /*!< VDDC_LV activity threshold for SCM counter comparator                     */
      __IOM uint32_t ACTTHRESHVDDC : 16;        /*!< VDDC activity threshold for SCM counter comparator                        */
    } ACTTHRESH2_b;
  } ;

  union {
    __IOM uint32_t ACTTHRESH3;                  /*!< Activity threshold for VDDRF                                              */

    struct {
      __IOM uint32_t ACTTHRESHVDDRF : 16;       /*!< VDDRF activity threshold for SCM counter comparator                       */
            uint32_t            : 16;
    } ACTTHRESH3_b;
  } ;

  union {
    __IOM uint32_t LPSTAT;                      /*!< SCM status register                                                       */

    struct {
      __IOM uint32_t LPOVRTRIG  : 1;            /*!< (RW1C) LP override has been triggered; write 1 to clear                   */
      __IOM uint32_t ACTTRIG    : 1;            /*!< (RW1C) Return to Active has been triggered; write 1 to clear              */
      __IOM uint32_t GOTOLP     : 1;            /*!< Write 1 to switch to LP mode and then resume normal operation
                                                     (set when going into deepsleep)                                           */
            uint32_t            : 29;
    } LPSTAT_b;
  } ;
} SCM_Type;                                     /*!< Size = 48 (0x30)                                                          */



/* =========================================================================================================================== */
/* ================                                           SDIO0                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief SDIO Control Registers (SDIO0)
  */

typedef struct {                                /*!< SDIO0 Structure                                                           */

  union {
    __IOM uint32_t SDMA;                        /*!< SDMA system address                                                       */

    struct {
      __IOM uint32_t SDMASYSTEMADDRESS : 32;    /*!< This register contains the physical system memory address used
                                                     for DMA transfers or the second argument for the Auto CMD23.
                                                     (1) SDMA System Address This register contains the system
                                                     memory address for a SDMA transfer. When the Host Controller
                                                     stops a SDMA transfer, this register shall point to the
                                                     system address of the next contiguous data position. It
                                                     can be accessed only if no transaction is executing (i.e.,
                                                     after a transaction has stopped). Read operations during
                                                     transfers may return an invalid value. The Host Driver
                                                     shall initialize this register before starting a SDMA transaction.
                                                     After SDMA has stopped, the next system address of the
                                                     next contiguous data position can be read from this register.
                                                     The SDMA transfer waits at the every boundary specified
                                                     by the Host SDMA Buffer Boundary in the Block Size register.
                                                     The Host Controller generates DMA Interrupt to request
                                                     the Host Driver to update this register. The Host Driver
                                                     sets the next system address of the next data position
                                                     to this register. When the most upper byte of this register
                                                     (003h) is written, the Host Controller restarts the SDMA
                                                     transfer. When restarting SDMA by the Resume command or
                                                     by setting Continue Request in the Block Gap Control register,
                                                     the Host Controller shall start at the next contiguous
                                                     address stored here in the SDMA System Address register.
                                                     ADMA does not use this register (2) Argument 2 This register
                                                     is used with the Auto CMD23 to set a 32-bit block count
                                                     value to the argument of the CMD23 while executing Auto
                                                     CMD23. If Auto CMD23 is used with ADMA, the full 32-bit
                                                     block count value can be used. If Auto CMD23 is used without
                                                     AMDA, the available block count value is limited by the
                                                     Block Count register. 65535 blocks is the maximum value
                                                     in this case.                                                             */
    } SDMA_b;
  } ;

  union {
    __IOM uint32_t BLOCK;                       /*!< Block size                                                                */

