AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t CLKEN      : 1;            /*!< This bit is set to 0 when the HD is not using the HC or the
                                                     HC awaits a wakeup event. The HC should stop its internal
                                                     clock to go very low power state. Still, registers shall
                                                     be able to be read and written. Clock starts to oscillate
                                                     when this bit is set to 1. When clock oscillation is stable,
                                                     the HC shall set Internal Clock Stable in this register
                                                     to 1. This bit shall not affect card detection.                           */
      __IOM uint32_t CLKSTABLE  : 1;            /*!< This bit is set to 1 when SD clock is stable after writing to
                                                     Internal Clock Enable in this register to 1. The SD Host
                                                     Driver shall wait to set SD Clock Enable until this bit
                                                     is set to 1. Note: This is useful when using PLL for a
                                                     clock oscillator that requires setup time.                                */
      __IOM uint32_t SDCLKEN    : 1;            /*!< The HC shall stop SDCLK when writing this bit to 0. SDCLK frequency
                                                     Select can be changed when this bit is 0. Then, the HC
                                                     shall maintain the same clock frequency until SDCLK is
                                                     stopped (Stop at SDCLK = 0). If the HC detects the No Card
                                                     state, this bit shall be cleared.                                         */
            uint32_t            : 2;
      __IOM uint32_t CLKGENSEL  : 1;            /*!< This bit is used to select the clock generator mode in SDCLK
                                                     Frequency Select. If the Programmable Clock Mode is supported
                                                     (non-zero value is set to Clock Multiplier in the Capabilities
                                                     register), this bit attribute is RW, and if not supported,
                                                     this bit attribute is RO and zero is read. This bit depends
                                                     on the setting of Preset Value Enable in the Host Control
                                                     2 register. If the Preset Value Enable = 0, this bit is
                                                     set by Host Driver. If the Preset Value Enable = 1, this
                                                     bit is automatically set to a value specified in one of
                                                     Preset Value registers.                                                   */
      __IOM uint32_t UPRCLKDIV  : 2;            /*!< Bit 07-06 is assigned to bit 09-08 of clock divider in SDCLK
                                                     Frequency Select                                                          */
      __IOM uint32_t FREQSEL    : 8;            /*!< This register is used to select the frequency of the SDCLK pin.
                                                     The frequency is not programmed directly; rather this register
                                                     holds the divisor of the Base Clock Frequency For SD clock
                                                     in the capabilities register. Only the following settings
                                                     are allowed. (1) 8-bit Divided Clock Mode Setting 00h specifies
                                                     the highest frequency of the SD Clock. When setting multiple
                                                     bits, the most significant bit is used as the divisor.
                                                     But multiple bits should not be set. The two default divider
                                                     values can be calculated by the frequency that is defined
                                                     by the Base Clock Frequency For SD Clock in the Capabilities
                                                     register. 1) 25 MHz divider value 2) 400 KHz divider value
                                                     The frequency of the SDCLK is set by the following formula:
                                                     Clock Frequency = (Baseclock) / divisor. Thus choose the
                                                     smallest possible divisor which results in a clock frequency
                                                     that is less than or equal to the target frequency. Maximum
                                                     Frequency for SD = 50Mhz (base clock) Maximum Frequency
                                                     for MMC = 52Mhz (base clock) Minimum Frequency = 195.3125Khz
                                                     (50Mhz / 256), same calculation for MMC also (2) 10-bit
                                                     Divided Clock Mode Host Controller Version 3.00 supports
                                                     this mandatory mode instead of the 8-bit Divided Clock
                                                     Mode. The length of divider is extended to10 bits and all
                                                     divider values shall be supported. 3FFh --1/2046 Divided
                                                     Clock N -------1/2N Divided Clock (Duty 50%) 002h -- 1/4
                                                     Divided Clock 001h ---1/2 Divided Clock 000h --- Base Clock
                                                     (10MHz-254MHz)                                                            */
      __IOM uint32_t TIMEOUTCNT : 4;            /*!< This value determines the interval by which DAT line time-outs
                                                     are detected. Refer to the Data Time-out Error in the Error
                                                     Interrupt Status register for information on factors that
                                                     dictate time-out generation. Time-out clock frequency will
                                                     be generated by dividing the sdclockTMCLK by this value.
                                                     When setting this register, prevent inadvertent time-out
                                                     events by clearing the Data Time-out Error Status Enable
                                                     (in the Error Interrupt Status Enable register) At the
                                                     initialization of the HC, the HD shall set the Data Time-out
                                                     Counter Value according to the Capabilities register. The
                                                     general formula is TIMEOUT = 2 ^ (TIMEOUTCNT + 13).                       */
            uint32_t            : 4;
      __IOM uint32_t SWRSTALL   : 1;            /*!< This reset affects the entire HC except for the card detection
                                                     circuit. Register bits of type ROC, RW, RW1C, RWAC are
                                                     cleared to 0. During its initialization, the HD shall set
                                                     this bit to 1 to reset the HC. The HC shall reset this
                                                     bit to 0 when capabilities registers are valid and the
                                                     HD can read them. Additional use of Software Reset For
                                                     All may not affect the value of the Capabilities registers.
                                                     If this bit is set to 1, the SD card shall reset itself
                                                     and must be re initialized by the HD. A reset pulse is
                                                     generated when writing 1 to each bit of this register.
                                                     After completing the reset, the HC shall clear each bit.
                                                     Because it takes some time to complete software reset,
                                                     the SD Host Driver shall confirm that these bits are 0.                   */
      __IOM uint32_t SWRSTCMD   : 1;            /*!< Only part of command circuit is reset. The following registers
                                                     and bits are cleared by this bit: Present State register
                                                     Command Inhibit (CMD) Normal Interrupt Status register
                                                     Command Complete                                                          */
      __IOM uint32_t SWRSTDAT   : 1;            /*!< Only part of data circuit is reset. The following registers
                                                     and bits are cleared by this bit: Buffer Data Port Register
                                                     Buffer is cleared and Initialized. Present State register
                                                     Buffer read Enable Buffer write Enable Read Transfer Active
                                                     Write Transfer Active DAT Line Active Command Inhibit (DAT)
                                                     Block Gap Control register Continue Request Stop At Block
                                                     Gap Request Normal Interrupt Status register Buffer Read
                                                     Ready Buffer Write Ready Block Gap Event Transfer Complete                */
            uint32_t            : 5;
    } CLOCKCTRL_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Interrupt enable                                                          */

