AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t OUTCFG36   : 6;            /*!< Pad output 36 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG37   : 6;            /*!< Pad output 37 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG38   : 6;            /*!< Pad output 38 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG39   : 6;            /*!< Pad output 39 configuration                                               */
            uint32_t            : 2;
    } OUTCFG9_b;
  } ;

  union {
    __IOM uint32_t OUTCFG10;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG40   : 6;            /*!< Pad output 40 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG41   : 6;            /*!< Pad output 41 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG42   : 6;            /*!< Pad output 42 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG43   : 6;            /*!< Pad output 43 configuration                                               */
            uint32_t            : 2;
    } OUTCFG10_b;
  } ;

  union {
    __IOM uint32_t OUTCFG11;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG44   : 6;            /*!< Pad output 44 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG45   : 6;            /*!< Pad output 45 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG46   : 6;            /*!< Pad output 46 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG47   : 6;            /*!< Pad output 47 configuration                                               */
            uint32_t            : 2;
    } OUTCFG11_b;
  } ;

  union {
    __IOM uint32_t OUTCFG12;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG48   : 6;            /*!< Pad output 48 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG49   : 6;            /*!< Pad output 49 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG50   : 6;            /*!< Pad output 50 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG51   : 6;            /*!< Pad output 51 configuration                                               */
            uint32_t            : 2;
    } OUTCFG12_b;
  } ;

  union {
    __IOM uint32_t OUTCFG13;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG52   : 6;            /*!< Pad output 52 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG53   : 6;            /*!< Pad output 53 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG54   : 6;            /*!< Pad output 54 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG55   : 6;            /*!< Pad output 55 configuration                                               */
            uint32_t            : 2;
    } OUTCFG13_b;
  } ;

  union {
    __IOM uint32_t OUTCFG14;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG56   : 6;            /*!< Pad output 56 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG57   : 6;            /*!< Pad output 57 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG58   : 6;            /*!< Pad output 58 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG59   : 6;            /*!< Pad output 59 configuration                                               */
            uint32_t            : 2;
    } OUTCFG14_b;
  } ;

  union {
    __IOM uint32_t OUTCFG15;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG60   : 6;            /*!< Pad output 60 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG61   : 6;            /*!< Pad output 61 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG62   : 6;            /*!< Pad output 62 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG63   : 6;            /*!< Pad output 63 configuration                                               */
            uint32_t            : 2;
    } OUTCFG15_b;
  } ;

  union {
    __IOM uint32_t OUTCFG16;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG64   : 6;            /*!< Pad output 64 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG65   : 6;            /*!< Pad output 65 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG66   : 6;            /*!< Pad output 66 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG67   : 6;            /*!< Pad output 67 configuration                                               */
            uint32_t            : 2;
    } OUTCFG16_b;
  } ;

  union {
    __IOM uint32_t OUTCFG17;                    /*!< Pad output configuration 0.                                               */

