AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t TIMER3     : 32;           /*!< Counter/Timer 3                                                           */
    } TIMER3_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP0;                    /*!< This contains the Compare limits for timer 3. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR3CMP0   : 32;           /*!< Counter/Timer 3 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR3CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR3CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR3CMP1   : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR3CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE3;                       /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR3TRIGSEL : 8;           /*!< Counter/Timer 3 Trigger Source Selection                                  */
            uint32_t            : 16;
    } MODE3_b;
  } ;

  union {
    __IOM uint32_t TMR3LMTVAL;                  /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR3LMTVAL : 8;            /*!< Counter/Timer 3 Limit Readback                                            */
            uint32_t            : 24;
    } TMR3LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED7[96];

  union {
    __IOM uint32_t TIMERSPARES;                 /*!< Timer Spare Regs                                                          */

    struct {
      __IOM uint32_t TMRSPARES  : 32;           /*!< Placeholer spare registes that can be used as needed for future
                                                     use                                                                       */
    } TIMERSPARES_b;
  } ;
} SECURETIMER_Type;                             /*!< Size = 1020 (0x3fc)                                                       */



/* =========================================================================================================================== */
/* ================                                         SECUREWDT                                         ================ */
/* =========================================================================================================================== */


/**
  * @brief Watchdog Timer (SECUREWDT)
  */

typedef struct {                                /*!< SECUREWDT Structure                                                       */

  union {
    __IOM uint32_t CFG;                         /*!< This is the configuration register for the watch dog timer.
                                                     It controls the enable, interrupt set, clocks for the timer,
                                                     the compare values for the counters to trigger a reset
                                                     or interrupt. This register can only be written to if the
                                                     watch dog timer is unlocked (WDTLOCK is not set).                         */

    struct {
      __IOM uint32_t WDTEN      : 1;            /*!< This bitfield enables the WDT.                                            */
      __IOM uint32_t INTEN      : 1;            /*!< This bitfield enables the WDT interrupt. Note : This bit must
                                                     be set before the interrupt status bit will reflect a watchdog
                                                     timer expiration. The IER interrupt register must also
                                                     be enabled for a WDT interrupt to be sent to the NVIC.                    */
      __IOM uint32_t RESEN      : 1;            /*!< This bitfield enables the WDT reset. This needs to be set together
                                                     with the WDREN bit in REG_RSTGEN_CFG register (in reset
                                                     gen) to trigger the reset.                                                */
            uint32_t            : 5;
      __IOM uint32_t RESVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog reset. This will cause a software reset.                       */
      __IOM uint32_t INTVAL     : 8;            /*!< This bitfield is the compare value for counter bits 7:0 to generate
                                                     a watchdog interrupt.                                                     */
      __IOM uint32_t CLKSEL     : 3;            /*!< Select the frequency for the WDT. All values not enumerated
                                                     below are undefined.                                                      */
            uint32_t            : 1;
      __IOM uint32_t NMIEN      : 1;            /*!< NMI enable. When set, the IRQ is sent to NMI.                             */
            uint32_t            : 3;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t RSTRT;                       /*!< This register will Restart the watchdog timer. Writing a special
                                                     key value into this register will result in the watch dog
                                                     timer being reset, so that the count will start again.
                                                     It is expected that the software will periodically write
                                                     to this register to indicate that the system is functional.
                                                     The watch dog timer can continue running when the system
                                                     is in deep sleep, and the interrupt will trigger the wake.
                                                     After the wake, the core can reset the watch dog timer.                   */

