AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t RSTRT      : 8;            /*!< Writing 0xB2 to WDTRSTRT restarts the watchdog timer. This is
                                                     a write only register. Reading this register will only
                                                     provide all 0.                                                            */
            uint32_t            : 24;
    } RSTRT_b;
  } ;

  union {
    __IOM uint32_t LOCK;                        /*!< This register locks the watch dog timer. Once it is locked,
                                                     the configuration register (WDTCFG) for watch dog timer
                                                     cannot be written to.                                                     */

    struct {
      __IOM uint32_t LOCK       : 8;            /*!< Writing 0x3A locks the watchdog timer. Once locked, the WDTCFG
                                                     reg cannot be written and WDTEN is set.                                   */
            uint32_t            : 24;
    } LOCK_b;
  } ;

  union {
    __IOM uint32_t COUNT;                       /*!< This register holds the current count for the watch dog timer.
                                                     This is a read only register. SW cannot set the value in
                                                     the counter, but can reset it.                                            */

    struct {
      __IOM uint32_t COUNT      : 8;            /*!< Read-Only current value of the WDT counter                                */
            uint32_t            : 24;
    } COUNT_b;
  } ;
  __IM  uint32_t  RESERVED[124];

  union {
    __IOM uint32_t WDTIEREN;                    /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIEREN_b;
  } ;

  union {
    __IOM uint32_t WDTIERSTAT;                  /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERSTAT_b;
  } ;

  union {
    __IOM uint32_t WDTIERCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERCLR_b;
  } ;

  union {
    __IOM uint32_t WDTIERSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERSET_b;
  } ;
} SECUREWDT_Type;                               /*!< Size = 528 (0x210)                                                        */



/* =========================================================================================================================== */
/* ================                                         SECURITY                                          ================ */
/* =========================================================================================================================== */


/**
  * @brief Security Interfaces (SECURITY)
  */

typedef struct {                                /*!< SECURITY Structure                                                        */

  union {
    __IOM uint32_t CTRL;                        /*!< Control                                                                   */

    struct {
      __IOM uint32_t ENABLE     : 1;            /*!< Function Enable. Software should set the ENABLE bit to initiate
                                                     a CRC operation. Hardware will clear the ENABLE bit upon
                                                     completion.                                                               */
            uint32_t            : 3;
      __IOM uint32_t FUNCTION   : 4;            /*!< Function Select                                                           */
            uint32_t            : 23;
      __IOM uint32_t CRCERROR   : 1;            /*!< CRC Error Status - Set to 1 if an error occurs during a CRC
                                                     operation. Cleared when CTRL register is written (with
                                                     any value). Usually indicates an invalid address range.                   */
    } CTRL_b;
  } ;
  __IM  uint32_t  RESERVED[3];

  union {
    __IOM uint32_t SRCADDR;                     /*!< Source Addresss                                                           */

    struct {
      __IOM uint32_t ADDR       : 32;           /*!< Source Buffer Address. Address may be byte aligned, but the
                                                     length must be a multiple of 4 bits.                                      */
    } SRCADDR_b;
  } ;
  __IM  uint32_t  RESERVED1[3];

  union {
    __IOM uint32_t LEN;                         /*!< Length                                                                    */

