AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t SCMPR0     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR0_b;
  } ;

  union {
    __IOM uint32_t SCMPR1;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR1     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR1_b;
  } ;

  union {
    __IOM uint32_t SCMPR2;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR2     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR2_b;
  } ;

  union {
    __IOM uint32_t SCMPR3;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

    struct {
      __IOM uint32_t SCMPR3     : 32;           /*!< Compare this value to the value in the COUNTER register according
                                                     to the match criterion, as selected in the COMPARE_A_EN
                                                     bit in the REG_CTIMER_STCFG register.                                     */
    } SCMPR3_b;
  } ;

  union {
    __IOM uint32_t SCMPR4;                      /*!< The VALUE in this bit field is used to compare against the VALUE
                                                     in the COUNTER register. If the match criterion in the
                                                     configuration register is met then a corresponding interrupt
                                                     status bit is set. The match criterion is defined as COUNTER
                                                     equal to COMPARE. To establish a desired value in this
                                                     COMPARE register, write the number of ticks in the future
                                                     to this register to indicate when to interrupt. The hardware
                                                     does the addition to the COUNTER value in the STIMER clock
                                                     domain so that the math is precise. Reading this register
                                                     shows the COUNTER value at which this interrupt will occur.               */

