AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t OUTCFG72   : 6;            /*!< Pad output 72 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG73   : 6;            /*!< Pad output 73 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG74   : 6;            /*!< Pad output 74 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG75   : 6;            /*!< Pad output 75 configuration                                               */
            uint32_t            : 2;
    } OUTCFG18_b;
  } ;

  union {
    __IOM uint32_t OUTCFG19;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG76   : 6;            /*!< Pad output 76 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG77   : 6;            /*!< Pad output 77 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG78   : 6;            /*!< Pad output 78 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG79   : 6;            /*!< Pad output 79 configuration                                               */
            uint32_t            : 2;
    } OUTCFG19_b;
  } ;

  union {
    __IOM uint32_t OUTCFG20;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG80   : 6;            /*!< Pad output 80 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG81   : 6;            /*!< Pad output 81 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG82   : 6;            /*!< Pad output 82 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG83   : 6;            /*!< Pad output 83 configuration                                               */
            uint32_t            : 2;
    } OUTCFG20_b;
  } ;

  union {
    __IOM uint32_t OUTCFG21;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG84   : 6;            /*!< Pad output 84 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG85   : 6;            /*!< Pad output 85 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG86   : 6;            /*!< Pad output 86 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG87   : 6;            /*!< Pad output 87 configuration                                               */
            uint32_t            : 2;
    } OUTCFG21_b;
  } ;

  union {
    __IOM uint32_t OUTCFG22;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG88   : 6;            /*!< Pad output 88 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG89   : 6;            /*!< Pad output 89 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG90   : 6;            /*!< Pad output 90 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG91   : 6;            /*!< Pad output 91 configuration                                               */
            uint32_t            : 2;
    } OUTCFG22_b;
  } ;

  union {
    __IOM uint32_t OUTCFG23;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG92   : 6;            /*!< Pad output 92 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG93   : 6;            /*!< Pad output 93 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG94   : 6;            /*!< Pad output 94 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG95   : 6;            /*!< Pad output 95 configuration                                               */
            uint32_t            : 2;
    } OUTCFG23_b;
  } ;

  union {
    __IOM uint32_t OUTCFG24;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG96   : 6;            /*!< Pad output 96 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG97   : 6;            /*!< Pad output 97 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG98   : 6;            /*!< Pad output 98 configuration                                               */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG99   : 6;            /*!< Pad output 99 configuration                                               */
            uint32_t            : 2;
    } OUTCFG24_b;
  } ;

  union {
    __IOM uint32_t OUTCFG25;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG100  : 6;            /*!< Pad output 100 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG101  : 6;            /*!< Pad output 101 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG102  : 6;            /*!< Pad output 102 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG103  : 6;            /*!< Pad output 103 configuration                                              */
            uint32_t            : 2;
    } OUTCFG25_b;
  } ;

  union {
    __IOM uint32_t OUTCFG26;                    /*!< Pad output configuration 0.                                               */

