AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t OUTCFG104  : 6;            /*!< Pad output 104 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG105  : 6;            /*!< Pad output 105 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG106  : 6;            /*!< Pad output 106 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG107  : 6;            /*!< Pad output 107 configuration                                              */
            uint32_t            : 2;
    } OUTCFG26_b;
  } ;

  union {
    __IOM uint32_t OUTCFG27;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG108  : 6;            /*!< Pad output 108 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG109  : 6;            /*!< Pad output 109 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG110  : 6;            /*!< Pad output 110 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG111  : 6;            /*!< Pad output 111 configuration                                              */
            uint32_t            : 2;
    } OUTCFG27_b;
  } ;

  union {
    __IOM uint32_t OUTCFG28;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG112  : 6;            /*!< Pad output 112 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG113  : 6;            /*!< Pad output 113 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG114  : 6;            /*!< Pad output 114 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG115  : 6;            /*!< Pad output 115 configuration                                              */
            uint32_t            : 2;
    } OUTCFG28_b;
  } ;

  union {
    __IOM uint32_t OUTCFG29;                    /*!< Pad output configuration 0.                                               */

    struct {
      __IOM uint32_t OUTCFG116  : 6;            /*!< Pad output 116 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG117  : 6;            /*!< Pad output 117 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG118  : 6;            /*!< Pad output 118 configuration                                              */
            uint32_t            : 2;
      __IOM uint32_t OUTCFG119  : 6;            /*!< Pad output 119 configuration                                              */
            uint32_t            : 2;
    } OUTCFG29_b;
  } ;
  __IM  uint32_t  RESERVED3[66];

  union {
    __IOM uint32_t CTRL0;                       /*!< This includes the Control bit fields for timer 0.                         */

    struct {
      __IOM uint32_t TMR0EN     : 1;            /*!< Counter/Timer 0 Enable bit.                                               */
      __IOM uint32_t TMR0CLR    : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR0POL0   : 1;            /*!< Counter/Timer 0 output 0 polarity.                                        */
      __IOM uint32_t TMR0POL1   : 1;            /*!< Counter/Timer 0 output 1 polarity.                                        */
      __IOM uint32_t TMR0FN     : 4;            /*!< Counter/Timer 0 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR0CLK    : 8;            /*!< Counter/Timer 0 Clock Select.                                             */
      __IOM uint32_t TMR0TMODE  : 2;            /*!< Counter/Timer 0 Trigger Mode                                              */
            uint32_t            : 6;
      __IOM uint32_t TMR0LMT    : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     0. For Single/Repeat Patterns, it indicates number of bits
                                                     to be shifted out and so, max value is 63.                                */
    } CTRL0_b;
  } ;

  union {
    __IOM uint32_t TIMER0;                      /*!< This register holds the running time or event count for timer
                                                     0.                                                                        */

    struct {
      __IOM uint32_t TIMER0     : 32;           /*!< Counter/Timer 0                                                           */
    } TIMER0_b;
  } ;

  union {
    __IOM uint32_t TMR0CMP0;                    /*!< This contains the Compare limits for timer 0. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR0CMP0   : 32;           /*!< Counter/Timer 0 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR0CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR0CMP1;                    /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

