AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR12TRIGSEL : 8;          /*!< Counter/Timer 12 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE12_b;
  } ;

  union {
    __IOM uint32_t TMR12LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR12LMTVAL : 8;           /*!< Counter/Timer 12 Limit Readback                                           */
            uint32_t            : 24;
    } TMR12LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED16[2];

  union {
    __IOM uint32_t CTRL13;                      /*!< This includes the Control bit fields for timer 13.                        */

    struct {
      __IOM uint32_t TMR13EN    : 1;            /*!< Counter/Timer 13 Enable bit.                                              */
      __IOM uint32_t TMR13CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR13POL0  : 1;            /*!< Counter/Timer 13 output 0 polarity.                                       */
      __IOM uint32_t TMR13POL1  : 1;            /*!< Counter/Timer 13 output 1 polarity.                                       */
      __IOM uint32_t TMR13FN    : 4;            /*!< Counter/Timer 13 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR13CLK   : 8;            /*!< Counter/Timer 13 Clock Select.                                            */
      __IOM uint32_t TMR13TMODE : 2;            /*!< Counter/Timer 13 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR13LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     13. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL13_b;
  } ;

  union {
    __IOM uint32_t TIMER13;                     /*!< This register holds the running time or event count for timer
                                                     13.                                                                       */

    struct {
      __IOM uint32_t TIMER13    : 32;           /*!< Counter/Timer 13                                                          */
    } TIMER13_b;
  } ;

  union {
    __IOM uint32_t TMR13CMP0;                   /*!< This contains the Compare limits for timer 13. This is the primary
                                                     comparator that can be used to mark the END of a timer
                                                     cycle (and thus restart the timer for repeat modes)                       */

    struct {
      __IOM uint32_t TMR13CMP0  : 32;           /*!< Counter/Timer 13 End Compare Register. For MEASURE mode indicates
                                                     the high phase sample count.                                              */
    } TMR13CMP0_b;
  } ;

  union {
    __IOM uint32_t TMR13CMP1;                   /*!< This comparator is used as a secondary compare count for modes
                                                     that generate pulses. For MEASURE mode indicates the low
                                                     phase sample count.                                                       */

    struct {
      __IOM uint32_t TMR13CMP1  : 32;           /*!< Holds the secondary comparator that can be used to generate
                                                     a PWM or generate secondary pulses. CMP0 should ALWAYS
                                                     be used first.                                                            */
    } TMR13CMP1_b;
  } ;

  union {
    __IOM uint32_t MODE13;                      /*!< The mode register contains optional mode controls for the timer           */

    struct {
            uint32_t            : 8;
      __IOM uint32_t TMR13TRIGSEL : 8;          /*!< Counter/Timer 13 Trigger Source Selection                                 */
            uint32_t            : 16;
    } MODE13_b;
  } ;

  union {
    __IOM uint32_t TMR13LMTVAL;                 /*!< This is an internal counter in the hardware that counts down
                                                     from TMR_LMT to 1                                                         */

    struct {
      __IOM uint32_t TMR13LMTVAL : 8;           /*!< Counter/Timer 13 Limit Readback                                           */
            uint32_t            : 24;
    } TMR13LMTVAL_b;
  } ;
  __IM  uint32_t  RESERVED17[2];

  union {
    __IOM uint32_t CTRL14;                      /*!< This includes the Control bit fields for timer 14.                        */

    struct {
      __IOM uint32_t TMR14EN    : 1;            /*!< Counter/Timer 14 Enable bit.                                              */
      __IOM uint32_t TMR14CLR   : 1;            /*!< Counter/Timer Clear bit.                                                  */
      __IOM uint32_t TMR14POL0  : 1;            /*!< Counter/Timer 14 output 0 polarity.                                       */
      __IOM uint32_t TMR14POL1  : 1;            /*!< Counter/Timer 14 output 1 polarity.                                       */
      __IOM uint32_t TMR14FN    : 4;            /*!< Counter/Timer 14 Function Select. For all Functions, CMP0 marks
                                                     the end of timer cycle, and thus restarts the timer.                      */
      __IOM uint32_t TMR14CLK   : 8;            /*!< Counter/Timer 14 Clock Select.                                            */
      __IOM uint32_t TMR14TMODE : 2;            /*!< Counter/Timer 14 Trigger Mode                                             */
            uint32_t            : 6;
      __IOM uint32_t TMR14LMT   : 8;            /*!< This field decides the number of iterations of Counter/Timer
                                                     14. For Single/Repeat Patterns, it indicates number of
                                                     bits to be shifted out and so, max value is 63.                           */
    } CTRL14_b;
  } ;

  union {
    __IOM uint32_t TIMER14;                     /*!< This register holds the running time or event count for timer
                                                     14.                                                                       */

