AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG30_b;
  } ;

  union {
    __IOM uint32_t REG34;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< FIXME (description needed).                                               */
            uint32_t            : 24;
    } REG34_b;
  } ;

  union {
    __IOM uint32_t REG38;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG38_b;
  } ;

  union {
    __IOM uint32_t REG3C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF10       : 2;            /*!< FIXME (description needed).                                               */
      __IOM uint32_t BF42       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF75       : 3;            /*!< Host disconnect filter select. 3'b100:6 clocks(480M clock) 3'b101:8
                                                     clocks 3'b111:disconnect disable Other: invalid                           */
            uint32_t            : 24;
    } REG3C_b;
  } ;

  union {
    __IOM uint32_t REG40;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF60       : 7;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG40_b;
  } ;

  union {
    __IOM uint32_t REG44;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< 1: DP/DM will be sampled in HS Tx or Rx state 0: DP/DM will
                                                     be sampled only in Hs Rx state                                            */
      __IOM uint32_t BF11       : 1;            /*!< Disconnect squelch and comparator calibration bypass, active
                                                     high                                                                      */
      __IOM uint32_t BF42       : 3;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF65       : 2;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF77       : 1;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG44_b;
  } ;

  union {
    __IOM uint32_t REG48;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Enable TX shutdown, active LOW. This bit is only used for debug
                                                     purpose , nothing to do with the normal operation and signal
                                                     quality, keeping the default value is strongly recommended.               */
      __IOM uint32_t BF71       : 7;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG48_b;
  } ;

  union {
    __IOM uint32_t REG4C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG4C_b;
  } ;

  union {
    __IOM uint32_t REG50;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG50_b;
  } ;

  union {
    __IOM uint32_t REG54;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG54_b;
  } ;

  union {
    __IOM uint32_t REG58;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG58_b;
  } ;

  union {
    __IOM uint32_t REG5C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG5C_b;
  } ;

  union {
    __IOM uint32_t REG60;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG60_b;
  } ;

  union {
    __IOM uint32_t REG64;                       /*!< Register description here                                                 */

