AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t BF00       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG64_b;
  } ;

  union {
    __IOM uint32_t REG68;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG68_b;
  } ;

  union {
    __IOM uint32_t REG6C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG6C_b;
  } ;

  union {
    __IOM uint32_t REG70;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< FIXME (description needed).                                               */
            uint32_t            : 24;
    } REG70_b;
  } ;

  union {
    __IOM uint32_t REG74;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Disconnect detection block input res load sel. 1'b0: disconnect
                                                     detection block input res load bypass 1'b1: disconnect
                                                     detection block input res load enable                                     */
      __IOM uint32_t BF31       : 3;            /*!< HS driver slew rate tuning 001:SR is weakest 111:SR is strongest.000
                                                     is forbidden.                                                             */
      __IOM uint32_t BF74       : 4;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG74_b;
  } ;

  union {
    __IOM uint32_t REG78;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG78_b;
  } ;

  union {
    __IOM uint32_t REG7C;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF40       : 5;            /*!< This bitfield is reserved.                                                */
      __IOM uint32_t BF55       : 1;            /*!< No leakage current on DP/DM pin when VCCA3P3 power down, active
                                                     low. Keeping the default value was greatly appreciated                    */
      __IOM uint32_t BF66       : 1;            /*!< Hs chirp mode amplitude increasing register, active high.                 */
      __IOM uint32_t BF77       : 1;            /*!< Clk60m source clock select. 1'b1: free clock 60M 1'b0: utmi_clk           */
            uint32_t            : 24;
    } REG7C_b;
  } ;

  union {
    __IOM uint32_t REG80;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF00       : 1;            /*!< Digital clock enable bypass 1'b1: digital clock bypass enable
                                                     1'b0: digital clock bypass disable                                        */
      __IOM uint32_t BF11       : 1;            /*!< Digital clock enable bypass value 1'b1: digital clock enable
                                                     1'b0: digital clock disable                                               */
      __IOM uint32_t BF22       : 1;            /*!< utmi clock always on 1'b1: utmi clock always on 1'b0: utmi clock
                                                     relative to suspendm                                                      */
      __IOM uint32_t BF73       : 5;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG80_b;
  } ;

  union {
    __IOM uint32_t REG84;                       /*!< Register description here                                                 */

    struct {
      __IOM uint32_t BF70       : 8;            /*!< This bitfield is reserved.                                                */
            uint32_t            : 24;
    } REG84_b;
  } ;
} USBPHY_Type;                                  /*!< Size = 136 (0x88)                                                         */



/* =========================================================================================================================== */
/* ================                                            USB                                            ================ */
/* =========================================================================================================================== */


/**
  * @brief USB device register descriptions. (USB)
  */

typedef struct {                                /*!< USB Structure                                                             */

  union {
    __IOM uint32_t CFG0;                        /*!< Function address, power management, interrupt status register
                                                     for EP0 and IN Endpoints 1 to 5                                           */

    struct {
      __IOM uint32_t FuncAddr   : 7;            /*!< The function address. This field should be written with the
                                                     address value contained in the SET_ADDRESS standard device
                                                     request, when it is received on Endpoint 0. The new address
                                                     will not take effect immediately as the host will still
                                                     be using the old address for the Status stage of the device
                                                     request. The USB Controller will continue to use the old
                                                     address for decoding packets until the device request has
                                                     completed. The status of the device request can be determined
                                                     by reading the Update bit. When a new address is written
                                                     to this field, the Update bit will be automatically set.
                                                     It will remain high until the device request has completed
                                                     and will be cleared when the new address takes effect Note:
                                                     While the firmware may write the new address to the FuncAddr
                                                     field immediately when it is received, it is recommended
                                                     to leave this operation to the Status phase of the operation
                                                     in case the host aborts the command.                                      */
      __IOM uint32_t Update     : 1;            /*!< Function Address Update. Set when FuncAddr is written. Cleared
                                                     when the new address takes effect (at the end of the current
                                                     transfer).                                                                */
      __IOM uint32_t Enabl      : 1;            /*!< Set by the CPU to enable the SUSPENDM signal. The Enabl bit
                                                     is set to enable the SUSPENDM signal to put the UTM (and
                                                     any other hardware which uses the SUSPENDM signal) into
                                                     Suspend mode. If this bit is not set, Suspend mode will
                                                     be detected as normal but the SUSPENDM signal will remain
                                                     high so that the UTM does not go into its low-power mode.                 */
      __IOM uint32_t Suspen     : 1;            /*!< Suspend Status. This read-only bit is set when Suspend mode
                                                     is entered. It is cleared when the CPU reads the interrupt
                                                     register, or sets the Resume bit of this register. The
                                                     Suspen bit is set by the USB Controller when Suspend mode
                                                     is entered. It will be cleared when the CFG2_Suspend field
                                                     is read (as a result of receiving a Suspend interrupt).
                                                     It will also be cleared if Suspend mode is left by setting
                                                     the Resume bit to initiate a remote wake-up.                              */
      __IOM uint32_t Resume     : 1;            /*!< Resume. Set should clear this bit after 10 ms (a maximum of
                                                     15 ms) to end Resume signaling. The Resume bit is used
                                                     to force the USB Controller to generate Resume signaling
                                                     on the USB to perform remote wake-up from Suspend mode.
                                                     Once set high, it should be left high for approximately
                                                     10 ms (at least 1 ms and no more than 15 ms), then cleared.               */
      __IOM uint32_t Reset      : 1;            /*!< Reset Status. Cleared when either HS negotiation has completed
                                                     successfully or after 2.1 ms of reset signaling if HS negotiation
                                                     fails. The Reset bit can be used to determine when reset
                                                     signaling is present on the USB. Set when Reset signaling
                                                     is detected and remains high until the bus reverts to an
                                                     idle state.                                                               */
      __IOM uint32_t HSMode     : 1;            /*!< This read-only bit is set when the USB Controller has successfully
                                                     negotiated for High-speed mode. The HSMode bit can be used
                                                     to determine whether the USB Controller is in High-speed
                                                     mode or Full-speed mode. It will go high when the function
                                                     has successfully negotiated for high-speed operation during
                                                     a USB reset.                                                              */
      __IOM uint32_t HSEnab     : 1;            /*!< High-speed Enable. When set by the CPU, the USB Controller will
                                                     negotiate for high-speed mode when the device is reset
                                                     by the hub. If not set, the device will only operate in
                                                     Full-speed mode. The HSEnab bit can be used to disable
                                                     high-speed operation. Normally the USB Controller will
                                                     automatically negotiate for high speed operation, when
                                                     it is reset, by sending a 'chirp' to the hub. However if
                                                     this bit is cleared then the USB Controller will not send
                                                     any 'chirps' to the hub so the function will remain in
                                                     Full-speed mode, even when connected to a high-speed-capable
                                                     USB.                                                                      */
      __IOM uint32_t AMSPECIFIC : 1;            /*!< Software-enabled Connection (SoftConn). When set to 1, the PHY
                                                     is placed in its normal mode and the D+/D- lines of the
                                                     USB bus are enabled. When bit is cleared, the PHY is put
                                                     into non-driving mode and D+ and D- are tri-stated.                       */
      __IOM uint32_t ISOUpdate  : 1;            /*!< Isochronous Transfer Update. When set by the CPU, the USB Controller
                                                     will wait for an SOF token from the time InPktRdy is set
                                                     before sending the packet. If an IN token is received before
                                                     an SOF token, then a zero length data packet will be sent.
                                                     Note: This bit only affects endpoints performing Isochronous
                                                     transfers. The ISOUpdate bit affects all IN Isochronous
                                                     endpoints in the USB Controller. It is normally used as
                                                     a method of ensuring 'clean' start-up of an IN Isochronous
                                                     pipe.                                                                     */
      __IOM uint32_t EP0InIntStat : 1;          /*!< IN Endpoint 0 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
      __IOM uint32_t EP1InIntStat : 1;          /*!< IN Endpoint 1 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
      __IOM uint32_t EP2InIntStat : 1;          /*!< IN Endpoint 2 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
      __IOM uint32_t EP3InIntStat : 1;          /*!< IN Endpoint 3 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
      __IOM uint32_t EP4InIntStat : 1;          /*!< IN Endpoint 4 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
      __IOM uint32_t EP5InIntStat : 1;          /*!< IN Endpoint 5 interrupt status. All interrupts are cleared when
                                                     the register is read.                                                     */
            uint32_t            : 10;
    } CFG0_b;
  } ;

  union {
    __IOM uint32_t CFG1;                        /*!< Indicates which of the IN Endpoint 1 - 5 interrupts and the
                                                     single Endpoint 0 interrupt are currently active. Also
                                                     indicates which of the interrupts for OUT Endpoint 1 -
                                                     5 are currently active. All active interrupts are cleared
                                                     when this register is read.                                               */

