AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t ADMAREQSIZE6 : 12;         /*!< Auto DMA Request Size for USB DMA request line 6                          */
            uint32_t            : 20;
    } ADMAREQSIZE6_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE7;                /*!< Auto DMA Request Size 7                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE7 : 12;         /*!< Auto DMA Request Size for USB DMA request line 7                          */
            uint32_t            : 20;
    } ADMAREQSIZE7_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE8;                /*!< Auto DMA Request Size 8                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE8 : 12;         /*!< Auto DMA Request Size for USB DMA request line 8                          */
            uint32_t            : 20;
    } ADMAREQSIZE8_b;
  } ;

  union {
    __IOM uint32_t ADMAREQSIZE9;                /*!< Auto DMA Request Size 9                                                   */

    struct {
      __IOM uint32_t ADMAREQSIZE9 : 12;         /*!< Auto DMA Request Size for USB DMA request line 9                          */
            uint32_t            : 20;
    } ADMAREQSIZE9_b;
  } ;
} USB_Type;                                     /*!< Size = 9256 (0x2428)                                                      */



/* =========================================================================================================================== */
/* ================                                           VCOMP                                           ================ */
/* =========================================================================================================================== */


/**
  * @brief Voltage Comparator (VCOMP)
  */

typedef struct {                                /*!< VCOMP Structure                                                           */

  union {
    __IOM uint32_t CFG;                         /*!< The Voltage Comparator Configuration Register contains the software
                                                     control for selecting beween the 4 options for the positive
                                                     input as well as the multiple options for the reference
                                                     input.                                                                    */

    struct {
      __IOM uint32_t PSEL       : 2;            /*!< This bitfield selects the positive input to the comparator.               */
            uint32_t            : 6;
      __IOM uint32_t NSEL       : 2;            /*!< This bitfield selects the negative input to the comparator.               */
            uint32_t            : 6;
      __IOM uint32_t LVLSEL     : 4;            /*!< When the reference input NSEL is set to NSEL_DAC, this bitfield
                                                     selects the voltage level for the negative input to the
                                                     comparator.                                                               */
            uint32_t            : 12;
    } CFG_b;
  } ;

  union {
    __IOM uint32_t STAT;                        /*!< Status                                                                    */

    struct {
      __IOM uint32_t CMPOUT     : 1;            /*!< This bit is 1 if the positive input of the comparator is greater
                                                     than the negative input.                                                  */
      __IOM uint32_t PWDSTAT    : 1;            /*!< This bit indicates the power down state of the voltage comparator.        */
            uint32_t            : 30;
    } STAT_b;
  } ;

  union {
    __IOM uint32_t PWDKEY;                      /*!< Write a value of 0x37 to unlock, write any other value to lock.
                                                     This register also indicates lock status when read. When
                                                     in the unlccked state (i.e. 0x37 has been written), it
                                                     reads as 1. When in the locked state, it reads as 0.                      */

    struct {
      __IOM uint32_t PWDKEY     : 32;           /*!< Key register value.                                                       */
    } PWDKEY_b;
  } ;
  __IM  uint32_t  RESERVED[125];

  union {
    __IOM uint32_t INTEN;                       /*!< Set bits in this register to allow this module to generate the
                                                     corresponding interrupt.                                                  */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTEN_b;
  } ;

  union {
    __IOM uint32_t INTSTAT;                     /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTSTAT_b;
  } ;

  union {
    __IOM uint32_t INTCLR;                      /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t OUTLOW     : 1;            /*!< This bit is the vcompout low interrupt.                                   */
      __IOM uint32_t OUTHI      : 1;            /*!< This bit is the vcompout high interrupt.                                  */
            uint32_t            : 30;
    } INTCLR_b;
  } ;

  union {
    __IOM uint32_t INTSET;                      /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

