AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIEREN_b;
  } ;

  union {
    __IOM uint32_t WDTIERSTAT;                  /*!< Read bits from this register to discover the cause of a recent
                                                     interrupt.                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERSTAT_b;
  } ;

  union {
    __IOM uint32_t WDTIERCLR;                   /*!< Write a 1 to a bit in this register to clear the interrupt status
                                                     associated with that bit.                                                 */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERCLR_b;
  } ;

  union {
    __IOM uint32_t WDTIERSET;                   /*!< Write a 1 to a bit in this register to instantly generate an
                                                     interrupt from this module. (Generally used for testing
                                                     purposes).                                                                */

    struct {
      __IOM uint32_t WDTINT     : 1;            /*!< Watchdog Timer Interrupt.                                                 */
            uint32_t            : 31;
    } WDTIERSET_b;
  } ;
} WDT_Type;                                     /*!< Size = 528 (0x210)                                                        */


/** @} */ /* End of group Device_Peripheral_peripherals */


/* =========================================================================================================================== */
/* ================                          Device Specific Peripheral Address Map                           ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_peripheralAddr
  * @{
  */

#define ADC_BASE                    0x40038000UL
#define CLKGEN_BASE                 0x40004000UL
#define CM55IPC_BASE                0x40034000UL
#define CRM_BASE                    0x40006000UL
#define CRYPTO_BASE                 0x400C0000UL
#define DC_BASE                     0x400A0000UL
#define DSI_BASE                    0x400A8000UL
#define FPIO_BASE                   0x40013800UL
#define GPIO_BASE                   0x40012800UL
#define GPU_BASE                    0x40090000UL
#define I2S0_BASE                   0x40208000UL
#define I2S1_BASE                   0x40209000UL
#define I3C_BASE                    0x40059000UL
#define IOM0_BASE                   0x40050000UL
#define IOM1_BASE                   0x40051000UL
#define IOM2_BASE                   0x40052000UL
#define IOM3_BASE                   0x40053000UL
#define IOM4_BASE                   0x40054000UL
#define IOM5_BASE                   0x40055000UL
#define IOSLAVEFD0_BASE             0x40035000UL
#define IOSLAVEFD1_BASE             0x40036000UL
#define MCUCTRL_BASE                0x4000A800UL
#define MSPI0_BASE                  0x40060000UL
#define MSPI1_BASE                  0x40061000UL
#define MSPI2_BASE                  0x40062000UL
#define OTP_BASE                    0x40009800UL
#define PDM0_BASE                   0x40201000UL
#define PWRCTRL_BASE                0x4000C000UL
#define RSTGEN_BASE                 0x40000000UL
#define RTC_BASE                    0x40010000UL
#define SCM_BASE                    0x40040000UL
#define SDIO0_BASE                  0x40070000UL
#define SDIO1_BASE                  0x40071000UL
#define SECURERTC_BASE              0x40004800UL
#define SECURESTIMER_BASE           0x40008800UL
#define SECURETIMER_BASE            0x40008000UL
#define SECUREWDT_BASE              0x4000D000UL
#define SECURITY_BASE               0x4000E800UL
#define SSC_BASE                    0x40005000UL
#define STIMER_BASE                 0x40030800UL
#define TIMER_BASE                  0x40030000UL
#define UART0_BASE                  0x40039000UL
#define UART1_BASE                  0x4003A000UL
#define USBPHY_BASE                 0x400B4000UL
#define USB_BASE                    0x400B0000UL
#define VCOMP_BASE                  0x40011C00UL
#define WDT_BASE                    0x40027000UL

/** @} */ /* End of group Device_Peripheral_peripheralAddr */


/* =========================================================================================================================== */
/* ================                                  Peripheral declaration                                   ================ */
/* =========================================================================================================================== */


/** @addtogroup Device_Peripheral_declaration
  * @{
  */

#define ADC                         ((ADC_Type*)               ADC_BASE)
#define CLKGEN                      ((CLKGEN_Type*)            CLKGEN_BASE)
#define CM55IPC                     ((CM55IPC_Type*)           CM55IPC_BASE)
#define CRM                         ((CRM_Type*)               CRM_BASE)
#define CRYPTO                      ((CRYPTO_Type*)            CRYPTO_BASE)
#define DC                          ((DC_Type*)                DC_BASE)
#define DSI                         ((DSI_Type*)               DSI_BASE)
#define FPIO                        ((FPIO_Type*)              FPIO_BASE)
#define GPIO                        ((GPIO_Type*)              GPIO_BASE)
#define GPU                         ((GPU_Type*)               GPU_BASE)
#define I2S0                        ((I2S0_Type*)              I2S0_BASE)
#define I2S1                        ((I2S0_Type*)              I2S1_BASE)
#define I3C                         ((I3C_Type*)               I3C_BASE)
#define IOM0                        ((IOM0_Type*)              IOM0_BASE)
#define IOM1                        ((IOM0_Type*)              IOM1_BASE)
#define IOM2                        ((IOM0_Type*)              IOM2_BASE)
#define IOM3                        ((IOM0_Type*)              IOM3_BASE)
#define IOM4                        ((IOM0_Type*)              IOM4_BASE)
#define IOM5                        ((IOM0_Type*)              IOM5_BASE)
#define IOSLAVEFD0                  ((IOSLAVEFD0_Type*)        IOSLAVEFD0_BASE)
#define IOSLAVEFD1                  ((IOSLAVEFD0_Type*)        IOSLAVEFD1_BASE)
#define MCUCTRL                     ((MCUCTRL_Type*)           MCUCTRL_BASE)
#define MSPI0                       ((MSPI0_Type*)             MSPI0_BASE)
#define MSPI1                       ((MSPI0_Type*)             MSPI1_BASE)
#define MSPI2                       ((MSPI0_Type*)             MSPI2_BASE)
#define OTP                         ((OTP_Type*)               OTP_BASE)
#define PDM0                        ((PDM0_Type*)              PDM0_BASE)
#define PWRCTRL                     ((PWRCTRL_Type*)           PWRCTRL_BASE)
#define RSTGEN                      ((RSTGEN_Type*)            RSTGEN_BASE)
#define RTC                         ((RTC_Type*)               RTC_BASE)
#define SCM                         ((SCM_Type*)               SCM_BASE)
#define SDIO0                       ((SDIO0_Type*)             SDIO0_BASE)
#define SDIO1                       ((SDIO0_Type*)             SDIO1_BASE)
#define SECURERTC                   ((SECURERTC_Type*)         SECURERTC_BASE)
#define SECURESTIMER                ((SECURESTIMER_Type*)      SECURESTIMER_BASE)
#define SECURETIMER                 ((SECURETIMER_Type*)       SECURETIMER_BASE)
#define SECUREWDT                   ((SECUREWDT_Type*)         SECUREWDT_BASE)
#define SECURITY                    ((SECURITY_Type*)          SECURITY_BASE)
#define SSC                         ((SSC_Type*)               SSC_BASE)
#define STIMER                      ((STIMER_Type*)            STIMER_BASE)
#define TIMER                       ((TIMER_Type*)             TIMER_BASE)
#define UART0                       ((UART0_Type*)             UART0_BASE)
#define UART1                       ((UART0_Type*)             UART1_BASE)
#define USBPHY                      ((USBPHY_Type*)            USBPHY_BASE)
#define USB                         ((USB_Type*)               USB_BASE)
#define VCOMP                       ((VCOMP_Type*)             VCOMP_BASE)
#define WDT                         ((WDT_Type*)               WDT_BASE)

