AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define ADC_DMAENNEXTCTRL_DMAENNEXT_Msk   (0x1UL)                   /*!< DMAENNEXT (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                          CLKGEN                                           ================ */
/* =========================================================================================================================== */

/* =========================================================  OCTRL  ========================================================= */
#define CLKGEN_OCTRL_SECURERTCOSEL_Pos    (7UL)                     /*!< SECURERTCOSEL (Bit 7)                                 */
#define CLKGEN_OCTRL_SECURERTCOSEL_Msk    (0x80UL)                  /*!< SECURERTCOSEL (Bitfield-Mask: 0x01)                   */
#define CLKGEN_OCTRL_RTCOSEL_Pos          (6UL)                     /*!< RTCOSEL (Bit 6)                                       */
#define CLKGEN_OCTRL_RTCOSEL_Msk          (0x40UL)                  /*!< RTCOSEL (Bitfield-Mask: 0x01)                         */
/* ========================================================  CLKOUT  ========================================================= */
#define CLKGEN_CLKOUT_AOCLKFORCEEN_Pos    (8UL)                     /*!< AOCLKFORCEEN (Bit 8)                                  */
#define CLKGEN_CLKOUT_AOCLKFORCEEN_Msk    (0x100UL)                 /*!< AOCLKFORCEEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLKOUT_CKEN_Pos            (7UL)                     /*!< CKEN (Bit 7)                                          */
#define CLKGEN_CLKOUT_CKEN_Msk            (0x80UL)                  /*!< CKEN (Bitfield-Mask: 0x01)                            */
#define CLKGEN_CLKOUT_CKSEL_Pos           (0UL)                     /*!< CKSEL (Bit 0)                                         */
#define CLKGEN_CLKOUT_CKSEL_Msk           (0x3fUL)                  /*!< CKSEL (Bitfield-Mask: 0x3f)                           */
/* =========================================================  HFADJ  ========================================================= */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Pos    (24UL)                    /*!< HFADJMAXDELTA (Bit 24)                                */
#define CLKGEN_HFADJ_HFADJMAXDELTA_Msk    (0x1f000000UL)            /*!< HFADJMAXDELTA (Bitfield-Mask: 0x1f)                   */
#define CLKGEN_HFADJ_HFADJGAIN_Pos        (21UL)                    /*!< HFADJGAIN (Bit 21)                                    */
#define CLKGEN_HFADJ_HFADJGAIN_Msk        (0xe00000UL)              /*!< HFADJGAIN (Bitfield-Mask: 0x07)                       */
#define CLKGEN_HFADJ_HFWARMUP_Pos         (20UL)                    /*!< HFWARMUP (Bit 20)                                     */
#define CLKGEN_HFADJ_HFWARMUP_Msk         (0x100000UL)              /*!< HFWARMUP (Bitfield-Mask: 0x01)                        */
#define CLKGEN_HFADJ_HFXTADJ_Pos          (8UL)                     /*!< HFXTADJ (Bit 8)                                       */
#define CLKGEN_HFADJ_HFXTADJ_Msk          (0xfff00UL)               /*!< HFXTADJ (Bitfield-Mask: 0xfff)                        */
#define CLKGEN_HFADJ_HFADJCK_Pos          (1UL)                     /*!< HFADJCK (Bit 1)                                       */
#define CLKGEN_HFADJ_HFADJCK_Msk          (0xeUL)                   /*!< HFADJCK (Bitfield-Mask: 0x07)                         */
#define CLKGEN_HFADJ_HFADJEN_Pos          (0UL)                     /*!< HFADJEN (Bit 0)                                       */
#define CLKGEN_HFADJ_HFADJEN_Msk          (0x1UL)                   /*!< HFADJEN (Bitfield-Mask: 0x01)                         */
/* ======================================================  CLOCKENSTAT  ====================================================== */
#define CLKGEN_CLOCKENSTAT_HFRCCLKEN_Pos  (31UL)                    /*!< HFRCCLKEN (Bit 31)                                    */
#define CLKGEN_CLOCKENSTAT_HFRCCLKEN_Msk  (0x80000000UL)            /*!< HFRCCLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKENSTAT_XTALCLKOUTEN_Pos (30UL)                  /*!< XTALCLKOUTEN (Bit 30)                                 */
#define CLKGEN_CLOCKENSTAT_XTALCLKOUTEN_Msk (0x40000000UL)          /*!< XTALCLKOUTEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKENSTAT_RTCOSEL_Pos    (29UL)                    /*!< RTCOSEL (Bit 29)                                      */
#define CLKGEN_CLOCKENSTAT_RTCOSEL_Msk    (0x20000000UL)            /*!< RTCOSEL (Bitfield-Mask: 0x01)                         */
#define CLKGEN_CLOCKENSTAT_HFADJEN_Pos    (28UL)                    /*!< HFADJEN (Bit 28)                                      */
#define CLKGEN_CLOCKENSTAT_HFADJEN_Msk    (0x10000000UL)            /*!< HFADJEN (Bitfield-Mask: 0x01)                         */
#define CLKGEN_CLOCKENSTAT_PHFRCCLKEN_Pos (27UL)                    /*!< PHFRCCLKEN (Bit 27)                                   */
#define CLKGEN_CLOCKENSTAT_PHFRCCLKEN_Msk (0x8000000UL)             /*!< PHFRCCLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKENSTAT_PXTALCLKEN_Pos (26UL)                    /*!< PXTALCLKEN (Bit 26)                                   */
#define CLKGEN_CLOCKENSTAT_PXTALCLKEN_Msk (0x4000000UL)             /*!< PXTALCLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKENSTAT_SECURERTCOSEL_Pos (25UL)                 /*!< SECURERTCOSEL (Bit 25)                                */
#define CLKGEN_CLOCKENSTAT_SECURERTCOSEL_Msk (0x2000000UL)          /*!< SECURERTCOSEL (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKENSTAT_AXICLKEN_Pos   (24UL)                    /*!< AXICLKEN (Bit 24)                                     */
#define CLKGEN_CLOCKENSTAT_AXICLKEN_Msk   (0x1000000UL)             /*!< AXICLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKENSTAT_I3CREFCLKEN_Pos (23UL)                   /*!< I3CREFCLKEN (Bit 23)                                  */
#define CLKGEN_CLOCKENSTAT_I3CREFCLKEN_Msk (0x800000UL)             /*!< I3CREFCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKENSTAT_MCUCLKEN_Pos   (22UL)                    /*!< MCUCLKEN (Bit 22)                                     */
#define CLKGEN_CLOCKENSTAT_MCUCLKEN_Msk   (0x400000UL)              /*!< MCUCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKENSTAT_STCLKEN_Pos    (21UL)                    /*!< STCLKEN (Bit 21)                                      */
#define CLKGEN_CLOCKENSTAT_STCLKEN_Msk    (0x200000UL)              /*!< STCLKEN (Bitfield-Mask: 0x01)                         */
/* =====================================================  CLOCKEN2STAT  ====================================================== */
#define CLKGEN_CLOCKEN2STAT_NPCLKEN_Pos   (30UL)                    /*!< NPCLKEN (Bit 30)                                      */
#define CLKGEN_CLOCKEN2STAT_NPCLKEN_Msk   (0x40000000UL)            /*!< NPCLKEN (Bitfield-Mask: 0x01)                         */
#define CLKGEN_CLOCKEN2STAT_RWLPCLKEN_Pos (29UL)                    /*!< RWLPCLKEN (Bit 29)                                    */
#define CLKGEN_CLOCKEN2STAT_RWLPCLKEN_Msk (0x20000000UL)            /*!< RWLPCLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN2STAT_APBI3CCLKEN_Pos (28UL)                  /*!< APBI3CCLKEN (Bit 28)                                  */
#define CLKGEN_CLOCKEN2STAT_APBI3CCLKEN_Msk (0x10000000UL)          /*!< APBI3CCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_CM4WDTCLKEN_Pos (27UL)                  /*!< CM4WDTCLKEN (Bit 27)                                  */
#define CLKGEN_CLOCKEN2STAT_CM4WDTCLKEN_Msk (0x8000000UL)           /*!< CM4WDTCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_DISPCLKEN_Pos (26UL)                    /*!< DISPCLKEN (Bit 26)                                    */
#define CLKGEN_CLOCKEN2STAT_DISPCLKEN_Msk (0x4000000UL)             /*!< DISPCLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN2STAT_IOM0CLKEN_Pos (25UL)                    /*!< IOM0CLKEN (Bit 25)                                    */
#define CLKGEN_CLOCKEN2STAT_IOM0CLKEN_Msk (0x2000000UL)             /*!< IOM0CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN2STAT_GFXCLKEN_Pos  (24UL)                    /*!< GFXCLKEN (Bit 24)                                     */
#define CLKGEN_CLOCKEN2STAT_GFXCLKEN_Msk  (0x1000000UL)             /*!< GFXCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN2STAT_DSPPDMCLKEN_Pos (23UL)                  /*!< DSPPDMCLKEN (Bit 23)                                  */
#define CLKGEN_CLOCKEN2STAT_DSPPDMCLKEN_Msk (0x800000UL)            /*!< DSPPDMCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0REFCLKEN_Pos (22UL)              /*!< DSPI2S0REFCLKEN (Bit 22)                              */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0REFCLKEN_Msk (0x400000UL)        /*!< DSPI2S0REFCLKEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0CLKEN_Pos (21UL)                 /*!< DSPI2S0CLKEN (Bit 21)                                 */
#define CLKGEN_CLOCKEN2STAT_DSPI2S0CLKEN_Msk (0x200000UL)           /*!< DSPI2S0CLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBDISPCLKEN_Pos (20UL)                 /*!< APBDISPCLKEN (Bit 20)                                 */
#define CLKGEN_CLOCKEN2STAT_APBDISPCLKEN_Msk (0x100000UL)           /*!< APBDISPCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBUSBCLKEN_Pos (19UL)                  /*!< APBUSBCLKEN (Bit 19)                                  */
#define CLKGEN_CLOCKEN2STAT_APBUSBCLKEN_Msk (0x80000UL)             /*!< APBUSBCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBSDIO1CLKEN_Pos (18UL)                /*!< APBSDIO1CLKEN (Bit 18)                                */
#define CLKGEN_CLOCKEN2STAT_APBSDIO1CLKEN_Msk (0x40000UL)           /*!< APBSDIO1CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBSDIO0CLKEN_Pos (17UL)                /*!< APBSDIO0CLKEN (Bit 17)                                */
#define CLKGEN_CLOCKEN2STAT_APBSDIO0CLKEN_Msk (0x20000UL)           /*!< APBSDIO0CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI3CLKEN_Pos (16UL)                /*!< APBMSPI3CLKEN (Bit 16)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI3CLKEN_Msk (0x10000UL)           /*!< APBMSPI3CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI2CLKEN_Pos (15UL)                /*!< APBMSPI2CLKEN (Bit 15)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI2CLKEN_Msk (0x8000UL)            /*!< APBMSPI2CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI1CLKEN_Pos (14UL)                /*!< APBMSPI1CLKEN (Bit 14)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI1CLKEN_Msk (0x4000UL)            /*!< APBMSPI1CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBMSPI0CLKEN_Pos (13UL)                /*!< APBMSPI0CLKEN (Bit 13)                                */
#define CLKGEN_CLOCKEN2STAT_APBMSPI0CLKEN_Msk (0x2000UL)            /*!< APBMSPI0CLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLOCKEN2STAT_APBIOSCLKEN_Pos (12UL)                  /*!< APBIOSCLKEN (Bit 12)                                  */
#define CLKGEN_CLOCKEN2STAT_APBIOSCLKEN_Msk (0x1000UL)              /*!< APBIOSCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBHCPCCLKEN_Pos (11UL)                 /*!< APBHCPCCLKEN (Bit 11)                                 */
#define CLKGEN_CLOCKEN2STAT_APBHCPCCLKEN_Msk (0x800UL)              /*!< APBHCPCCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBHCPBCLKEN_Pos (10UL)                 /*!< APBHCPBCLKEN (Bit 10)                                 */
#define CLKGEN_CLOCKEN2STAT_APBHCPBCLKEN_Msk (0x400UL)              /*!< APBHCPBCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBHCPACLKEN_Pos (9UL)                  /*!< APBHCPACLKEN (Bit 9)                                  */
#define CLKGEN_CLOCKEN2STAT_APBHCPACLKEN_Msk (0x200UL)              /*!< APBHCPACLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLOCKEN2STAT_APBGFXCLKEN_Pos (8UL)                   /*!< APBGFXCLKEN (Bit 8)                                   */
#define CLKGEN_CLOCKEN2STAT_APBGFXCLKEN_Msk (0x100UL)               /*!< APBGFXCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBCRYPTOCLKEN_Pos (7UL)                /*!< APBCRYPTOCLKEN (Bit 7)                                */
#define CLKGEN_CLOCKEN2STAT_APBCRYPTOCLKEN_Msk (0x80UL)             /*!< APBCRYPTOCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN2STAT_APBAUDCLKEN_Pos (6UL)                   /*!< APBAUDCLKEN (Bit 6)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAUDCLKEN_Msk (0x40UL)                /*!< APBAUDCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAPBCLKEN_Pos (5UL)                   /*!< APBAPBCLKEN (Bit 5)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAPBCLKEN_Msk (0x20UL)                /*!< APBAPBCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAOLCLKEN_Pos (4UL)                   /*!< APBAOLCLKEN (Bit 4)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAOLCLKEN_Msk (0x10UL)                /*!< APBAOLCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBAOHCLKEN_Pos (3UL)                   /*!< APBAOHCLKEN (Bit 3)                                   */
#define CLKGEN_CLOCKEN2STAT_APBAOHCLKEN_Msk (0x8UL)                 /*!< APBAOHCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN2STAT_APBACTIVITYCLKEN_Pos (2UL)              /*!< APBACTIVITYCLKEN (Bit 2)                              */
#define CLKGEN_CLOCKEN2STAT_APBACTIVITYCLKEN_Msk (0x4UL)            /*!< APBACTIVITYCLKEN (Bitfield-Mask: 0x01)                */
#define CLKGEN_CLOCKEN2STAT_ADCCLKEN_Pos  (1UL)                     /*!< ADCCLKEN (Bit 1)                                      */
#define CLKGEN_CLOCKEN2STAT_ADCCLKEN_Msk  (0x2UL)                   /*!< ADCCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN2STAT_TRACECLKEN_Pos (0UL)                    /*!< TRACECLKEN (Bit 0)                                    */
#define CLKGEN_CLOCKEN2STAT_TRACECLKEN_Msk (0x1UL)                  /*!< TRACECLKEN (Bitfield-Mask: 0x01)                      */
/* =====================================================  CLOCKEN3STAT  ====================================================== */
#define CLKGEN_CLOCKEN3STAT_SECURERTCCLKEN_Pos (23UL)               /*!< SECURERTCCLKEN (Bit 23)                               */
#define CLKGEN_CLOCKEN3STAT_SECURERTCCLKEN_Msk (0x800000UL)         /*!< SECURERTCCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN3STAT_SECUREWDTCLKEN_Pos (22UL)               /*!< SECUREWDTCLKEN (Bit 22)                               */
#define CLKGEN_CLOCKEN3STAT_SECUREWDTCLKEN_Msk (0x400000UL)         /*!< SECUREWDTCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN3STAT_XTALENABLED_Pos (21UL)                  /*!< XTALENABLED (Bit 21)                                  */
#define CLKGEN_CLOCKEN3STAT_XTALENABLED_Msk (0x200000UL)            /*!< XTALENABLED (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_WDTCLKEN_Pos  (20UL)                    /*!< WDTCLKEN (Bit 20)                                     */
#define CLKGEN_CLOCKEN3STAT_WDTCLKEN_Msk  (0x100000UL)              /*!< WDTCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN3STAT_USBREFCLKEN_Pos (19UL)                  /*!< USBREFCLKEN (Bit 19)                                  */
#define CLKGEN_CLOCKEN3STAT_USBREFCLKEN_Msk (0x80000UL)             /*!< USBREFCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_UART1CLKEN_Pos (16UL)                   /*!< UART1CLKEN (Bit 16)                                   */
#define CLKGEN_CLOCKEN3STAT_UART1CLKEN_Msk (0x10000UL)              /*!< UART1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_UART0CLKEN_Pos (15UL)                   /*!< UART0CLKEN (Bit 15)                                   */
#define CLKGEN_CLOCKEN3STAT_UART0CLKEN_Msk (0x8000UL)               /*!< UART0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_SDIO1CLKEN_Pos (14UL)                   /*!< SDIO1CLKEN (Bit 14)                                   */
#define CLKGEN_CLOCKEN3STAT_SDIO1CLKEN_Msk (0x4000UL)               /*!< SDIO1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_SDIO0CLKEN_Pos (13UL)                   /*!< SDIO0CLKEN (Bit 13)                                   */
#define CLKGEN_CLOCKEN3STAT_SDIO0CLKEN_Msk (0x2000UL)               /*!< SDIO0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_RTCCLKEN_Pos  (12UL)                    /*!< RTCCLKEN (Bit 12)                                     */
#define CLKGEN_CLOCKEN3STAT_RTCCLKEN_Msk  (0x1000UL)                /*!< RTCCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLOCKEN3STAT_RSTGENPOSCLKEN_Pos (11UL)               /*!< RSTGENPOSCLKEN (Bit 11)                               */
#define CLKGEN_CLOCKEN3STAT_RSTGENPOSCLKEN_Msk (0x800UL)            /*!< RSTGENPOSCLKEN (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLOCKEN3STAT_RSTGENCLKEN_Pos (10UL)                  /*!< RSTGENCLKEN (Bit 10)                                  */
#define CLKGEN_CLOCKEN3STAT_RSTGENCLKEN_Msk (0x400UL)               /*!< RSTGENCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_OTPXTLCLKEN_Pos (9UL)                   /*!< OTPXTLCLKEN (Bit 9)                                   */
#define CLKGEN_CLOCKEN3STAT_OTPXTLCLKEN_Msk (0x200UL)               /*!< OTPXTLCLKEN (Bitfield-Mask: 0x01)                     */
#define CLKGEN_CLOCKEN3STAT_MSPI3CLKEN_Pos (8UL)                    /*!< MSPI3CLKEN (Bit 8)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI3CLKEN_Msk (0x100UL)                /*!< MSPI3CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI2CLKEN_Pos (7UL)                    /*!< MSPI2CLKEN (Bit 7)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI2CLKEN_Msk (0x80UL)                 /*!< MSPI2CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI1CLKEN_Pos (6UL)                    /*!< MSPI1CLKEN (Bit 6)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI1CLKEN_Msk (0x40UL)                 /*!< MSPI1CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_MSPI0CLKEN_Pos (5UL)                    /*!< MSPI0CLKEN (Bit 5)                                    */
#define CLKGEN_CLOCKEN3STAT_MSPI0CLKEN_Msk (0x20UL)                 /*!< MSPI0CLKEN (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLOCKEN3STAT_IOM5CLKEN_Pos (4UL)                     /*!< IOM5CLKEN (Bit 4)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM5CLKEN_Msk (0x10UL)                  /*!< IOM5CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM4CLKEN_Pos (3UL)                     /*!< IOM4CLKEN (Bit 3)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM4CLKEN_Msk (0x8UL)                   /*!< IOM4CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM3CLKEN_Pos (2UL)                     /*!< IOM3CLKEN (Bit 2)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM3CLKEN_Msk (0x4UL)                   /*!< IOM3CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM2CLKEN_Pos (1UL)                     /*!< IOM2CLKEN (Bit 1)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM2CLKEN_Msk (0x2UL)                   /*!< IOM2CLKEN (Bitfield-Mask: 0x01)                       */
#define CLKGEN_CLOCKEN3STAT_IOM1CLKEN_Pos (0UL)                     /*!< IOM1CLKEN (Bit 0)                                     */
#define CLKGEN_CLOCKEN3STAT_IOM1CLKEN_Msk (0x1UL)                   /*!< IOM1CLKEN (Bitfield-Mask: 0x01)                       */
/* =========================================================  MISC  ========================================================== */
#define CLKGEN_MISC_CLKGENMISCSPARE_Pos   (25UL)                    /*!< CLKGENMISCSPARE (Bit 25)                              */
#define CLKGEN_MISC_CLKGENMISCSPARE_Msk   (0x2000000UL)             /*!< CLKGENMISCSPARE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Pos   (24UL)                    /*!< HFRC96TRUNKGATE (Bit 24)                              */
#define CLKGEN_MISC_HFRC96TRUNKGATE_Msk   (0x1000000UL)             /*!< HFRC96TRUNKGATE (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Pos (23UL)                    /*!< HFRCFUNCCLKGATEEN (Bit 23)                            */
#define CLKGEN_MISC_HFRCFUNCCLKGATEEN_Msk (0x800000UL)              /*!< HFRCFUNCCLKGATEEN (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Pos (22UL)                 /*!< ETMTRACECLKCLKGATEEN (Bit 22)                         */
#define CLKGEN_MISC_ETMTRACECLKCLKGATEEN_Msk (0x400000UL)           /*!< ETMTRACECLKCLKGATEEN (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Pos (21UL)                /*!< APBDMACPUCLKCLKGATEEN (Bit 21)                        */
#define CLKGEN_MISC_APBDMACPUCLKCLKGATEEN_Msk (0x200000UL)          /*!< APBDMACPUCLKCLKGATEEN (Bitfield-Mask: 0x01)           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Pos (20UL)                   /*!< GFXAXICLKCLKGATEEN (Bit 20)                           */
#define CLKGEN_MISC_GFXAXICLKCLKGATEEN_Msk (0x100000UL)             /*!< GFXAXICLKCLKGATEEN (Bitfield-Mask: 0x01)              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Pos   (19UL)                    /*!< GFXCLKCLKGATEEN (Bit 19)                              */
#define CLKGEN_MISC_GFXCLKCLKGATEEN_Msk   (0x80000UL)               /*!< GFXCLKCLKGATEEN (Bitfield-Mask: 0x01)                 */
#define CLKGEN_MISC_CM4DAXICLKGATEEN_Pos  (18UL)                    /*!< CM4DAXICLKGATEEN (Bit 18)                             */
#define CLKGEN_MISC_CM4DAXICLKGATEEN_Msk  (0x40000UL)               /*!< CM4DAXICLKGATEEN (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Pos (17UL)                  /*!< PWRONCLKENUSBREFCLK (Bit 17)                          */
#define CLKGEN_MISC_PWRONCLKENUSBREFCLK_Msk (0x20000UL)             /*!< PWRONCLKENUSBREFCLK (Bitfield-Mask: 0x01)             */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Pos (16UL)                 /*!< PWRONCLKENI2S0REFCLK (Bit 16)                         */
#define CLKGEN_MISC_PWRONCLKENI2S0REFCLK_Msk (0x10000UL)            /*!< PWRONCLKENI2S0REFCLK (Bitfield-Mask: 0x01)            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Pos (15UL)                    /*!< AXIXACLKENOVRRIDE (Bit 15)                            */
#define CLKGEN_MISC_AXIXACLKENOVRRIDE_Msk (0x8000UL)                /*!< AXIXACLKENOVRRIDE (Bitfield-Mask: 0x01)               */
#define CLKGEN_MISC_PWRONCLKENI2S0_Pos    (14UL)                    /*!< PWRONCLKENI2S0 (Bit 14)                               */
