AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define CLKGEN_MISC_PWRONCLKENI2S0_Msk    (0x4000UL)                /*!< PWRONCLKENI2S0 (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Pos  (13UL)                    /*!< PWRONCLKENCRYPTO (Bit 13)                             */
#define CLKGEN_MISC_PWRONCLKENCRYPTO_Msk  (0x2000UL)                /*!< PWRONCLKENCRYPTO (Bitfield-Mask: 0x01)                */
#define CLKGEN_MISC_PWRONCLKENSDIO_Pos    (12UL)                    /*!< PWRONCLKENSDIO (Bit 12)                               */
#define CLKGEN_MISC_PWRONCLKENSDIO_Msk    (0x1000UL)                /*!< PWRONCLKENSDIO (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_PWRONCLKENUSB_Pos     (11UL)                    /*!< PWRONCLKENUSB (Bit 11)                                */
#define CLKGEN_MISC_PWRONCLKENUSB_Msk     (0x800UL)                 /*!< PWRONCLKENUSB (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENGFX_Pos     (10UL)                    /*!< PWRONCLKENGFX (Bit 10)                                */
#define CLKGEN_MISC_PWRONCLKENGFX_Msk     (0x400UL)                 /*!< PWRONCLKENGFX (Bitfield-Mask: 0x01)                   */
#define CLKGEN_MISC_PWRONCLKENDISP_Pos    (9UL)                     /*!< PWRONCLKENDISP (Bit 9)                                */
#define CLKGEN_MISC_PWRONCLKENDISP_Msk    (0x200UL)                 /*!< PWRONCLKENDISP (Bitfield-Mask: 0x01)                  */
#define CLKGEN_MISC_FRCBURSTOFF_Pos       (1UL)                     /*!< FRCBURSTOFF (Bit 1)                                   */
#define CLKGEN_MISC_FRCBURSTOFF_Msk       (0x2UL)                   /*!< FRCBURSTOFF (Bitfield-Mask: 0x01)                     */
#define CLKGEN_MISC_FRCHFRC_Pos           (0UL)                     /*!< FRCHFRC (Bit 0)                                       */
#define CLKGEN_MISC_FRCHFRC_Msk           (0x1UL)                   /*!< FRCHFRC (Bitfield-Mask: 0x01)                         */
/* =======================================================  LFRCCTRL  ======================================================== */
#define CLKGEN_LFRCCTRL_LFRCPWD_Pos       (1UL)                     /*!< LFRCPWD (Bit 1)                                       */
#define CLKGEN_LFRCCTRL_LFRCPWD_Msk       (0x2UL)                   /*!< LFRCPWD (Bitfield-Mask: 0x01)                         */
#define CLKGEN_LFRCCTRL_LFRCOUT_Pos       (0UL)                     /*!< LFRCOUT (Bit 0)                                       */
#define CLKGEN_LFRCCTRL_LFRCOUT_Msk       (0x1UL)                   /*!< LFRCOUT (Bitfield-Mask: 0x01)                         */
/* =====================================================  CLKGENSPARES  ====================================================== */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Pos (0UL)                  /*!< CLKGENSPARES (Bit 0)                                  */
#define CLKGEN_CLKGENSPARES_CLKGENSPARES_Msk (0xffffffffUL)         /*!< CLKGENSPARES (Bitfield-Mask: 0xffffffff)              */
/* ===================================================  HFRCIDLECOUNTERS  ==================================================== */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Pos (12UL)             /*!< UPDATEENABLE (Bit 12)                                 */
#define CLKGEN_HFRCIDLECOUNTERS_UPDATEENABLE_Msk (0x1000UL)         /*!< UPDATEENABLE (Bitfield-Mask: 0x01)                    */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Pos (6UL)           /*!< HFRCCLKREQDELAY (Bit 6)                               */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCCLKREQDELAY_Msk (0xfc0UL)       /*!< HFRCCLKREQDELAY (Bitfield-Mask: 0x3f)                 */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Pos (0UL)          /*!< HFRCPWRDOWNDELAY (Bit 0)                              */
#define CLKGEN_HFRCIDLECOUNTERS_HFRCPWRDOWNDELAY_Msk (0x3fUL)       /*!< HFRCPWRDOWNDELAY (Bitfield-Mask: 0x3f)                */
/* =====================================================  MSPIIOCLKCTRL  ===================================================== */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Pos (11UL)               /*!< MSPI2IOCLKSEL (Bit 11)                                */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKSEL_Msk (0x7800UL)           /*!< MSPI2IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Pos (10UL)                /*!< MSPI2IOCLKEN (Bit 10)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI2IOCLKEN_Msk (0x400UL)             /*!< MSPI2IOCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Pos (6UL)                /*!< MSPI1IOCLKSEL (Bit 6)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKSEL_Msk (0x3c0UL)            /*!< MSPI1IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Pos (5UL)                 /*!< MSPI1IOCLKEN (Bit 5)                                  */
#define CLKGEN_MSPIIOCLKCTRL_MSPI1IOCLKEN_Msk (0x20UL)              /*!< MSPI1IOCLKEN (Bitfield-Mask: 0x01)                    */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Pos (1UL)                /*!< MSPI0IOCLKSEL (Bit 1)                                 */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKSEL_Msk (0x1eUL)             /*!< MSPI0IOCLKSEL (Bitfield-Mask: 0x0f)                   */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Pos (0UL)                 /*!< MSPI0IOCLKEN (Bit 0)                                  */
#define CLKGEN_MSPIIOCLKCTRL_MSPI0IOCLKEN_Msk (0x1UL)               /*!< MSPI0IOCLKEN (Bitfield-Mask: 0x01)                    */
/* ========================================================  CLKCTRL  ======================================================== */
#define CLKGEN_CLKCTRL_I3CCLKEN_Pos       (11UL)                    /*!< I3CCLKEN (Bit 11)                                     */
#define CLKGEN_CLKCTRL_I3CCLKEN_Msk       (0x800UL)                 /*!< I3CCLKEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLKCTRL_PLLVCOEN_Pos       (10UL)                    /*!< PLLVCOEN (Bit 10)                                     */
#define CLKGEN_CLKCTRL_PLLVCOEN_Msk       (0x400UL)                 /*!< PLLVCOEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLKCTRL_PLLDIVEN_Pos       (9UL)                     /*!< PLLDIVEN (Bit 9)                                      */
#define CLKGEN_CLKCTRL_PLLDIVEN_Msk       (0x200UL)                 /*!< PLLDIVEN (Bitfield-Mask: 0x01)                        */
#define CLKGEN_CLKCTRL_XTHSMUXSEL_Pos     (8UL)                     /*!< XTHSMUXSEL (Bit 8)                                    */
#define CLKGEN_CLKCTRL_XTHSMUXSEL_Msk     (0x100UL)                 /*!< XTHSMUXSEL (Bitfield-Mask: 0x01)                      */
#define CLKGEN_CLKCTRL_DISPCTRLCLKEN_Pos  (7UL)                     /*!< DISPCTRLCLKEN (Bit 7)                                 */
#define CLKGEN_CLKCTRL_DISPCTRLCLKEN_Msk  (0x80UL)                  /*!< DISPCTRLCLKEN (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_MCUCLKFORCEON_Pos  (6UL)                     /*!< MCUCLKFORCEON (Bit 6)                                 */
#define CLKGEN_CLKCTRL_MCUCLKFORCEON_Msk  (0x40UL)                  /*!< MCUCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_IWICCLKFORCEON_Pos (5UL)                     /*!< IWICCLKFORCEON (Bit 5)                                */
#define CLKGEN_CLKCTRL_IWICCLKFORCEON_Msk (0x20UL)                  /*!< IWICCLKFORCEON (Bitfield-Mask: 0x01)                  */
#define CLKGEN_CLKCTRL_DBGCLKFORCEON_Pos  (4UL)                     /*!< DBGCLKFORCEON (Bit 4)                                 */
#define CLKGEN_CLKCTRL_DBGCLKFORCEON_Msk  (0x10UL)                  /*!< DBGCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_PMUCLKFORCEON_Pos  (3UL)                     /*!< PMUCLKFORCEON (Bit 3)                                 */
#define CLKGEN_CLKCTRL_PMUCLKFORCEON_Msk  (0x8UL)                   /*!< PMUCLKFORCEON (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_STCLKFORCEON_Pos   (2UL)                     /*!< STCLKFORCEON (Bit 2)                                  */
#define CLKGEN_CLKCTRL_STCLKFORCEON_Msk   (0x4UL)                   /*!< STCLKFORCEON (Bitfield-Mask: 0x01)                    */
#define CLKGEN_CLKCTRL_GFXCORECLKSEL_Pos  (1UL)                     /*!< GFXCORECLKSEL (Bit 1)                                 */
#define CLKGEN_CLKCTRL_GFXCORECLKSEL_Msk  (0x2UL)                   /*!< GFXCORECLKSEL (Bitfield-Mask: 0x01)                   */
#define CLKGEN_CLKCTRL_GFXCORECLKEN_Pos   (0UL)                     /*!< GFXCORECLKEN (Bit 0)                                  */
#define CLKGEN_CLKCTRL_GFXCORECLKEN_Msk   (0x1UL)                   /*!< GFXCORECLKEN (Bitfield-Mask: 0x01)                    */


/* =========================================================================================================================== */
/* ================                                          CM55IPC                                          ================ */
/* =========================================================================================================================== */

