AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================================  M2DDATA  ======================================================== */
#define CM55IPC_M2DDATA_M2DMESSAGE_Pos    (0UL)                     /*!< M2DMESSAGE (Bit 0)                                    */
#define CM55IPC_M2DDATA_M2DMESSAGE_Msk    (0xffffffffUL)            /*!< M2DMESSAGE (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  D2MDATA  ======================================================== */
#define CM55IPC_D2MDATA_D2MMESSAGE_Pos    (0UL)                     /*!< D2MMESSAGE (Bit 0)                                    */
#define CM55IPC_D2MDATA_D2MMESSAGE_Msk    (0xffffffffUL)            /*!< D2MMESSAGE (Bitfield-Mask: 0xffffffff)                */
/* ========================================================  STATUS  ========================================================= */
#define CM55IPC_STATUS_M2DPEND_Pos        (20UL)                    /*!< M2DPEND (Bit 20)                                      */
#define CM55IPC_STATUS_M2DPEND_Msk        (0x3f00000UL)             /*!< M2DPEND (Bitfield-Mask: 0x3f)                         */
#define CM55IPC_STATUS_M2DTHRESHOLDACTIVE_Pos (18UL)                /*!< M2DTHRESHOLDACTIVE (Bit 18)                           */
#define CM55IPC_STATUS_M2DTHRESHOLDACTIVE_Msk (0x40000UL)           /*!< M2DTHRESHOLDACTIVE (Bitfield-Mask: 0x01)              */
#define CM55IPC_STATUS_M2DFULL_Pos        (17UL)                    /*!< M2DFULL (Bit 17)                                      */
#define CM55IPC_STATUS_M2DFULL_Msk        (0x20000UL)               /*!< M2DFULL (Bitfield-Mask: 0x01)                         */
#define CM55IPC_STATUS_M2DEMPTY_Pos       (16UL)                    /*!< M2DEMPTY (Bit 16)                                     */
#define CM55IPC_STATUS_M2DEMPTY_Msk       (0x10000UL)               /*!< M2DEMPTY (Bitfield-Mask: 0x01)                        */
#define CM55IPC_STATUS_D2MPEND_Pos        (4UL)                     /*!< D2MPEND (Bit 4)                                       */
#define CM55IPC_STATUS_D2MPEND_Msk        (0x3f0UL)                 /*!< D2MPEND (Bitfield-Mask: 0x3f)                         */
#define CM55IPC_STATUS_D2MTHRESHOLDACTIVE_Pos (2UL)                 /*!< D2MTHRESHOLDACTIVE (Bit 2)                            */
#define CM55IPC_STATUS_D2MTHRESHOLDACTIVE_Msk (0x4UL)               /*!< D2MTHRESHOLDACTIVE (Bitfield-Mask: 0x01)              */
#define CM55IPC_STATUS_D2MFULL_Pos        (1UL)                     /*!< D2MFULL (Bit 1)                                       */
#define CM55IPC_STATUS_D2MFULL_Msk        (0x2UL)                   /*!< D2MFULL (Bitfield-Mask: 0x01)                         */
#define CM55IPC_STATUS_D2MEMPTY_Pos       (0UL)                     /*!< D2MEMPTY (Bit 0)                                      */
#define CM55IPC_STATUS_D2MEMPTY_Msk       (0x1UL)                   /*!< D2MEMPTY (Bitfield-Mask: 0x01)                        */
/* =========================================================  M2DIT  ========================================================= */
#define CM55IPC_M2DIT_M2DTHRESHOLD_Pos    (0UL)                     /*!< M2DTHRESHOLD (Bit 0)                                  */
#define CM55IPC_M2DIT_M2DTHRESHOLD_Msk    (0x1fUL)                  /*!< M2DTHRESHOLD (Bitfield-Mask: 0x1f)                    */
/* =========================================================  M2DIS  ========================================================= */
#define CM55IPC_M2DIS_M2DERRORIRQ_Pos     (1UL)                     /*!< M2DERRORIRQ (Bit 1)                                   */
#define CM55IPC_M2DIS_M2DERRORIRQ_Msk     (0x2UL)                   /*!< M2DERRORIRQ (Bitfield-Mask: 0x01)                     */
#define CM55IPC_M2DIS_M2DTHRESHOLDIRQ_Pos (0UL)                     /*!< M2DTHRESHOLDIRQ (Bit 0)                               */
#define CM55IPC_M2DIS_M2DTHRESHOLDIRQ_Msk (0x1UL)                   /*!< M2DTHRESHOLDIRQ (Bitfield-Mask: 0x01)                 */
/* =========================================================  M2DIE  ========================================================= */
#define CM55IPC_M2DIE_M2DERRORIRQEN_Pos   (1UL)                     /*!< M2DERRORIRQEN (Bit 1)                                 */
#define CM55IPC_M2DIE_M2DERRORIRQEN_Msk   (0x2UL)                   /*!< M2DERRORIRQEN (Bitfield-Mask: 0x01)                   */
#define CM55IPC_M2DIE_M2DTHRESHOLDIRQEN_Pos (0UL)                   /*!< M2DTHRESHOLDIRQEN (Bit 0)                             */
#define CM55IPC_M2DIE_M2DTHRESHOLDIRQEN_Msk (0x1UL)                 /*!< M2DTHRESHOLDIRQEN (Bitfield-Mask: 0x01)               */
/* =======================================================  D2MERROR  ======================================================== */
#define CM55IPC_D2MERROR_IPCINIT_Pos      (3UL)                     /*!< IPCINIT (Bit 3)                                       */
#define CM55IPC_D2MERROR_IPCINIT_Msk      (0x8UL)                   /*!< IPCINIT (Bitfield-Mask: 0x01)                         */
#define CM55IPC_D2MERROR_M2DFULLERROR_Pos (2UL)                     /*!< M2DFULLERROR (Bit 2)                                  */
#define CM55IPC_D2MERROR_M2DFULLERROR_Msk (0x4UL)                   /*!< M2DFULLERROR (Bitfield-Mask: 0x01)                    */
#define CM55IPC_D2MERROR_D2MFULLERROR_Pos (1UL)                     /*!< D2MFULLERROR (Bit 1)                                  */
#define CM55IPC_D2MERROR_D2MFULLERROR_Msk (0x2UL)                   /*!< D2MFULLERROR (Bitfield-Mask: 0x01)                    */
#define CM55IPC_D2MERROR_D2MEMPTYERROR_Pos (0UL)                    /*!< D2MEMPTYERROR (Bit 0)                                 */
#define CM55IPC_D2MERROR_D2MEMPTYERROR_Msk (0x1UL)                  /*!< D2MEMPTYERROR (Bitfield-Mask: 0x01)                   */
/* =========================================================  D2MIT  ========================================================= */
#define CM55IPC_D2MIT_D2MTHRESHOLD_Pos    (0UL)                     /*!< D2MTHRESHOLD (Bit 0)                                  */
#define CM55IPC_D2MIT_D2MTHRESHOLD_Msk    (0x1fUL)                  /*!< D2MTHRESHOLD (Bitfield-Mask: 0x1f)                    */
/* =========================================================  D2MIS  ========================================================= */
#define CM55IPC_D2MIS_D2MERRORIRQ_Pos     (1UL)                     /*!< D2MERRORIRQ (Bit 1)                                   */
#define CM55IPC_D2MIS_D2MERRORIRQ_Msk     (0x2UL)                   /*!< D2MERRORIRQ (Bitfield-Mask: 0x01)                     */
#define CM55IPC_D2MIS_D2MTHRESHOLDIRQ_Pos (0UL)                     /*!< D2MTHRESHOLDIRQ (Bit 0)                               */
#define CM55IPC_D2MIS_D2MTHRESHOLDIRQ_Msk (0x1UL)                   /*!< D2MTHRESHOLDIRQ (Bitfield-Mask: 0x01)                 */
/* =========================================================  D2MIE  ========================================================= */
#define CM55IPC_D2MIE_D2MERRORIRQEN_Pos   (1UL)                     /*!< D2MERRORIRQEN (Bit 1)                                 */
#define CM55IPC_D2MIE_D2MERRORIRQEN_Msk   (0x2UL)                   /*!< D2MERRORIRQEN (Bitfield-Mask: 0x01)                   */
#define CM55IPC_D2MIE_D2MTHRESHOLDIRQEN_Pos (0UL)                   /*!< D2MTHRESHOLDIRQEN (Bit 0)                             */
#define CM55IPC_D2MIE_D2MTHRESHOLDIRQEN_Msk (0x1UL)                 /*!< D2MTHRESHOLDIRQEN (Bitfield-Mask: 0x01)               */


/* =========================================================================================================================== */
/* ================                                            CRM                                            ================ */
/* =========================================================================================================================== */

