AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================================  ADCCRM  ========================================================= */
#define CRM_ADCCRM_ADCCLKDIV_Pos          (8UL)                     /*!< ADCCLKDIV (Bit 8)                                     */
#define CRM_ADCCRM_ADCCLKDIV_Msk          (0x300UL)                 /*!< ADCCLKDIV (Bitfield-Mask: 0x03)                       */
#define CRM_ADCCRM_ADCCLKSEL_Pos          (4UL)                     /*!< ADCCLKSEL (Bit 4)                                     */
#define CRM_ADCCRM_ADCCLKSEL_Msk          (0x10UL)                  /*!< ADCCLKSEL (Bitfield-Mask: 0x01)                       */
#define CRM_ADCCRM_ADCCRMRSTN_Pos         (3UL)                     /*!< ADCCRMRSTN (Bit 3)                                    */
#define CRM_ADCCRM_ADCCRMRSTN_Msk         (0x8UL)                   /*!< ADCCRMRSTN (Bitfield-Mask: 0x01)                      */
#define CRM_ADCCRM_ADCRSTN_Pos            (2UL)                     /*!< ADCRSTN (Bit 2)                                       */
#define CRM_ADCCRM_ADCRSTN_Msk            (0x4UL)                   /*!< ADCRSTN (Bitfield-Mask: 0x01)                         */
#define CRM_ADCCRM_ADCCLKACTIVE_Pos       (1UL)                     /*!< ADCCLKACTIVE (Bit 1)                                  */
#define CRM_ADCCRM_ADCCLKACTIVE_Msk       (0x2UL)                   /*!< ADCCLKACTIVE (Bitfield-Mask: 0x01)                    */
#define CRM_ADCCRM_ADCCLKEN_Pos           (0UL)                     /*!< ADCCLKEN (Bit 0)                                      */
#define CRM_ADCCRM_ADCCLKEN_Msk           (0x1UL)                   /*!< ADCCLKEN (Bitfield-Mask: 0x01)                        */
/* ======================================================  APBDISPCRM  ======================================================= */
#define CRM_APBDISPCRM_APBDISPCRMRSTN_Pos (3UL)                     /*!< APBDISPCRMRSTN (Bit 3)                                */
#define CRM_APBDISPCRM_APBDISPCRMRSTN_Msk (0x8UL)                   /*!< APBDISPCRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_APBDISPCRM_APBDISPRSTN_Pos    (2UL)                     /*!< APBDISPRSTN (Bit 2)                                   */
#define CRM_APBDISPCRM_APBDISPRSTN_Msk    (0x4UL)                   /*!< APBDISPRSTN (Bitfield-Mask: 0x01)                     */
#define CRM_APBDISPCRM_APBDISPCLKACTIVE_Pos (1UL)                   /*!< APBDISPCLKACTIVE (Bit 1)                              */
#define CRM_APBDISPCRM_APBDISPCLKACTIVE_Msk (0x2UL)                 /*!< APBDISPCLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_APBDISPCRM_APBDISPCLKEN_Pos   (0UL)                     /*!< APBDISPCLKEN (Bit 0)                                  */
#define CRM_APBDISPCRM_APBDISPCLKEN_Msk   (0x1UL)                   /*!< APBDISPCLKEN (Bitfield-Mask: 0x01)                    */
/* =====================================================  APBDISPPHYCRM  ===================================================== */
#define CRM_APBDISPPHYCRM_APBDISPPHYCRMRSTN_Pos (3UL)               /*!< APBDISPPHYCRMRSTN (Bit 3)                             */
#define CRM_APBDISPPHYCRM_APBDISPPHYCRMRSTN_Msk (0x8UL)             /*!< APBDISPPHYCRMRSTN (Bitfield-Mask: 0x01)               */
#define CRM_APBDISPPHYCRM_APBDISPPHYRSTN_Pos (2UL)                  /*!< APBDISPPHYRSTN (Bit 2)                                */
#define CRM_APBDISPPHYCRM_APBDISPPHYRSTN_Msk (0x4UL)                /*!< APBDISPPHYRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_APBDISPPHYCRM_APBDISPPHYCLKACTIVE_Pos (1UL)             /*!< APBDISPPHYCLKACTIVE (Bit 1)                           */
#define CRM_APBDISPPHYCRM_APBDISPPHYCLKACTIVE_Msk (0x2UL)           /*!< APBDISPPHYCLKACTIVE (Bitfield-Mask: 0x01)             */
#define CRM_APBDISPPHYCRM_APBDISPPHYCLKEN_Pos (0UL)                 /*!< APBDISPPHYCLKEN (Bit 0)                               */
#define CRM_APBDISPPHYCRM_APBDISPPHYCLKEN_Msk (0x1UL)               /*!< APBDISPPHYCLKEN (Bitfield-Mask: 0x01)                 */
/* ======================================================  APBUARTCRM  ======================================================= */
#define CRM_APBUARTCRM_APBUARTCRMRSTN_Pos (3UL)                     /*!< APBUARTCRMRSTN (Bit 3)                                */
#define CRM_APBUARTCRM_APBUARTCRMRSTN_Msk (0x8UL)                   /*!< APBUARTCRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_APBUARTCRM_APBUARTRSTN_Pos    (2UL)                     /*!< APBUARTRSTN (Bit 2)                                   */
#define CRM_APBUARTCRM_APBUARTRSTN_Msk    (0x4UL)                   /*!< APBUARTRSTN (Bitfield-Mask: 0x01)                     */
#define CRM_APBUARTCRM_APBUARTCLKACTIVE_Pos (1UL)                   /*!< APBUARTCLKACTIVE (Bit 1)                              */
#define CRM_APBUARTCRM_APBUARTCLKACTIVE_Msk (0x2UL)                 /*!< APBUARTCLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_APBUARTCRM_APBUARTCLKEN_Pos   (0UL)                     /*!< APBUARTCLKEN (Bit 0)                                  */
#define CRM_APBUARTCRM_APBUARTCLKEN_Msk   (0x1UL)                   /*!< APBUARTCLKEN (Bitfield-Mask: 0x01)                    */
/* =======================================================  APBI2SCRM  ======================================================= */
#define CRM_APBI2SCRM_APBI2SCLKSEL_Pos    (4UL)                     /*!< APBI2SCLKSEL (Bit 4)                                  */
#define CRM_APBI2SCRM_APBI2SCLKSEL_Msk    (0x10UL)                  /*!< APBI2SCLKSEL (Bitfield-Mask: 0x01)                    */
#define CRM_APBI2SCRM_APBI2SCRMRSTN_Pos   (3UL)                     /*!< APBI2SCRMRSTN (Bit 3)                                 */
#define CRM_APBI2SCRM_APBI2SCRMRSTN_Msk   (0x8UL)                   /*!< APBI2SCRMRSTN (Bitfield-Mask: 0x01)                   */
#define CRM_APBI2SCRM_APBI2SRSTN_Pos      (2UL)                     /*!< APBI2SRSTN (Bit 2)                                    */
#define CRM_APBI2SCRM_APBI2SRSTN_Msk      (0x4UL)                   /*!< APBI2SRSTN (Bitfield-Mask: 0x01)                      */
#define CRM_APBI2SCRM_APBI2SCLKACTIVE_Pos (1UL)                     /*!< APBI2SCLKACTIVE (Bit 1)                               */
#define CRM_APBI2SCRM_APBI2SCLKACTIVE_Msk (0x2UL)                   /*!< APBI2SCLKACTIVE (Bitfield-Mask: 0x01)                 */
#define CRM_APBI2SCRM_APBI2SCLKEN_Pos     (0UL)                     /*!< APBI2SCLKEN (Bit 0)                                   */
#define CRM_APBI2SCRM_APBI2SCLKEN_Msk     (0x1UL)                   /*!< APBI2SCLKEN (Bitfield-Mask: 0x01)                     */
/* =======================================================  APBPDMCRM  ======================================================= */
#define CRM_APBPDMCRM_APBPDMCRMRSTN_Pos   (3UL)                     /*!< APBPDMCRMRSTN (Bit 3)                                 */
#define CRM_APBPDMCRM_APBPDMCRMRSTN_Msk   (0x8UL)                   /*!< APBPDMCRMRSTN (Bitfield-Mask: 0x01)                   */
#define CRM_APBPDMCRM_APBPDMRSTN_Pos      (2UL)                     /*!< APBPDMRSTN (Bit 2)                                    */
#define CRM_APBPDMCRM_APBPDMRSTN_Msk      (0x4UL)                   /*!< APBPDMRSTN (Bitfield-Mask: 0x01)                      */
#define CRM_APBPDMCRM_APBPDMCLKACTIVE_Pos (1UL)                     /*!< APBPDMCLKACTIVE (Bit 1)                               */
#define CRM_APBPDMCRM_APBPDMCLKACTIVE_Msk (0x2UL)                   /*!< APBPDMCLKACTIVE (Bitfield-Mask: 0x01)                 */
#define CRM_APBPDMCRM_APBPDMCLKEN_Pos     (0UL)                     /*!< APBPDMCLKEN (Bit 0)                                   */
#define CRM_APBPDMCRM_APBPDMCLKEN_Msk     (0x1UL)                   /*!< APBPDMCLKEN (Bitfield-Mask: 0x01)                     */
/* =======================================================  APBUSBCRM  ======================================================= */
#define CRM_APBUSBCRM_APBUSBCRMRSTN_Pos   (3UL)                     /*!< APBUSBCRMRSTN (Bit 3)                                 */
#define CRM_APBUSBCRM_APBUSBCRMRSTN_Msk   (0x8UL)                   /*!< APBUSBCRMRSTN (Bitfield-Mask: 0x01)                   */
#define CRM_APBUSBCRM_APBUSBRSTN_Pos      (2UL)                     /*!< APBUSBRSTN (Bit 2)                                    */
#define CRM_APBUSBCRM_APBUSBRSTN_Msk      (0x4UL)                   /*!< APBUSBRSTN (Bitfield-Mask: 0x01)                      */
#define CRM_APBUSBCRM_APBUSBCLKACTIVE_Pos (1UL)                     /*!< APBUSBCLKACTIVE (Bit 1)                               */
#define CRM_APBUSBCRM_APBUSBCLKACTIVE_Msk (0x2UL)                   /*!< APBUSBCLKACTIVE (Bitfield-Mask: 0x01)                 */
#define CRM_APBUSBCRM_APBUSBCLKEN_Pos     (0UL)                     /*!< APBUSBCLKEN (Bit 0)                                   */
#define CRM_APBUSBCRM_APBUSBCLKEN_Msk     (0x1UL)                   /*!< APBUSBCLKEN (Bitfield-Mask: 0x01)                     */
/* ======================================================  DISPCLKCRM  ======================================================= */
#define CRM_DISPCLKCRM_DISPCLKCLKDIV_Pos  (8UL)                     /*!< DISPCLKCLKDIV (Bit 8)                                 */
#define CRM_DISPCLKCRM_DISPCLKCLKDIV_Msk  (0xf00UL)                 /*!< DISPCLKCLKDIV (Bitfield-Mask: 0x0f)                   */
#define CRM_DISPCLKCRM_DISPCLKCLKSEL_Pos  (4UL)                     /*!< DISPCLKCLKSEL (Bit 4)                                 */
#define CRM_DISPCLKCRM_DISPCLKCLKSEL_Msk  (0x30UL)                  /*!< DISPCLKCLKSEL (Bitfield-Mask: 0x03)                   */
#define CRM_DISPCLKCRM_DISPCLKCRMRSTN_Pos (3UL)                     /*!< DISPCLKCRMRSTN (Bit 3)                                */
#define CRM_DISPCLKCRM_DISPCLKCRMRSTN_Msk (0x8UL)                   /*!< DISPCLKCRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_DISPCLKCRM_DISPCLKCLKACTIVE_Pos (1UL)                   /*!< DISPCLKCLKACTIVE (Bit 1)                              */
#define CRM_DISPCLKCRM_DISPCLKCLKACTIVE_Msk (0x2UL)                 /*!< DISPCLKCLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_DISPCLKCRM_DISPCLKCLKEN_Pos   (0UL)                     /*!< DISPCLKCLKEN (Bit 0)                                  */
#define CRM_DISPCLKCRM_DISPCLKCLKEN_Msk   (0x1UL)                   /*!< DISPCLKCLKEN (Bitfield-Mask: 0x01)                    */
/* =====================================================  DPHYPLLREFCRM  ===================================================== */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKDIV_Pos (8UL)                /*!< DPHYPLLREFCLKDIV (Bit 8)                              */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKDIV_Msk (0x700UL)            /*!< DPHYPLLREFCLKDIV (Bitfield-Mask: 0x07)                */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_Pos (4UL)                /*!< DPHYPLLREFCLKSEL (Bit 4)                              */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_Msk (0x70UL)             /*!< DPHYPLLREFCLKSEL (Bitfield-Mask: 0x07)                */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCRMRSTN_Pos (3UL)               /*!< DPHYPLLREFCRMRSTN (Bit 3)                             */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCRMRSTN_Msk (0x8UL)             /*!< DPHYPLLREFCRMRSTN (Bitfield-Mask: 0x01)               */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKACTIVE_Pos (1UL)             /*!< DPHYPLLREFCLKACTIVE (Bit 1)                           */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKACTIVE_Msk (0x2UL)           /*!< DPHYPLLREFCLKACTIVE (Bitfield-Mask: 0x01)             */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKEN_Pos (0UL)                 /*!< DPHYPLLREFCLKEN (Bit 0)                               */
#define CRM_DPHYPLLREFCRM_DPHYPLLREFCLKEN_Msk (0x1UL)               /*!< DPHYPLLREFCLKEN (Bitfield-Mask: 0x01)                 */
/* ======================================================  DSPPDM0CRM  ======================================================= */
#define CRM_DSPPDM0CRM_DSPPDM0CLKDIV_Pos  (8UL)                     /*!< DSPPDM0CLKDIV (Bit 8)                                 */
#define CRM_DSPPDM0CRM_DSPPDM0CLKDIV_Msk  (0x7f00UL)                /*!< DSPPDM0CLKDIV (Bitfield-Mask: 0x7f)                   */
#define CRM_DSPPDM0CRM_DSPPDM0CLKSEL_Pos  (4UL)                     /*!< DSPPDM0CLKSEL (Bit 4)                                 */
#define CRM_DSPPDM0CRM_DSPPDM0CLKSEL_Msk  (0x70UL)                  /*!< DSPPDM0CLKSEL (Bitfield-Mask: 0x07)                   */
#define CRM_DSPPDM0CRM_DSPPDM0CRMRSTN_Pos (3UL)                     /*!< DSPPDM0CRMRSTN (Bit 3)                                */
#define CRM_DSPPDM0CRM_DSPPDM0CRMRSTN_Msk (0x8UL)                   /*!< DSPPDM0CRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_DSPPDM0CRM_DSPPDM0CLKACTIVE_Pos (1UL)                   /*!< DSPPDM0CLKACTIVE (Bit 1)                              */
#define CRM_DSPPDM0CRM_DSPPDM0CLKACTIVE_Msk (0x2UL)                 /*!< DSPPDM0CLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_DSPPDM0CRM_DSPPDM0CLKEN_Pos   (0UL)                     /*!< DSPPDM0CLKEN (Bit 0)                                  */
#define CRM_DSPPDM0CRM_DSPPDM0CLKEN_Msk   (0x1UL)                   /*!< DSPPDM0CLKEN (Bitfield-Mask: 0x01)                    */
/* ======================================================  I2S0MCLKCRM  ====================================================== */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKDIV_Pos (8UL)                    /*!< I2S0MCLKCLKDIV (Bit 8)                                */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKDIV_Msk (0x7f00UL)               /*!< I2S0MCLKCLKDIV (Bitfield-Mask: 0x7f)                  */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_Pos (4UL)                    /*!< I2S0MCLKCLKSEL (Bit 4)                                */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_Msk (0x70UL)                 /*!< I2S0MCLKCLKSEL (Bitfield-Mask: 0x07)                  */
#define CRM_I2S0MCLKCRM_I2S0MCLKCRMRSTN_Pos (3UL)                   /*!< I2S0MCLKCRMRSTN (Bit 3)                               */
#define CRM_I2S0MCLKCRM_I2S0MCLKCRMRSTN_Msk (0x8UL)                 /*!< I2S0MCLKCRMRSTN (Bitfield-Mask: 0x01)                 */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKACTIVE_Pos (1UL)                 /*!< I2S0MCLKCLKACTIVE (Bit 1)                             */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKACTIVE_Msk (0x2UL)               /*!< I2S0MCLKCLKACTIVE (Bitfield-Mask: 0x01)               */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKEN_Pos (0UL)                     /*!< I2S0MCLKCLKEN (Bit 0)                                 */
#define CRM_I2S0MCLKCRM_I2S0MCLKCLKEN_Msk (0x1UL)                   /*!< I2S0MCLKCLKEN (Bitfield-Mask: 0x01)                   */
/* ====================================================  I2S0MCLKOUTCRM  ===================================================== */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKDIV_Pos (8UL)              /*!< I2S0MCLKOUTCLKDIV (Bit 8)                             */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKDIV_Msk (0x1f00UL)         /*!< I2S0MCLKOUTCLKDIV (Bitfield-Mask: 0x1f)               */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_Pos (4UL)              /*!< I2S0MCLKOUTCLKSEL (Bit 4)                             */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_Msk (0x70UL)           /*!< I2S0MCLKOUTCLKSEL (Bitfield-Mask: 0x07)               */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCRMRSTN_Pos (3UL)             /*!< I2S0MCLKOUTCRMRSTN (Bit 3)                            */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCRMRSTN_Msk (0x8UL)           /*!< I2S0MCLKOUTCRMRSTN (Bitfield-Mask: 0x01)              */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKACTIVE_Pos (1UL)           /*!< I2S0MCLKOUTCLKACTIVE (Bit 1)                          */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKACTIVE_Msk (0x2UL)         /*!< I2S0MCLKOUTCLKACTIVE (Bitfield-Mask: 0x01)            */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKEN_Pos (0UL)               /*!< I2S0MCLKOUTCLKEN (Bit 0)                              */
#define CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKEN_Msk (0x1UL)             /*!< I2S0MCLKOUTCLKEN (Bitfield-Mask: 0x01)                */
/* =====================================================  I2S0REFCLKCRM  ===================================================== */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKDIV_Pos (8UL)                /*!< I2S0REFCLKCLKDIV (Bit 8)                              */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKDIV_Msk (0x1f00UL)           /*!< I2S0REFCLKCLKDIV (Bitfield-Mask: 0x1f)                */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_Pos (4UL)                /*!< I2S0REFCLKCLKSEL (Bit 4)                              */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_Msk (0x30UL)             /*!< I2S0REFCLKCLKSEL (Bitfield-Mask: 0x03)                */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCRMRSTN_Pos (3UL)               /*!< I2S0REFCLKCRMRSTN (Bit 3)                             */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCRMRSTN_Msk (0x8UL)             /*!< I2S0REFCLKCRMRSTN (Bitfield-Mask: 0x01)               */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKACTIVE_Pos (1UL)             /*!< I2S0REFCLKCLKACTIVE (Bit 1)                           */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKACTIVE_Msk (0x2UL)           /*!< I2S0REFCLKCLKACTIVE (Bitfield-Mask: 0x01)             */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKEN_Pos (0UL)                 /*!< I2S0REFCLKCLKEN (Bit 0)                               */
#define CRM_I2S0REFCLKCRM_I2S0REFCLKCLKEN_Msk (0x1UL)               /*!< I2S0REFCLKCLKEN (Bitfield-Mask: 0x01)                 */
/* ======================================================  UART0HFCRM  ======================================================= */
#define CRM_UART0HFCRM_UART0HFCLKDIV_Pos  (8UL)                     /*!< UART0HFCLKDIV (Bit 8)                                 */
#define CRM_UART0HFCRM_UART0HFCLKDIV_Msk  (0x1f00UL)                /*!< UART0HFCLKDIV (Bitfield-Mask: 0x1f)                   */
#define CRM_UART0HFCRM_UART0HFCLKSEL_Pos  (4UL)                     /*!< UART0HFCLKSEL (Bit 4)                                 */
#define CRM_UART0HFCRM_UART0HFCLKSEL_Msk  (0x10UL)                  /*!< UART0HFCLKSEL (Bitfield-Mask: 0x01)                   */
#define CRM_UART0HFCRM_UART0HFCRMRSTN_Pos (3UL)                     /*!< UART0HFCRMRSTN (Bit 3)                                */
#define CRM_UART0HFCRM_UART0HFCRMRSTN_Msk (0x8UL)                   /*!< UART0HFCRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_UART0HFCRM_UART0HFCLKACTIVE_Pos (1UL)                   /*!< UART0HFCLKACTIVE (Bit 1)                              */
#define CRM_UART0HFCRM_UART0HFCLKACTIVE_Msk (0x2UL)                 /*!< UART0HFCLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_UART0HFCRM_UART0HFCLKEN_Pos   (0UL)                     /*!< UART0HFCLKEN (Bit 0)                                  */
#define CRM_UART0HFCRM_UART0HFCLKEN_Msk   (0x1UL)                   /*!< UART0HFCLKEN (Bitfield-Mask: 0x01)                    */
/* ======================================================  UART1HFCRM  ======================================================= */
#define CRM_UART1HFCRM_UART1HFCLKDIV_Pos  (8UL)                     /*!< UART1HFCLKDIV (Bit 8)                                 */
#define CRM_UART1HFCRM_UART1HFCLKDIV_Msk  (0x1f00UL)                /*!< UART1HFCLKDIV (Bitfield-Mask: 0x1f)                   */
#define CRM_UART1HFCRM_UART1HFCLKSEL_Pos  (4UL)                     /*!< UART1HFCLKSEL (Bit 4)                                 */
#define CRM_UART1HFCRM_UART1HFCLKSEL_Msk  (0x10UL)                  /*!< UART1HFCLKSEL (Bitfield-Mask: 0x01)                   */
#define CRM_UART1HFCRM_UART1HFCRMRSTN_Pos (3UL)                     /*!< UART1HFCRMRSTN (Bit 3)                                */
#define CRM_UART1HFCRM_UART1HFCRMRSTN_Msk (0x8UL)                   /*!< UART1HFCRMRSTN (Bitfield-Mask: 0x01)                  */
#define CRM_UART1HFCRM_UART1HFCLKACTIVE_Pos (1UL)                   /*!< UART1HFCLKACTIVE (Bit 1)                              */
#define CRM_UART1HFCRM_UART1HFCLKACTIVE_Msk (0x2UL)                 /*!< UART1HFCLKACTIVE (Bitfield-Mask: 0x01)                */
#define CRM_UART1HFCRM_UART1HFCLKEN_Pos   (0UL)                     /*!< UART1HFCLKEN (Bit 0)                                  */
#define CRM_UART1HFCRM_UART1HFCLKEN_Msk   (0x1UL)                   /*!< UART1HFCLKEN (Bitfield-Mask: 0x01)                    */
/* =====================================================  USBREFCLKCRM  ====================================================== */
#define CRM_USBREFCLKCRM_USBREFCLKCLKDIV_Pos (8UL)                  /*!< USBREFCLKCLKDIV (Bit 8)                               */
#define CRM_USBREFCLKCRM_USBREFCLKCLKDIV_Msk (0x700UL)              /*!< USBREFCLKCLKDIV (Bitfield-Mask: 0x07)                 */
#define CRM_USBREFCLKCRM_USBREFCLKCLKSEL_Pos (4UL)                  /*!< USBREFCLKCLKSEL (Bit 4)                               */
#define CRM_USBREFCLKCRM_USBREFCLKCLKSEL_Msk (0x70UL)               /*!< USBREFCLKCLKSEL (Bitfield-Mask: 0x07)                 */
#define CRM_USBREFCLKCRM_USBREFCLKCRMRSTN_Pos (3UL)                 /*!< USBREFCLKCRMRSTN (Bit 3)                              */
#define CRM_USBREFCLKCRM_USBREFCLKCRMRSTN_Msk (0x8UL)               /*!< USBREFCLKCRMRSTN (Bitfield-Mask: 0x01)                */
#define CRM_USBREFCLKCRM_USBREFCLKCLKACTIVE_Pos (1UL)               /*!< USBREFCLKCLKACTIVE (Bit 1)                            */
#define CRM_USBREFCLKCRM_USBREFCLKCLKACTIVE_Msk (0x2UL)             /*!< USBREFCLKCLKACTIVE (Bitfield-Mask: 0x01)              */
#define CRM_USBREFCLKCRM_USBREFCLKCLKEN_Pos (0UL)                   /*!< USBREFCLKCLKEN (Bit 0)                                */
#define CRM_USBREFCLKCRM_USBREFCLKCLKEN_Msk (0x1UL)                 /*!< USBREFCLKCLKEN (Bitfield-Mask: 0x01)                  */
/* ====================================================  CRMCLKENSTATUS  ===================================================== */
#define CRM_CRMCLKENSTATUS_ADCCLKENABLED_Pos (15UL)                 /*!< ADCCLKENABLED (Bit 15)                                */
#define CRM_CRMCLKENSTATUS_ADCCLKENABLED_Msk (0x8000UL)             /*!< ADCCLKENABLED (Bitfield-Mask: 0x01)                   */
#define CRM_CRMCLKENSTATUS_APBDISPCLKENABLED_Pos (14UL)             /*!< APBDISPCLKENABLED (Bit 14)                            */
#define CRM_CRMCLKENSTATUS_APBDISPCLKENABLED_Msk (0x4000UL)         /*!< APBDISPCLKENABLED (Bitfield-Mask: 0x01)               */
#define CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED_Pos (13UL)          /*!< APBDISPPHYCLKENABLED (Bit 13)                         */
#define CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED_Msk (0x2000UL)      /*!< APBDISPPHYCLKENABLED (Bitfield-Mask: 0x01)            */
#define CRM_CRMCLKENSTATUS_APBUARTCLKENABLED_Pos (12UL)             /*!< APBUARTCLKENABLED (Bit 12)                            */
#define CRM_CRMCLKENSTATUS_APBUARTCLKENABLED_Msk (0x1000UL)         /*!< APBUARTCLKENABLED (Bitfield-Mask: 0x01)               */
#define CRM_CRMCLKENSTATUS_APBI2SCLKENABLED_Pos (11UL)              /*!< APBI2SCLKENABLED (Bit 11)                             */
#define CRM_CRMCLKENSTATUS_APBI2SCLKENABLED_Msk (0x800UL)           /*!< APBI2SCLKENABLED (Bitfield-Mask: 0x01)                */
#define CRM_CRMCLKENSTATUS_APBPDMCLKENABLED_Pos (10UL)              /*!< APBPDMCLKENABLED (Bit 10)                             */
#define CRM_CRMCLKENSTATUS_APBPDMCLKENABLED_Msk (0x400UL)           /*!< APBPDMCLKENABLED (Bitfield-Mask: 0x01)                */
#define CRM_CRMCLKENSTATUS_APBUSBCLKENABLED_Pos (9UL)               /*!< APBUSBCLKENABLED (Bit 9)                              */
#define CRM_CRMCLKENSTATUS_APBUSBCLKENABLED_Msk (0x200UL)           /*!< APBUSBCLKENABLED (Bitfield-Mask: 0x01)                */
#define CRM_CRMCLKENSTATUS_DISPCLKCLKENABLED_Pos (8UL)              /*!< DISPCLKCLKENABLED (Bit 8)                             */
