AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define GPIO_PINCFG102_DS102_Msk          (0xc00UL)                 /*!< DS102 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG102_OUTCFG102_Pos      (8UL)                     /*!< OUTCFG102 (Bit 8)                                     */
#define GPIO_PINCFG102_OUTCFG102_Msk      (0x300UL)                 /*!< OUTCFG102 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG102_IRPTEN102_Pos      (6UL)                     /*!< IRPTEN102 (Bit 6)                                     */
#define GPIO_PINCFG102_IRPTEN102_Msk      (0xc0UL)                  /*!< IRPTEN102 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG102_RDZERO102_Pos      (5UL)                     /*!< RDZERO102 (Bit 5)                                     */
#define GPIO_PINCFG102_RDZERO102_Msk      (0x20UL)                  /*!< RDZERO102 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG102_INPEN102_Pos       (4UL)                     /*!< INPEN102 (Bit 4)                                      */
#define GPIO_PINCFG102_INPEN102_Msk       (0x10UL)                  /*!< INPEN102 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG102_FNCSEL102_Pos      (0UL)                     /*!< FNCSEL102 (Bit 0)                                     */
#define GPIO_PINCFG102_FNCSEL102_Msk      (0xfUL)                   /*!< FNCSEL102 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG103  ======================================================= */
#define GPIO_PINCFG103_DSPULLCFG103_Pos   (28UL)                    /*!< DSPULLCFG103 (Bit 28)                                 */
#define GPIO_PINCFG103_DSPULLCFG103_Msk   (0x70000000UL)            /*!< DSPULLCFG103 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG103_FOEN103_Pos        (27UL)                    /*!< FOEN103 (Bit 27)                                      */
#define GPIO_PINCFG103_FOEN103_Msk        (0x8000000UL)             /*!< FOEN103 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG103_FIEN103_Pos        (26UL)                    /*!< FIEN103 (Bit 26)                                      */
#define GPIO_PINCFG103_FIEN103_Msk        (0x4000000UL)             /*!< FIEN103 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG103_TIMERSEL103_Pos    (23UL)                    /*!< TIMERSEL103 (Bit 23)                                  */
#define GPIO_PINCFG103_TIMERSEL103_Msk    (0x800000UL)              /*!< TIMERSEL103 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG103_NCEPOL103_Pos      (22UL)                    /*!< NCEPOL103 (Bit 22)                                    */
#define GPIO_PINCFG103_NCEPOL103_Msk      (0x400000UL)              /*!< NCEPOL103 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG103_NCESRC103_Pos      (16UL)                    /*!< NCESRC103 (Bit 16)                                    */
#define GPIO_PINCFG103_NCESRC103_Msk      (0x1f0000UL)              /*!< NCESRC103 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG103_PULLCFG103_Pos     (13UL)                    /*!< PULLCFG103 (Bit 13)                                   */
#define GPIO_PINCFG103_PULLCFG103_Msk     (0xe000UL)                /*!< PULLCFG103 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG103_SR103_Pos          (12UL)                    /*!< SR103 (Bit 12)                                        */
#define GPIO_PINCFG103_SR103_Msk          (0x1000UL)                /*!< SR103 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG103_DS103_Pos          (10UL)                    /*!< DS103 (Bit 10)                                        */
#define GPIO_PINCFG103_DS103_Msk          (0xc00UL)                 /*!< DS103 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG103_OUTCFG103_Pos      (8UL)                     /*!< OUTCFG103 (Bit 8)                                     */
#define GPIO_PINCFG103_OUTCFG103_Msk      (0x300UL)                 /*!< OUTCFG103 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG103_IRPTEN103_Pos      (6UL)                     /*!< IRPTEN103 (Bit 6)                                     */
#define GPIO_PINCFG103_IRPTEN103_Msk      (0xc0UL)                  /*!< IRPTEN103 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG103_RDZERO103_Pos      (5UL)                     /*!< RDZERO103 (Bit 5)                                     */
#define GPIO_PINCFG103_RDZERO103_Msk      (0x20UL)                  /*!< RDZERO103 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG103_INPEN103_Pos       (4UL)                     /*!< INPEN103 (Bit 4)                                      */
#define GPIO_PINCFG103_INPEN103_Msk       (0x10UL)                  /*!< INPEN103 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG103_FNCSEL103_Pos      (0UL)                     /*!< FNCSEL103 (Bit 0)                                     */
#define GPIO_PINCFG103_FNCSEL103_Msk      (0xfUL)                   /*!< FNCSEL103 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG104  ======================================================= */
#define GPIO_PINCFG104_DSPULLCFG104_Pos   (28UL)                    /*!< DSPULLCFG104 (Bit 28)                                 */
#define GPIO_PINCFG104_DSPULLCFG104_Msk   (0x70000000UL)            /*!< DSPULLCFG104 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG104_FOEN104_Pos        (27UL)                    /*!< FOEN104 (Bit 27)                                      */
#define GPIO_PINCFG104_FOEN104_Msk        (0x8000000UL)             /*!< FOEN104 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG104_FIEN104_Pos        (26UL)                    /*!< FIEN104 (Bit 26)                                      */
#define GPIO_PINCFG104_FIEN104_Msk        (0x4000000UL)             /*!< FIEN104 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG104_TIMERSEL104_Pos    (23UL)                    /*!< TIMERSEL104 (Bit 23)                                  */
#define GPIO_PINCFG104_TIMERSEL104_Msk    (0x800000UL)              /*!< TIMERSEL104 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG104_NCEPOL104_Pos      (22UL)                    /*!< NCEPOL104 (Bit 22)                                    */
#define GPIO_PINCFG104_NCEPOL104_Msk      (0x400000UL)              /*!< NCEPOL104 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG104_NCESRC104_Pos      (16UL)                    /*!< NCESRC104 (Bit 16)                                    */
#define GPIO_PINCFG104_NCESRC104_Msk      (0x1f0000UL)              /*!< NCESRC104 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG104_PULLCFG104_Pos     (13UL)                    /*!< PULLCFG104 (Bit 13)                                   */
#define GPIO_PINCFG104_PULLCFG104_Msk     (0xe000UL)                /*!< PULLCFG104 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG104_SR104_Pos          (12UL)                    /*!< SR104 (Bit 12)                                        */
#define GPIO_PINCFG104_SR104_Msk          (0x1000UL)                /*!< SR104 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG104_DS104_Pos          (10UL)                    /*!< DS104 (Bit 10)                                        */
#define GPIO_PINCFG104_DS104_Msk          (0xc00UL)                 /*!< DS104 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG104_OUTCFG104_Pos      (8UL)                     /*!< OUTCFG104 (Bit 8)                                     */
#define GPIO_PINCFG104_OUTCFG104_Msk      (0x300UL)                 /*!< OUTCFG104 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG104_IRPTEN104_Pos      (6UL)                     /*!< IRPTEN104 (Bit 6)                                     */
#define GPIO_PINCFG104_IRPTEN104_Msk      (0xc0UL)                  /*!< IRPTEN104 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG104_RDZERO104_Pos      (5UL)                     /*!< RDZERO104 (Bit 5)                                     */
#define GPIO_PINCFG104_RDZERO104_Msk      (0x20UL)                  /*!< RDZERO104 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG104_INPEN104_Pos       (4UL)                     /*!< INPEN104 (Bit 4)                                      */
#define GPIO_PINCFG104_INPEN104_Msk       (0x10UL)                  /*!< INPEN104 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG104_FNCSEL104_Pos      (0UL)                     /*!< FNCSEL104 (Bit 0)                                     */
#define GPIO_PINCFG104_FNCSEL104_Msk      (0xfUL)                   /*!< FNCSEL104 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG105  ======================================================= */
#define GPIO_PINCFG105_DSPULLCFG105_Pos   (28UL)                    /*!< DSPULLCFG105 (Bit 28)                                 */
#define GPIO_PINCFG105_DSPULLCFG105_Msk   (0x70000000UL)            /*!< DSPULLCFG105 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG105_FOEN105_Pos        (27UL)                    /*!< FOEN105 (Bit 27)                                      */
#define GPIO_PINCFG105_FOEN105_Msk        (0x8000000UL)             /*!< FOEN105 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG105_FIEN105_Pos        (26UL)                    /*!< FIEN105 (Bit 26)                                      */
#define GPIO_PINCFG105_FIEN105_Msk        (0x4000000UL)             /*!< FIEN105 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG105_TIMERSEL105_Pos    (23UL)                    /*!< TIMERSEL105 (Bit 23)                                  */
#define GPIO_PINCFG105_TIMERSEL105_Msk    (0x800000UL)              /*!< TIMERSEL105 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG105_NCEPOL105_Pos      (22UL)                    /*!< NCEPOL105 (Bit 22)                                    */
#define GPIO_PINCFG105_NCEPOL105_Msk      (0x400000UL)              /*!< NCEPOL105 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG105_NCESRC105_Pos      (16UL)                    /*!< NCESRC105 (Bit 16)                                    */
#define GPIO_PINCFG105_NCESRC105_Msk      (0x1f0000UL)              /*!< NCESRC105 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG105_PULLCFG105_Pos     (13UL)                    /*!< PULLCFG105 (Bit 13)                                   */
#define GPIO_PINCFG105_PULLCFG105_Msk     (0xe000UL)                /*!< PULLCFG105 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG105_SR105_Pos          (12UL)                    /*!< SR105 (Bit 12)                                        */
#define GPIO_PINCFG105_SR105_Msk          (0x1000UL)                /*!< SR105 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG105_DS105_Pos          (10UL)                    /*!< DS105 (Bit 10)                                        */
#define GPIO_PINCFG105_DS105_Msk          (0xc00UL)                 /*!< DS105 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG105_OUTCFG105_Pos      (8UL)                     /*!< OUTCFG105 (Bit 8)                                     */
#define GPIO_PINCFG105_OUTCFG105_Msk      (0x300UL)                 /*!< OUTCFG105 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG105_IRPTEN105_Pos      (6UL)                     /*!< IRPTEN105 (Bit 6)                                     */
#define GPIO_PINCFG105_IRPTEN105_Msk      (0xc0UL)                  /*!< IRPTEN105 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG105_RDZERO105_Pos      (5UL)                     /*!< RDZERO105 (Bit 5)                                     */
#define GPIO_PINCFG105_RDZERO105_Msk      (0x20UL)                  /*!< RDZERO105 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG105_INPEN105_Pos       (4UL)                     /*!< INPEN105 (Bit 4)                                      */
#define GPIO_PINCFG105_INPEN105_Msk       (0x10UL)                  /*!< INPEN105 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG105_FNCSEL105_Pos      (0UL)                     /*!< FNCSEL105 (Bit 0)                                     */
#define GPIO_PINCFG105_FNCSEL105_Msk      (0xfUL)                   /*!< FNCSEL105 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG106  ======================================================= */
#define GPIO_PINCFG106_DSPULLCFG106_Pos   (28UL)                    /*!< DSPULLCFG106 (Bit 28)                                 */
#define GPIO_PINCFG106_DSPULLCFG106_Msk   (0x70000000UL)            /*!< DSPULLCFG106 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG106_FOEN106_Pos        (27UL)                    /*!< FOEN106 (Bit 27)                                      */
#define GPIO_PINCFG106_FOEN106_Msk        (0x8000000UL)             /*!< FOEN106 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG106_FIEN106_Pos        (26UL)                    /*!< FIEN106 (Bit 26)                                      */
#define GPIO_PINCFG106_FIEN106_Msk        (0x4000000UL)             /*!< FIEN106 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG106_TIMERSEL106_Pos    (23UL)                    /*!< TIMERSEL106 (Bit 23)                                  */
#define GPIO_PINCFG106_TIMERSEL106_Msk    (0x800000UL)              /*!< TIMERSEL106 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG106_NCEPOL106_Pos      (22UL)                    /*!< NCEPOL106 (Bit 22)                                    */
#define GPIO_PINCFG106_NCEPOL106_Msk      (0x400000UL)              /*!< NCEPOL106 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG106_NCESRC106_Pos      (16UL)                    /*!< NCESRC106 (Bit 16)                                    */
#define GPIO_PINCFG106_NCESRC106_Msk      (0x1f0000UL)              /*!< NCESRC106 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG106_PULLCFG106_Pos     (13UL)                    /*!< PULLCFG106 (Bit 13)                                   */
#define GPIO_PINCFG106_PULLCFG106_Msk     (0xe000UL)                /*!< PULLCFG106 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG106_SR106_Pos          (12UL)                    /*!< SR106 (Bit 12)                                        */
#define GPIO_PINCFG106_SR106_Msk          (0x1000UL)                /*!< SR106 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG106_DS106_Pos          (10UL)                    /*!< DS106 (Bit 10)                                        */
#define GPIO_PINCFG106_DS106_Msk          (0xc00UL)                 /*!< DS106 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG106_OUTCFG106_Pos      (8UL)                     /*!< OUTCFG106 (Bit 8)                                     */
#define GPIO_PINCFG106_OUTCFG106_Msk      (0x300UL)                 /*!< OUTCFG106 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG106_IRPTEN106_Pos      (6UL)                     /*!< IRPTEN106 (Bit 6)                                     */
#define GPIO_PINCFG106_IRPTEN106_Msk      (0xc0UL)                  /*!< IRPTEN106 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG106_RDZERO106_Pos      (5UL)                     /*!< RDZERO106 (Bit 5)                                     */
#define GPIO_PINCFG106_RDZERO106_Msk      (0x20UL)                  /*!< RDZERO106 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG106_INPEN106_Pos       (4UL)                     /*!< INPEN106 (Bit 4)                                      */
#define GPIO_PINCFG106_INPEN106_Msk       (0x10UL)                  /*!< INPEN106 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG106_FNCSEL106_Pos      (0UL)                     /*!< FNCSEL106 (Bit 0)                                     */
#define GPIO_PINCFG106_FNCSEL106_Msk      (0xfUL)                   /*!< FNCSEL106 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG107  ======================================================= */
#define GPIO_PINCFG107_DSPULLCFG107_Pos   (28UL)                    /*!< DSPULLCFG107 (Bit 28)                                 */
#define GPIO_PINCFG107_DSPULLCFG107_Msk   (0x70000000UL)            /*!< DSPULLCFG107 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG107_FOEN107_Pos        (27UL)                    /*!< FOEN107 (Bit 27)                                      */
#define GPIO_PINCFG107_FOEN107_Msk        (0x8000000UL)             /*!< FOEN107 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG107_FIEN107_Pos        (26UL)                    /*!< FIEN107 (Bit 26)                                      */
#define GPIO_PINCFG107_FIEN107_Msk        (0x4000000UL)             /*!< FIEN107 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG107_TIMERSEL107_Pos    (23UL)                    /*!< TIMERSEL107 (Bit 23)                                  */
#define GPIO_PINCFG107_TIMERSEL107_Msk    (0x800000UL)              /*!< TIMERSEL107 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG107_NCEPOL107_Pos      (22UL)                    /*!< NCEPOL107 (Bit 22)                                    */
#define GPIO_PINCFG107_NCEPOL107_Msk      (0x400000UL)              /*!< NCEPOL107 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG107_NCESRC107_Pos      (16UL)                    /*!< NCESRC107 (Bit 16)                                    */
#define GPIO_PINCFG107_NCESRC107_Msk      (0x1f0000UL)              /*!< NCESRC107 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG107_PULLCFG107_Pos     (13UL)                    /*!< PULLCFG107 (Bit 13)                                   */
#define GPIO_PINCFG107_PULLCFG107_Msk     (0xe000UL)                /*!< PULLCFG107 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG107_SR107_Pos          (12UL)                    /*!< SR107 (Bit 12)                                        */
#define GPIO_PINCFG107_SR107_Msk          (0x1000UL)                /*!< SR107 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG107_DS107_Pos          (10UL)                    /*!< DS107 (Bit 10)                                        */
#define GPIO_PINCFG107_DS107_Msk          (0xc00UL)                 /*!< DS107 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG107_OUTCFG107_Pos      (8UL)                     /*!< OUTCFG107 (Bit 8)                                     */
#define GPIO_PINCFG107_OUTCFG107_Msk      (0x300UL)                 /*!< OUTCFG107 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG107_IRPTEN107_Pos      (6UL)                     /*!< IRPTEN107 (Bit 6)                                     */
#define GPIO_PINCFG107_IRPTEN107_Msk      (0xc0UL)                  /*!< IRPTEN107 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG107_RDZERO107_Pos      (5UL)                     /*!< RDZERO107 (Bit 5)                                     */
#define GPIO_PINCFG107_RDZERO107_Msk      (0x20UL)                  /*!< RDZERO107 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG107_INPEN107_Pos       (4UL)                     /*!< INPEN107 (Bit 4)                                      */
#define GPIO_PINCFG107_INPEN107_Msk       (0x10UL)                  /*!< INPEN107 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG107_FNCSEL107_Pos      (0UL)                     /*!< FNCSEL107 (Bit 0)                                     */
#define GPIO_PINCFG107_FNCSEL107_Msk      (0xfUL)                   /*!< FNCSEL107 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG108  ======================================================= */
#define GPIO_PINCFG108_DSPULLCFG108_Pos   (28UL)                    /*!< DSPULLCFG108 (Bit 28)                                 */
#define GPIO_PINCFG108_DSPULLCFG108_Msk   (0x70000000UL)            /*!< DSPULLCFG108 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG108_FOEN108_Pos        (27UL)                    /*!< FOEN108 (Bit 27)                                      */
#define GPIO_PINCFG108_FOEN108_Msk        (0x8000000UL)             /*!< FOEN108 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG108_FIEN108_Pos        (26UL)                    /*!< FIEN108 (Bit 26)                                      */
#define GPIO_PINCFG108_FIEN108_Msk        (0x4000000UL)             /*!< FIEN108 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG108_TIMERSEL108_Pos    (23UL)                    /*!< TIMERSEL108 (Bit 23)                                  */
#define GPIO_PINCFG108_TIMERSEL108_Msk    (0x800000UL)              /*!< TIMERSEL108 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG108_NCEPOL108_Pos      (22UL)                    /*!< NCEPOL108 (Bit 22)                                    */
#define GPIO_PINCFG108_NCEPOL108_Msk      (0x400000UL)              /*!< NCEPOL108 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG108_NCESRC108_Pos      (16UL)                    /*!< NCESRC108 (Bit 16)                                    */
#define GPIO_PINCFG108_NCESRC108_Msk      (0x1f0000UL)              /*!< NCESRC108 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG108_PULLCFG108_Pos     (13UL)                    /*!< PULLCFG108 (Bit 13)                                   */
#define GPIO_PINCFG108_PULLCFG108_Msk     (0xe000UL)                /*!< PULLCFG108 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG108_SR108_Pos          (12UL)                    /*!< SR108 (Bit 12)                                        */
#define GPIO_PINCFG108_SR108_Msk          (0x1000UL)                /*!< SR108 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG108_DS108_Pos          (10UL)                    /*!< DS108 (Bit 10)                                        */
#define GPIO_PINCFG108_DS108_Msk          (0xc00UL)                 /*!< DS108 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG108_OUTCFG108_Pos      (8UL)                     /*!< OUTCFG108 (Bit 8)                                     */
#define GPIO_PINCFG108_OUTCFG108_Msk      (0x300UL)                 /*!< OUTCFG108 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG108_IRPTEN108_Pos      (6UL)                     /*!< IRPTEN108 (Bit 6)                                     */
#define GPIO_PINCFG108_IRPTEN108_Msk      (0xc0UL)                  /*!< IRPTEN108 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG108_RDZERO108_Pos      (5UL)                     /*!< RDZERO108 (Bit 5)                                     */
#define GPIO_PINCFG108_RDZERO108_Msk      (0x20UL)                  /*!< RDZERO108 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG108_INPEN108_Pos       (4UL)                     /*!< INPEN108 (Bit 4)                                      */
#define GPIO_PINCFG108_INPEN108_Msk       (0x10UL)                  /*!< INPEN108 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG108_FNCSEL108_Pos      (0UL)                     /*!< FNCSEL108 (Bit 0)                                     */
