AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define GPIO_PINCFG108_FNCSEL108_Msk      (0xfUL)                   /*!< FNCSEL108 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG109  ======================================================= */
#define GPIO_PINCFG109_DSPULLCFG109_Pos   (28UL)                    /*!< DSPULLCFG109 (Bit 28)                                 */
#define GPIO_PINCFG109_DSPULLCFG109_Msk   (0x70000000UL)            /*!< DSPULLCFG109 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG109_FOEN109_Pos        (27UL)                    /*!< FOEN109 (Bit 27)                                      */
#define GPIO_PINCFG109_FOEN109_Msk        (0x8000000UL)             /*!< FOEN109 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG109_FIEN109_Pos        (26UL)                    /*!< FIEN109 (Bit 26)                                      */
#define GPIO_PINCFG109_FIEN109_Msk        (0x4000000UL)             /*!< FIEN109 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG109_TIMERSEL109_Pos    (23UL)                    /*!< TIMERSEL109 (Bit 23)                                  */
#define GPIO_PINCFG109_TIMERSEL109_Msk    (0x800000UL)              /*!< TIMERSEL109 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG109_NCEPOL109_Pos      (22UL)                    /*!< NCEPOL109 (Bit 22)                                    */
#define GPIO_PINCFG109_NCEPOL109_Msk      (0x400000UL)              /*!< NCEPOL109 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG109_NCESRC109_Pos      (16UL)                    /*!< NCESRC109 (Bit 16)                                    */
#define GPIO_PINCFG109_NCESRC109_Msk      (0x1f0000UL)              /*!< NCESRC109 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG109_PULLCFG109_Pos     (13UL)                    /*!< PULLCFG109 (Bit 13)                                   */
#define GPIO_PINCFG109_PULLCFG109_Msk     (0xe000UL)                /*!< PULLCFG109 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG109_SR109_Pos          (12UL)                    /*!< SR109 (Bit 12)                                        */
#define GPIO_PINCFG109_SR109_Msk          (0x1000UL)                /*!< SR109 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG109_DS109_Pos          (10UL)                    /*!< DS109 (Bit 10)                                        */
#define GPIO_PINCFG109_DS109_Msk          (0xc00UL)                 /*!< DS109 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG109_OUTCFG109_Pos      (8UL)                     /*!< OUTCFG109 (Bit 8)                                     */
#define GPIO_PINCFG109_OUTCFG109_Msk      (0x300UL)                 /*!< OUTCFG109 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG109_IRPTEN109_Pos      (6UL)                     /*!< IRPTEN109 (Bit 6)                                     */
#define GPIO_PINCFG109_IRPTEN109_Msk      (0xc0UL)                  /*!< IRPTEN109 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG109_RDZERO109_Pos      (5UL)                     /*!< RDZERO109 (Bit 5)                                     */
#define GPIO_PINCFG109_RDZERO109_Msk      (0x20UL)                  /*!< RDZERO109 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG109_INPEN109_Pos       (4UL)                     /*!< INPEN109 (Bit 4)                                      */
#define GPIO_PINCFG109_INPEN109_Msk       (0x10UL)                  /*!< INPEN109 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG109_FNCSEL109_Pos      (0UL)                     /*!< FNCSEL109 (Bit 0)                                     */
#define GPIO_PINCFG109_FNCSEL109_Msk      (0xfUL)                   /*!< FNCSEL109 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG110  ======================================================= */
#define GPIO_PINCFG110_DSPULLCFG110_Pos   (28UL)                    /*!< DSPULLCFG110 (Bit 28)                                 */
#define GPIO_PINCFG110_DSPULLCFG110_Msk   (0x70000000UL)            /*!< DSPULLCFG110 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG110_FOEN110_Pos        (27UL)                    /*!< FOEN110 (Bit 27)                                      */
#define GPIO_PINCFG110_FOEN110_Msk        (0x8000000UL)             /*!< FOEN110 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG110_FIEN110_Pos        (26UL)                    /*!< FIEN110 (Bit 26)                                      */
#define GPIO_PINCFG110_FIEN110_Msk        (0x4000000UL)             /*!< FIEN110 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG110_TIMERSEL110_Pos    (23UL)                    /*!< TIMERSEL110 (Bit 23)                                  */
#define GPIO_PINCFG110_TIMERSEL110_Msk    (0x800000UL)              /*!< TIMERSEL110 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG110_NCEPOL110_Pos      (22UL)                    /*!< NCEPOL110 (Bit 22)                                    */
#define GPIO_PINCFG110_NCEPOL110_Msk      (0x400000UL)              /*!< NCEPOL110 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG110_NCESRC110_Pos      (16UL)                    /*!< NCESRC110 (Bit 16)                                    */
#define GPIO_PINCFG110_NCESRC110_Msk      (0x1f0000UL)              /*!< NCESRC110 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG110_PULLCFG110_Pos     (13UL)                    /*!< PULLCFG110 (Bit 13)                                   */
#define GPIO_PINCFG110_PULLCFG110_Msk     (0xe000UL)                /*!< PULLCFG110 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG110_SR110_Pos          (12UL)                    /*!< SR110 (Bit 12)                                        */
#define GPIO_PINCFG110_SR110_Msk          (0x1000UL)                /*!< SR110 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG110_DS110_Pos          (10UL)                    /*!< DS110 (Bit 10)                                        */
#define GPIO_PINCFG110_DS110_Msk          (0xc00UL)                 /*!< DS110 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG110_OUTCFG110_Pos      (8UL)                     /*!< OUTCFG110 (Bit 8)                                     */
#define GPIO_PINCFG110_OUTCFG110_Msk      (0x300UL)                 /*!< OUTCFG110 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG110_IRPTEN110_Pos      (6UL)                     /*!< IRPTEN110 (Bit 6)                                     */
#define GPIO_PINCFG110_IRPTEN110_Msk      (0xc0UL)                  /*!< IRPTEN110 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG110_RDZERO110_Pos      (5UL)                     /*!< RDZERO110 (Bit 5)                                     */
#define GPIO_PINCFG110_RDZERO110_Msk      (0x20UL)                  /*!< RDZERO110 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG110_INPEN110_Pos       (4UL)                     /*!< INPEN110 (Bit 4)                                      */
#define GPIO_PINCFG110_INPEN110_Msk       (0x10UL)                  /*!< INPEN110 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG110_FNCSEL110_Pos      (0UL)                     /*!< FNCSEL110 (Bit 0)                                     */
#define GPIO_PINCFG110_FNCSEL110_Msk      (0xfUL)                   /*!< FNCSEL110 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG111  ======================================================= */
#define GPIO_PINCFG111_DSPULLCFG111_Pos   (28UL)                    /*!< DSPULLCFG111 (Bit 28)                                 */
#define GPIO_PINCFG111_DSPULLCFG111_Msk   (0x70000000UL)            /*!< DSPULLCFG111 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG111_FOEN111_Pos        (27UL)                    /*!< FOEN111 (Bit 27)                                      */
#define GPIO_PINCFG111_FOEN111_Msk        (0x8000000UL)             /*!< FOEN111 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG111_FIEN111_Pos        (26UL)                    /*!< FIEN111 (Bit 26)                                      */
#define GPIO_PINCFG111_FIEN111_Msk        (0x4000000UL)             /*!< FIEN111 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG111_TIMERSEL111_Pos    (23UL)                    /*!< TIMERSEL111 (Bit 23)                                  */
#define GPIO_PINCFG111_TIMERSEL111_Msk    (0x800000UL)              /*!< TIMERSEL111 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG111_NCEPOL111_Pos      (22UL)                    /*!< NCEPOL111 (Bit 22)                                    */
#define GPIO_PINCFG111_NCEPOL111_Msk      (0x400000UL)              /*!< NCEPOL111 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG111_NCESRC111_Pos      (16UL)                    /*!< NCESRC111 (Bit 16)                                    */
#define GPIO_PINCFG111_NCESRC111_Msk      (0x1f0000UL)              /*!< NCESRC111 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG111_PULLCFG111_Pos     (13UL)                    /*!< PULLCFG111 (Bit 13)                                   */
#define GPIO_PINCFG111_PULLCFG111_Msk     (0xe000UL)                /*!< PULLCFG111 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG111_SR111_Pos          (12UL)                    /*!< SR111 (Bit 12)                                        */
#define GPIO_PINCFG111_SR111_Msk          (0x1000UL)                /*!< SR111 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG111_DS111_Pos          (10UL)                    /*!< DS111 (Bit 10)                                        */
#define GPIO_PINCFG111_DS111_Msk          (0xc00UL)                 /*!< DS111 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG111_OUTCFG111_Pos      (8UL)                     /*!< OUTCFG111 (Bit 8)                                     */
#define GPIO_PINCFG111_OUTCFG111_Msk      (0x300UL)                 /*!< OUTCFG111 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG111_IRPTEN111_Pos      (6UL)                     /*!< IRPTEN111 (Bit 6)                                     */
#define GPIO_PINCFG111_IRPTEN111_Msk      (0xc0UL)                  /*!< IRPTEN111 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG111_RDZERO111_Pos      (5UL)                     /*!< RDZERO111 (Bit 5)                                     */
#define GPIO_PINCFG111_RDZERO111_Msk      (0x20UL)                  /*!< RDZERO111 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG111_INPEN111_Pos       (4UL)                     /*!< INPEN111 (Bit 4)                                      */
#define GPIO_PINCFG111_INPEN111_Msk       (0x10UL)                  /*!< INPEN111 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG111_FNCSEL111_Pos      (0UL)                     /*!< FNCSEL111 (Bit 0)                                     */
#define GPIO_PINCFG111_FNCSEL111_Msk      (0xfUL)                   /*!< FNCSEL111 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG112  ======================================================= */
#define GPIO_PINCFG112_DSPULLCFG112_Pos   (28UL)                    /*!< DSPULLCFG112 (Bit 28)                                 */
#define GPIO_PINCFG112_DSPULLCFG112_Msk   (0x70000000UL)            /*!< DSPULLCFG112 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG112_FOEN112_Pos        (27UL)                    /*!< FOEN112 (Bit 27)                                      */
#define GPIO_PINCFG112_FOEN112_Msk        (0x8000000UL)             /*!< FOEN112 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG112_FIEN112_Pos        (26UL)                    /*!< FIEN112 (Bit 26)                                      */
#define GPIO_PINCFG112_FIEN112_Msk        (0x4000000UL)             /*!< FIEN112 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG112_TIMERSEL112_Pos    (23UL)                    /*!< TIMERSEL112 (Bit 23)                                  */
#define GPIO_PINCFG112_TIMERSEL112_Msk    (0x800000UL)              /*!< TIMERSEL112 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG112_NCEPOL112_Pos      (22UL)                    /*!< NCEPOL112 (Bit 22)                                    */
#define GPIO_PINCFG112_NCEPOL112_Msk      (0x400000UL)              /*!< NCEPOL112 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG112_NCESRC112_Pos      (16UL)                    /*!< NCESRC112 (Bit 16)                                    */
#define GPIO_PINCFG112_NCESRC112_Msk      (0x1f0000UL)              /*!< NCESRC112 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG112_PULLCFG112_Pos     (13UL)                    /*!< PULLCFG112 (Bit 13)                                   */
#define GPIO_PINCFG112_PULLCFG112_Msk     (0xe000UL)                /*!< PULLCFG112 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG112_SR112_Pos          (12UL)                    /*!< SR112 (Bit 12)                                        */
#define GPIO_PINCFG112_SR112_Msk          (0x1000UL)                /*!< SR112 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG112_DS112_Pos          (10UL)                    /*!< DS112 (Bit 10)                                        */
#define GPIO_PINCFG112_DS112_Msk          (0xc00UL)                 /*!< DS112 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG112_OUTCFG112_Pos      (8UL)                     /*!< OUTCFG112 (Bit 8)                                     */
#define GPIO_PINCFG112_OUTCFG112_Msk      (0x300UL)                 /*!< OUTCFG112 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG112_IRPTEN112_Pos      (6UL)                     /*!< IRPTEN112 (Bit 6)                                     */
#define GPIO_PINCFG112_IRPTEN112_Msk      (0xc0UL)                  /*!< IRPTEN112 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG112_RDZERO112_Pos      (5UL)                     /*!< RDZERO112 (Bit 5)                                     */
#define GPIO_PINCFG112_RDZERO112_Msk      (0x20UL)                  /*!< RDZERO112 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG112_INPEN112_Pos       (4UL)                     /*!< INPEN112 (Bit 4)                                      */
#define GPIO_PINCFG112_INPEN112_Msk       (0x10UL)                  /*!< INPEN112 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG112_FNCSEL112_Pos      (0UL)                     /*!< FNCSEL112 (Bit 0)                                     */
#define GPIO_PINCFG112_FNCSEL112_Msk      (0xfUL)                   /*!< FNCSEL112 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG113  ======================================================= */
#define GPIO_PINCFG113_DSPULLCFG113_Pos   (28UL)                    /*!< DSPULLCFG113 (Bit 28)                                 */
#define GPIO_PINCFG113_DSPULLCFG113_Msk   (0x70000000UL)            /*!< DSPULLCFG113 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG113_FOEN113_Pos        (27UL)                    /*!< FOEN113 (Bit 27)                                      */
#define GPIO_PINCFG113_FOEN113_Msk        (0x8000000UL)             /*!< FOEN113 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG113_FIEN113_Pos        (26UL)                    /*!< FIEN113 (Bit 26)                                      */
#define GPIO_PINCFG113_FIEN113_Msk        (0x4000000UL)             /*!< FIEN113 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG113_TIMERSEL113_Pos    (23UL)                    /*!< TIMERSEL113 (Bit 23)                                  */
#define GPIO_PINCFG113_TIMERSEL113_Msk    (0x800000UL)              /*!< TIMERSEL113 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG113_NCEPOL113_Pos      (22UL)                    /*!< NCEPOL113 (Bit 22)                                    */
#define GPIO_PINCFG113_NCEPOL113_Msk      (0x400000UL)              /*!< NCEPOL113 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG113_NCESRC113_Pos      (16UL)                    /*!< NCESRC113 (Bit 16)                                    */
#define GPIO_PINCFG113_NCESRC113_Msk      (0x1f0000UL)              /*!< NCESRC113 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG113_PULLCFG113_Pos     (13UL)                    /*!< PULLCFG113 (Bit 13)                                   */
#define GPIO_PINCFG113_PULLCFG113_Msk     (0xe000UL)                /*!< PULLCFG113 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG113_SR113_Pos          (12UL)                    /*!< SR113 (Bit 12)                                        */
#define GPIO_PINCFG113_SR113_Msk          (0x1000UL)                /*!< SR113 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG113_DS113_Pos          (10UL)                    /*!< DS113 (Bit 10)                                        */
#define GPIO_PINCFG113_DS113_Msk          (0xc00UL)                 /*!< DS113 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG113_OUTCFG113_Pos      (8UL)                     /*!< OUTCFG113 (Bit 8)                                     */
#define GPIO_PINCFG113_OUTCFG113_Msk      (0x300UL)                 /*!< OUTCFG113 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG113_IRPTEN113_Pos      (6UL)                     /*!< IRPTEN113 (Bit 6)                                     */
#define GPIO_PINCFG113_IRPTEN113_Msk      (0xc0UL)                  /*!< IRPTEN113 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG113_RDZERO113_Pos      (5UL)                     /*!< RDZERO113 (Bit 5)                                     */
#define GPIO_PINCFG113_RDZERO113_Msk      (0x20UL)                  /*!< RDZERO113 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG113_INPEN113_Pos       (4UL)                     /*!< INPEN113 (Bit 4)                                      */
#define GPIO_PINCFG113_INPEN113_Msk       (0x10UL)                  /*!< INPEN113 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG113_FNCSEL113_Pos      (0UL)                     /*!< FNCSEL113 (Bit 0)                                     */
#define GPIO_PINCFG113_FNCSEL113_Msk      (0xfUL)                   /*!< FNCSEL113 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG114  ======================================================= */
#define GPIO_PINCFG114_DSPULLCFG114_Pos   (28UL)                    /*!< DSPULLCFG114 (Bit 28)                                 */
#define GPIO_PINCFG114_DSPULLCFG114_Msk   (0x70000000UL)            /*!< DSPULLCFG114 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG114_FOEN114_Pos        (27UL)                    /*!< FOEN114 (Bit 27)                                      */
#define GPIO_PINCFG114_FOEN114_Msk        (0x8000000UL)             /*!< FOEN114 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG114_FIEN114_Pos        (26UL)                    /*!< FIEN114 (Bit 26)                                      */
#define GPIO_PINCFG114_FIEN114_Msk        (0x4000000UL)             /*!< FIEN114 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG114_TIMERSEL114_Pos    (23UL)                    /*!< TIMERSEL114 (Bit 23)                                  */
#define GPIO_PINCFG114_TIMERSEL114_Msk    (0x800000UL)              /*!< TIMERSEL114 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG114_NCEPOL114_Pos      (22UL)                    /*!< NCEPOL114 (Bit 22)                                    */
#define GPIO_PINCFG114_NCEPOL114_Msk      (0x400000UL)              /*!< NCEPOL114 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG114_NCESRC114_Pos      (16UL)                    /*!< NCESRC114 (Bit 16)                                    */
#define GPIO_PINCFG114_NCESRC114_Msk      (0x1f0000UL)              /*!< NCESRC114 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG114_PULLCFG114_Pos     (13UL)                    /*!< PULLCFG114 (Bit 13)                                   */
#define GPIO_PINCFG114_PULLCFG114_Msk     (0xe000UL)                /*!< PULLCFG114 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG114_SR114_Pos          (12UL)                    /*!< SR114 (Bit 12)                                        */
#define GPIO_PINCFG114_SR114_Msk          (0x1000UL)                /*!< SR114 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG114_DS114_Pos          (10UL)                    /*!< DS114 (Bit 10)                                        */
#define GPIO_PINCFG114_DS114_Msk          (0xc00UL)                 /*!< DS114 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG114_OUTCFG114_Pos      (8UL)                     /*!< OUTCFG114 (Bit 8)                                     */
#define GPIO_PINCFG114_OUTCFG114_Msk      (0x300UL)                 /*!< OUTCFG114 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG114_IRPTEN114_Pos      (6UL)                     /*!< IRPTEN114 (Bit 6)                                     */
#define GPIO_PINCFG114_IRPTEN114_Msk      (0xc0UL)                  /*!< IRPTEN114 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG114_RDZERO114_Pos      (5UL)                     /*!< RDZERO114 (Bit 5)                                     */
#define GPIO_PINCFG114_RDZERO114_Msk      (0x20UL)                  /*!< RDZERO114 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG114_INPEN114_Pos       (4UL)                     /*!< INPEN114 (Bit 4)                                      */
#define GPIO_PINCFG114_INPEN114_Msk       (0x10UL)                  /*!< INPEN114 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG114_FNCSEL114_Pos      (0UL)                     /*!< FNCSEL114 (Bit 0)                                     */
#define GPIO_PINCFG114_FNCSEL114_Msk      (0xfUL)                   /*!< FNCSEL114 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG115  ======================================================= */
#define GPIO_PINCFG115_DSPULLCFG115_Pos   (28UL)                    /*!< DSPULLCFG115 (Bit 28)                                 */
#define GPIO_PINCFG115_DSPULLCFG115_Msk   (0x70000000UL)            /*!< DSPULLCFG115 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG115_FOEN115_Pos        (27UL)                    /*!< FOEN115 (Bit 27)                                      */
#define GPIO_PINCFG115_FOEN115_Msk        (0x8000000UL)             /*!< FOEN115 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG115_FIEN115_Pos        (26UL)                    /*!< FIEN115 (Bit 26)                                      */
#define GPIO_PINCFG115_FIEN115_Msk        (0x4000000UL)             /*!< FIEN115 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG115_TIMERSEL115_Pos    (23UL)                    /*!< TIMERSEL115 (Bit 23)                                  */
#define GPIO_PINCFG115_TIMERSEL115_Msk    (0x800000UL)              /*!< TIMERSEL115 (Bitfield-Mask: 0x01)                     */
