AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define GPIO_PINCFG115_NCEPOL115_Pos      (22UL)                    /*!< NCEPOL115 (Bit 22)                                    */
#define GPIO_PINCFG115_NCEPOL115_Msk      (0x400000UL)              /*!< NCEPOL115 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG115_NCESRC115_Pos      (16UL)                    /*!< NCESRC115 (Bit 16)                                    */
#define GPIO_PINCFG115_NCESRC115_Msk      (0x1f0000UL)              /*!< NCESRC115 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG115_PULLCFG115_Pos     (13UL)                    /*!< PULLCFG115 (Bit 13)                                   */
#define GPIO_PINCFG115_PULLCFG115_Msk     (0xe000UL)                /*!< PULLCFG115 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG115_SR115_Pos          (12UL)                    /*!< SR115 (Bit 12)                                        */
#define GPIO_PINCFG115_SR115_Msk          (0x1000UL)                /*!< SR115 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG115_DS115_Pos          (10UL)                    /*!< DS115 (Bit 10)                                        */
#define GPIO_PINCFG115_DS115_Msk          (0xc00UL)                 /*!< DS115 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG115_OUTCFG115_Pos      (8UL)                     /*!< OUTCFG115 (Bit 8)                                     */
#define GPIO_PINCFG115_OUTCFG115_Msk      (0x300UL)                 /*!< OUTCFG115 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG115_IRPTEN115_Pos      (6UL)                     /*!< IRPTEN115 (Bit 6)                                     */
#define GPIO_PINCFG115_IRPTEN115_Msk      (0xc0UL)                  /*!< IRPTEN115 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG115_RDZERO115_Pos      (5UL)                     /*!< RDZERO115 (Bit 5)                                     */
#define GPIO_PINCFG115_RDZERO115_Msk      (0x20UL)                  /*!< RDZERO115 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG115_INPEN115_Pos       (4UL)                     /*!< INPEN115 (Bit 4)                                      */
#define GPIO_PINCFG115_INPEN115_Msk       (0x10UL)                  /*!< INPEN115 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG115_FNCSEL115_Pos      (0UL)                     /*!< FNCSEL115 (Bit 0)                                     */
#define GPIO_PINCFG115_FNCSEL115_Msk      (0xfUL)                   /*!< FNCSEL115 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG116  ======================================================= */
#define GPIO_PINCFG116_DSPULLCFG116_Pos   (28UL)                    /*!< DSPULLCFG116 (Bit 28)                                 */
#define GPIO_PINCFG116_DSPULLCFG116_Msk   (0x70000000UL)            /*!< DSPULLCFG116 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG116_FOEN116_Pos        (27UL)                    /*!< FOEN116 (Bit 27)                                      */
#define GPIO_PINCFG116_FOEN116_Msk        (0x8000000UL)             /*!< FOEN116 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG116_FIEN116_Pos        (26UL)                    /*!< FIEN116 (Bit 26)                                      */
#define GPIO_PINCFG116_FIEN116_Msk        (0x4000000UL)             /*!< FIEN116 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG116_TIMERSEL116_Pos    (23UL)                    /*!< TIMERSEL116 (Bit 23)                                  */
#define GPIO_PINCFG116_TIMERSEL116_Msk    (0x800000UL)              /*!< TIMERSEL116 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG116_NCEPOL116_Pos      (22UL)                    /*!< NCEPOL116 (Bit 22)                                    */
#define GPIO_PINCFG116_NCEPOL116_Msk      (0x400000UL)              /*!< NCEPOL116 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG116_NCESRC116_Pos      (16UL)                    /*!< NCESRC116 (Bit 16)                                    */
#define GPIO_PINCFG116_NCESRC116_Msk      (0x1f0000UL)              /*!< NCESRC116 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG116_PULLCFG116_Pos     (13UL)                    /*!< PULLCFG116 (Bit 13)                                   */
#define GPIO_PINCFG116_PULLCFG116_Msk     (0xe000UL)                /*!< PULLCFG116 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG116_SR116_Pos          (12UL)                    /*!< SR116 (Bit 12)                                        */
#define GPIO_PINCFG116_SR116_Msk          (0x1000UL)                /*!< SR116 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG116_DS116_Pos          (10UL)                    /*!< DS116 (Bit 10)                                        */
#define GPIO_PINCFG116_DS116_Msk          (0xc00UL)                 /*!< DS116 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG116_OUTCFG116_Pos      (8UL)                     /*!< OUTCFG116 (Bit 8)                                     */
#define GPIO_PINCFG116_OUTCFG116_Msk      (0x300UL)                 /*!< OUTCFG116 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG116_IRPTEN116_Pos      (6UL)                     /*!< IRPTEN116 (Bit 6)                                     */
#define GPIO_PINCFG116_IRPTEN116_Msk      (0xc0UL)                  /*!< IRPTEN116 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG116_RDZERO116_Pos      (5UL)                     /*!< RDZERO116 (Bit 5)                                     */
#define GPIO_PINCFG116_RDZERO116_Msk      (0x20UL)                  /*!< RDZERO116 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG116_INPEN116_Pos       (4UL)                     /*!< INPEN116 (Bit 4)                                      */
#define GPIO_PINCFG116_INPEN116_Msk       (0x10UL)                  /*!< INPEN116 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG116_FNCSEL116_Pos      (0UL)                     /*!< FNCSEL116 (Bit 0)                                     */
#define GPIO_PINCFG116_FNCSEL116_Msk      (0xfUL)                   /*!< FNCSEL116 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG117  ======================================================= */
#define GPIO_PINCFG117_DSPULLCFG117_Pos   (28UL)                    /*!< DSPULLCFG117 (Bit 28)                                 */
#define GPIO_PINCFG117_DSPULLCFG117_Msk   (0x70000000UL)            /*!< DSPULLCFG117 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG117_FOEN117_Pos        (27UL)                    /*!< FOEN117 (Bit 27)                                      */
#define GPIO_PINCFG117_FOEN117_Msk        (0x8000000UL)             /*!< FOEN117 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG117_FIEN117_Pos        (26UL)                    /*!< FIEN117 (Bit 26)                                      */
#define GPIO_PINCFG117_FIEN117_Msk        (0x4000000UL)             /*!< FIEN117 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG117_TIMERSEL117_Pos    (23UL)                    /*!< TIMERSEL117 (Bit 23)                                  */
#define GPIO_PINCFG117_TIMERSEL117_Msk    (0x800000UL)              /*!< TIMERSEL117 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG117_NCEPOL117_Pos      (22UL)                    /*!< NCEPOL117 (Bit 22)                                    */
#define GPIO_PINCFG117_NCEPOL117_Msk      (0x400000UL)              /*!< NCEPOL117 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG117_NCESRC117_Pos      (16UL)                    /*!< NCESRC117 (Bit 16)                                    */
#define GPIO_PINCFG117_NCESRC117_Msk      (0x1f0000UL)              /*!< NCESRC117 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG117_PULLCFG117_Pos     (13UL)                    /*!< PULLCFG117 (Bit 13)                                   */
#define GPIO_PINCFG117_PULLCFG117_Msk     (0xe000UL)                /*!< PULLCFG117 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG117_SR117_Pos          (12UL)                    /*!< SR117 (Bit 12)                                        */
#define GPIO_PINCFG117_SR117_Msk          (0x1000UL)                /*!< SR117 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG117_DS117_Pos          (10UL)                    /*!< DS117 (Bit 10)                                        */
#define GPIO_PINCFG117_DS117_Msk          (0xc00UL)                 /*!< DS117 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG117_OUTCFG117_Pos      (8UL)                     /*!< OUTCFG117 (Bit 8)                                     */
#define GPIO_PINCFG117_OUTCFG117_Msk      (0x300UL)                 /*!< OUTCFG117 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG117_IRPTEN117_Pos      (6UL)                     /*!< IRPTEN117 (Bit 6)                                     */
#define GPIO_PINCFG117_IRPTEN117_Msk      (0xc0UL)                  /*!< IRPTEN117 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG117_RDZERO117_Pos      (5UL)                     /*!< RDZERO117 (Bit 5)                                     */
#define GPIO_PINCFG117_RDZERO117_Msk      (0x20UL)                  /*!< RDZERO117 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG117_INPEN117_Pos       (4UL)                     /*!< INPEN117 (Bit 4)                                      */
#define GPIO_PINCFG117_INPEN117_Msk       (0x10UL)                  /*!< INPEN117 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG117_FNCSEL117_Pos      (0UL)                     /*!< FNCSEL117 (Bit 0)                                     */
#define GPIO_PINCFG117_FNCSEL117_Msk      (0xfUL)                   /*!< FNCSEL117 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG118  ======================================================= */
#define GPIO_PINCFG118_DSPULLCFG118_Pos   (28UL)                    /*!< DSPULLCFG118 (Bit 28)                                 */
#define GPIO_PINCFG118_DSPULLCFG118_Msk   (0x70000000UL)            /*!< DSPULLCFG118 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG118_FOEN118_Pos        (27UL)                    /*!< FOEN118 (Bit 27)                                      */
#define GPIO_PINCFG118_FOEN118_Msk        (0x8000000UL)             /*!< FOEN118 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG118_FIEN118_Pos        (26UL)                    /*!< FIEN118 (Bit 26)                                      */
#define GPIO_PINCFG118_FIEN118_Msk        (0x4000000UL)             /*!< FIEN118 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG118_TIMERSEL118_Pos    (23UL)                    /*!< TIMERSEL118 (Bit 23)                                  */
#define GPIO_PINCFG118_TIMERSEL118_Msk    (0x800000UL)              /*!< TIMERSEL118 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG118_NCEPOL118_Pos      (22UL)                    /*!< NCEPOL118 (Bit 22)                                    */
#define GPIO_PINCFG118_NCEPOL118_Msk      (0x400000UL)              /*!< NCEPOL118 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG118_NCESRC118_Pos      (16UL)                    /*!< NCESRC118 (Bit 16)                                    */
#define GPIO_PINCFG118_NCESRC118_Msk      (0x1f0000UL)              /*!< NCESRC118 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG118_PULLCFG118_Pos     (13UL)                    /*!< PULLCFG118 (Bit 13)                                   */
#define GPIO_PINCFG118_PULLCFG118_Msk     (0xe000UL)                /*!< PULLCFG118 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG118_SR118_Pos          (12UL)                    /*!< SR118 (Bit 12)                                        */
#define GPIO_PINCFG118_SR118_Msk          (0x1000UL)                /*!< SR118 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG118_DS118_Pos          (10UL)                    /*!< DS118 (Bit 10)                                        */
#define GPIO_PINCFG118_DS118_Msk          (0xc00UL)                 /*!< DS118 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG118_OUTCFG118_Pos      (8UL)                     /*!< OUTCFG118 (Bit 8)                                     */
#define GPIO_PINCFG118_OUTCFG118_Msk      (0x300UL)                 /*!< OUTCFG118 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG118_IRPTEN118_Pos      (6UL)                     /*!< IRPTEN118 (Bit 6)                                     */
#define GPIO_PINCFG118_IRPTEN118_Msk      (0xc0UL)                  /*!< IRPTEN118 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG118_RDZERO118_Pos      (5UL)                     /*!< RDZERO118 (Bit 5)                                     */
#define GPIO_PINCFG118_RDZERO118_Msk      (0x20UL)                  /*!< RDZERO118 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG118_INPEN118_Pos       (4UL)                     /*!< INPEN118 (Bit 4)                                      */
#define GPIO_PINCFG118_INPEN118_Msk       (0x10UL)                  /*!< INPEN118 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG118_FNCSEL118_Pos      (0UL)                     /*!< FNCSEL118 (Bit 0)                                     */
#define GPIO_PINCFG118_FNCSEL118_Msk      (0xfUL)                   /*!< FNCSEL118 (Bitfield-Mask: 0x0f)                       */
/* =======================================================  PINCFG119  ======================================================= */
#define GPIO_PINCFG119_DSPULLCFG119_Pos   (28UL)                    /*!< DSPULLCFG119 (Bit 28)                                 */
#define GPIO_PINCFG119_DSPULLCFG119_Msk   (0x70000000UL)            /*!< DSPULLCFG119 (Bitfield-Mask: 0x07)                    */
#define GPIO_PINCFG119_FOEN119_Pos        (27UL)                    /*!< FOEN119 (Bit 27)                                      */
#define GPIO_PINCFG119_FOEN119_Msk        (0x8000000UL)             /*!< FOEN119 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG119_FIEN119_Pos        (26UL)                    /*!< FIEN119 (Bit 26)                                      */
#define GPIO_PINCFG119_FIEN119_Msk        (0x4000000UL)             /*!< FIEN119 (Bitfield-Mask: 0x01)                         */
#define GPIO_PINCFG119_TIMERSEL119_Pos    (23UL)                    /*!< TIMERSEL119 (Bit 23)                                  */
#define GPIO_PINCFG119_TIMERSEL119_Msk    (0x800000UL)              /*!< TIMERSEL119 (Bitfield-Mask: 0x01)                     */
#define GPIO_PINCFG119_NCEPOL119_Pos      (22UL)                    /*!< NCEPOL119 (Bit 22)                                    */
#define GPIO_PINCFG119_NCEPOL119_Msk      (0x400000UL)              /*!< NCEPOL119 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG119_NCESRC119_Pos      (16UL)                    /*!< NCESRC119 (Bit 16)                                    */
#define GPIO_PINCFG119_NCESRC119_Msk      (0x1f0000UL)              /*!< NCESRC119 (Bitfield-Mask: 0x1f)                       */
#define GPIO_PINCFG119_PULLCFG119_Pos     (13UL)                    /*!< PULLCFG119 (Bit 13)                                   */
#define GPIO_PINCFG119_PULLCFG119_Msk     (0xe000UL)                /*!< PULLCFG119 (Bitfield-Mask: 0x07)                      */
#define GPIO_PINCFG119_SR119_Pos          (12UL)                    /*!< SR119 (Bit 12)                                        */
#define GPIO_PINCFG119_SR119_Msk          (0x1000UL)                /*!< SR119 (Bitfield-Mask: 0x01)                           */
#define GPIO_PINCFG119_DS119_Pos          (10UL)                    /*!< DS119 (Bit 10)                                        */
#define GPIO_PINCFG119_DS119_Msk          (0xc00UL)                 /*!< DS119 (Bitfield-Mask: 0x03)                           */
#define GPIO_PINCFG119_OUTCFG119_Pos      (8UL)                     /*!< OUTCFG119 (Bit 8)                                     */
#define GPIO_PINCFG119_OUTCFG119_Msk      (0x300UL)                 /*!< OUTCFG119 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG119_IRPTEN119_Pos      (6UL)                     /*!< IRPTEN119 (Bit 6)                                     */
#define GPIO_PINCFG119_IRPTEN119_Msk      (0xc0UL)                  /*!< IRPTEN119 (Bitfield-Mask: 0x03)                       */
#define GPIO_PINCFG119_RDZERO119_Pos      (5UL)                     /*!< RDZERO119 (Bit 5)                                     */
#define GPIO_PINCFG119_RDZERO119_Msk      (0x20UL)                  /*!< RDZERO119 (Bitfield-Mask: 0x01)                       */
#define GPIO_PINCFG119_INPEN119_Pos       (4UL)                     /*!< INPEN119 (Bit 4)                                      */
#define GPIO_PINCFG119_INPEN119_Msk       (0x10UL)                  /*!< INPEN119 (Bitfield-Mask: 0x01)                        */
#define GPIO_PINCFG119_FNCSEL119_Pos      (0UL)                     /*!< FNCSEL119 (Bit 0)                                     */
#define GPIO_PINCFG119_FNCSEL119_Msk      (0xfUL)                   /*!< FNCSEL119 (Bitfield-Mask: 0x0f)                       */
/* ========================================================  PADKEY  ========================================================= */
#define GPIO_PADKEY_PADKEY_Pos            (0UL)                     /*!< PADKEY (Bit 0)                                        */
#define GPIO_PADKEY_PADKEY_Msk            (0xffffffffUL)            /*!< PADKEY (Bitfield-Mask: 0xffffffff)                    */
/* ==========================================================  RD0  ========================================================== */
#define GPIO_RD0_RD0_Pos                  (0UL)                     /*!< RD0 (Bit 0)                                           */
#define GPIO_RD0_RD0_Msk                  (0xffffffffUL)            /*!< RD0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD1  ========================================================== */
#define GPIO_RD1_RD1_Pos                  (0UL)                     /*!< RD1 (Bit 0)                                           */
#define GPIO_RD1_RD1_Msk                  (0xffffffffUL)            /*!< RD1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD2  ========================================================== */
#define GPIO_RD2_RD2_Pos                  (0UL)                     /*!< RD2 (Bit 0)                                           */
#define GPIO_RD2_RD2_Msk                  (0xffffffffUL)            /*!< RD2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  RD3  ========================================================== */
#define GPIO_RD3_RD3_Pos                  (0UL)                     /*!< RD3 (Bit 0)                                           */
#define GPIO_RD3_RD3_Msk                  (0xffffffffUL)            /*!< RD3 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT0  ========================================================== */
#define GPIO_WT0_WT0_Pos                  (0UL)                     /*!< WT0 (Bit 0)                                           */
#define GPIO_WT0_WT0_Msk                  (0xffffffffUL)            /*!< WT0 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT1  ========================================================== */
#define GPIO_WT1_WT1_Pos                  (0UL)                     /*!< WT1 (Bit 0)                                           */
#define GPIO_WT1_WT1_Msk                  (0xffffffffUL)            /*!< WT1 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT2  ========================================================== */
#define GPIO_WT2_WT2_Pos                  (0UL)                     /*!< WT2 (Bit 0)                                           */
#define GPIO_WT2_WT2_Msk                  (0xffffffffUL)            /*!< WT2 (Bitfield-Mask: 0xffffffff)                       */
/* ==========================================================  WT3  ========================================================== */
#define GPIO_WT3_WT3_Pos                  (0UL)                     /*!< WT3 (Bit 0)                                           */
#define GPIO_WT3_WT3_Msk                  (0xffffffffUL)            /*!< WT3 (Bitfield-Mask: 0xffffffff)                       */
/* =========================================================  WTS0  ========================================================== */
#define GPIO_WTS0_WTS0_Pos                (0UL)                     /*!< WTS0 (Bit 0)                                          */
#define GPIO_WTS0_WTS0_Msk                (0xffffffffUL)            /*!< WTS0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS1  ========================================================== */
#define GPIO_WTS1_WTS1_Pos                (0UL)                     /*!< WTS1 (Bit 0)                                          */
#define GPIO_WTS1_WTS1_Msk                (0xffffffffUL)            /*!< WTS1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS2  ========================================================== */
#define GPIO_WTS2_WTS2_Pos                (0UL)                     /*!< WTS2 (Bit 0)                                          */
#define GPIO_WTS2_WTS2_Msk                (0xffffffffUL)            /*!< WTS2 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTS3  ========================================================== */
#define GPIO_WTS3_WTS3_Pos                (0UL)                     /*!< WTS3 (Bit 0)                                          */
#define GPIO_WTS3_WTS3_Msk                (0xffffffffUL)            /*!< WTS3 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC0  ========================================================== */
#define GPIO_WTC0_WTC0_Pos                (0UL)                     /*!< WTC0 (Bit 0)                                          */
#define GPIO_WTC0_WTC0_Msk                (0xffffffffUL)            /*!< WTC0 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC1  ========================================================== */
#define GPIO_WTC1_WTC1_Pos                (0UL)                     /*!< WTC1 (Bit 0)                                          */
#define GPIO_WTC1_WTC1_Msk                (0xffffffffUL)            /*!< WTC1 (Bitfield-Mask: 0xffffffff)                      */
/* =========================================================  WTC2  ========================================================== */
#define GPIO_WTC2_WTC2_Pos                (0UL)                     /*!< WTC2 (Bit 0)                                          */
#define GPIO_WTC2_WTC2_Msk                (0xffffffffUL)            /*!< WTC2 (Bitfield-Mask: 0xffffffff)                      */
