AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ======================================================  HCIVERSION  ======================================================= */
#define I3C_HCIVERSION_VERSION_Pos        (0UL)                     /*!< VERSION (Bit 0)                                       */
#define I3C_HCIVERSION_VERSION_Msk        (0xffffffffUL)            /*!< VERSION (Bitfield-Mask: 0xffffffff)                   */
/* =======================================================  HCCONTROL  ======================================================= */
#define I3C_HCCONTROL_BUSENABLE_Pos       (31UL)                    /*!< BUSENABLE (Bit 31)                                    */
#define I3C_HCCONTROL_BUSENABLE_Msk       (0x80000000UL)            /*!< BUSENABLE (Bitfield-Mask: 0x01)                       */
#define I3C_HCCONTROL_RESUME_Pos          (30UL)                    /*!< RESUME (Bit 30)                                       */
#define I3C_HCCONTROL_RESUME_Msk          (0x40000000UL)            /*!< RESUME (Bitfield-Mask: 0x01)                          */
#define I3C_HCCONTROL_ABORT_Pos           (29UL)                    /*!< ABORT (Bit 29)                                        */
#define I3C_HCCONTROL_ABORT_Msk           (0x20000000UL)            /*!< ABORT (Bitfield-Mask: 0x01)                           */
#define I3C_HCCONTROL_HALTONCMDSEQTIMEOUT_Pos (12UL)                /*!< HALTONCMDSEQTIMEOUT (Bit 12)                          */
#define I3C_HCCONTROL_HALTONCMDSEQTIMEOUT_Msk (0x1000UL)            /*!< HALTONCMDSEQTIMEOUT (Bitfield-Mask: 0x01)             */
#define I3C_HCCONTROL_HOTJOINCTRL_Pos     (8UL)                     /*!< HOTJOINCTRL (Bit 8)                                   */
#define I3C_HCCONTROL_HOTJOINCTRL_Msk     (0x100UL)                 /*!< HOTJOINCTRL (Bitfield-Mask: 0x01)                     */
#define I3C_HCCONTROL_I2CDEVPRESENT_Pos   (7UL)                     /*!< I2CDEVPRESENT (Bit 7)                                 */
#define I3C_HCCONTROL_I2CDEVPRESENT_Msk   (0x80UL)                  /*!< I2CDEVPRESENT (Bitfield-Mask: 0x01)                   */
#define I3C_HCCONTROL_MODESELECTOR_Pos    (6UL)                     /*!< MODESELECTOR (Bit 6)                                  */
#define I3C_HCCONTROL_MODESELECTOR_Msk    (0x40UL)                  /*!< MODESELECTOR (Bitfield-Mask: 0x01)                    */
#define I3C_HCCONTROL_DATABYTEORDERMODE_Pos (4UL)                   /*!< DATABYTEORDERMODE (Bit 4)                             */
#define I3C_HCCONTROL_DATABYTEORDERMODE_Msk (0x10UL)                /*!< DATABYTEORDERMODE (Bitfield-Mask: 0x01)               */
#define I3C_HCCONTROL_IBAINCLUDE_Pos      (0UL)                     /*!< IBAINCLUDE (Bit 0)                                    */
#define I3C_HCCONTROL_IBAINCLUDE_Msk      (0x1UL)                   /*!< IBAINCLUDE (Bitfield-Mask: 0x01)                      */
/* ======================================================  DEVICEADDR  ======================================================= */
#define I3C_DEVICEADDR_DYNAMICADDRVALID_Pos (31UL)                  /*!< DYNAMICADDRVALID (Bit 31)                             */
#define I3C_DEVICEADDR_DYNAMICADDRVALID_Msk (0x80000000UL)          /*!< DYNAMICADDRVALID (Bitfield-Mask: 0x01)                */
#define I3C_DEVICEADDR_DYNAMICADDR_Pos    (16UL)                    /*!< DYNAMICADDR (Bit 16)                                  */
#define I3C_DEVICEADDR_DYNAMICADDR_Msk    (0x7f0000UL)              /*!< DYNAMICADDR (Bitfield-Mask: 0x7f)                     */
/* ====================================================  HCCAPABILITIES  ===================================================== */
#define I3C_HCCAPABILITIES_SGCAPABILITYDCEN_Pos (30UL)              /*!< SGCAPABILITYDCEN (Bit 30)                             */
#define I3C_HCCAPABILITIES_SGCAPABILITYDCEN_Msk (0x40000000UL)      /*!< SGCAPABILITYDCEN (Bitfield-Mask: 0x01)                */
#define I3C_HCCAPABILITIES_SGCAPABILITYIBIEN_Pos (29UL)             /*!< SGCAPABILITYIBIEN (Bit 29)                            */
#define I3C_HCCAPABILITIES_SGCAPABILITYIBIEN_Msk (0x20000000UL)     /*!< SGCAPABILITYIBIEN (Bitfield-Mask: 0x01)               */
#define I3C_HCCAPABILITIES_SGCAPABILITYCREN_Pos (28UL)              /*!< SGCAPABILITYCREN (Bit 28)                             */
#define I3C_HCCAPABILITIES_SGCAPABILITYCREN_Msk (0x10000000UL)      /*!< SGCAPABILITYCREN (Bitfield-Mask: 0x01)                */
#define I3C_HCCAPABILITIES_CMDSIZE_Pos    (20UL)                    /*!< CMDSIZE (Bit 20)                                      */
#define I3C_HCCAPABILITIES_CMDSIZE_Msk    (0x300000UL)              /*!< CMDSIZE (Bitfield-Mask: 0x03)                         */
#define I3C_HCCAPABILITIES_CMDCCDEFBYTE_Pos (10UL)                  /*!< CMDCCDEFBYTE (Bit 10)                                 */
#define I3C_HCCAPABILITIES_CMDCCDEFBYTE_Msk (0x400UL)               /*!< CMDCCDEFBYTE (Bitfield-Mask: 0x01)                    */
#define I3C_HCCAPABILITIES_HDRTSEN_Pos    (7UL)                     /*!< HDRTSEN (Bit 7)                                       */
#define I3C_HCCAPABILITIES_HDRTSEN_Msk    (0x80UL)                  /*!< HDRTSEN (Bitfield-Mask: 0x01)                         */
#define I3C_HCCAPABILITIES_HDRDDREN_Pos   (6UL)                     /*!< HDRDDREN (Bit 6)                                      */
#define I3C_HCCAPABILITIES_HDRDDREN_Msk   (0x40UL)                  /*!< HDRDDREN (Bitfield-Mask: 0x01)                        */
#define I3C_HCCAPABILITIES_STANDBYCRCAP_Pos (5UL)                   /*!< STANDBYCRCAP (Bit 5)                                  */
#define I3C_HCCAPABILITIES_STANDBYCRCAP_Msk (0x20UL)                /*!< STANDBYCRCAP (Bitfield-Mask: 0x01)                    */
#define I3C_HCCAPABILITIES_AUTOCOMMAND_Pos (3UL)                    /*!< AUTOCOMMAND (Bit 3)                                   */
#define I3C_HCCAPABILITIES_AUTOCOMMAND_Msk (0x8UL)                  /*!< AUTOCOMMAND (Bitfield-Mask: 0x01)                     */
#define I3C_HCCAPABILITIES_COMBOCOMMAND_Pos (2UL)                   /*!< COMBOCOMMAND (Bit 2)                                  */
#define I3C_HCCAPABILITIES_COMBOCOMMAND_Msk (0x4UL)                 /*!< COMBOCOMMAND (Bitfield-Mask: 0x01)                    */
/* =======================================================  RESETCTRL  ======================================================= */
#define I3C_RESETCTRL_IBIQUEUERST_Pos     (5UL)                     /*!< IBIQUEUERST (Bit 5)                                   */
#define I3C_RESETCTRL_IBIQUEUERST_Msk     (0x20UL)                  /*!< IBIQUEUERST (Bitfield-Mask: 0x01)                     */
#define I3C_RESETCTRL_RXFIFORST_Pos       (4UL)                     /*!< RXFIFORST (Bit 4)                                     */
#define I3C_RESETCTRL_RXFIFORST_Msk       (0x10UL)                  /*!< RXFIFORST (Bitfield-Mask: 0x01)                       */
#define I3C_RESETCTRL_TXFIFORST_Pos       (3UL)                     /*!< TXFIFORST (Bit 3)                                     */
#define I3C_RESETCTRL_TXFIFORST_Msk       (0x8UL)                   /*!< TXFIFORST (Bitfield-Mask: 0x01)                       */
#define I3C_RESETCTRL_RESPQUEUERST_Pos    (2UL)                     /*!< RESPQUEUERST (Bit 2)                                  */
#define I3C_RESETCTRL_RESPQUEUERST_Msk    (0x4UL)                   /*!< RESPQUEUERST (Bitfield-Mask: 0x01)                    */
#define I3C_RESETCTRL_CMDQUEUERST_Pos     (1UL)                     /*!< CMDQUEUERST (Bit 1)                                   */
#define I3C_RESETCTRL_CMDQUEUERST_Msk     (0x2UL)                   /*!< CMDQUEUERST (Bitfield-Mask: 0x01)                     */
#define I3C_RESETCTRL_SOFTRST_Pos         (0UL)                     /*!< SOFTRST (Bit 0)                                       */
#define I3C_RESETCTRL_SOFTRST_Msk         (0x1UL)                   /*!< SOFTRST (Bitfield-Mask: 0x01)                         */
/* =====================================================  PRESENTSTATE  ====================================================== */
#define I3C_PRESENTSTATE_CURRENTCONTROLLER_Pos (2UL)                /*!< CURRENTCONTROLLER (Bit 2)                             */
#define I3C_PRESENTSTATE_CURRENTCONTROLLER_Msk (0x4UL)              /*!< CURRENTCONTROLLER (Bitfield-Mask: 0x01)               */
/* ======================================================  INTRSTATUS  ======================================================= */
#define I3C_INTRSTATUS_HCERRCMDSEQTIMEOUTSTAT_Pos (13UL)            /*!< HCERRCMDSEQTIMEOUTSTAT (Bit 13)                       */
#define I3C_INTRSTATUS_HCERRCMDSEQTIMEOUTSTAT_Msk (0x2000UL)        /*!< HCERRCMDSEQTIMEOUTSTAT (Bitfield-Mask: 0x01)          */
#define I3C_INTRSTATUS_HCWARNCMDSEQSTALLSTAT_Pos (12UL)             /*!< HCWARNCMDSEQSTALLSTAT (Bit 12)                        */
#define I3C_INTRSTATUS_HCWARNCMDSEQSTALLSTAT_Msk (0x1000UL)         /*!< HCWARNCMDSEQSTALLSTAT (Bitfield-Mask: 0x01)           */
#define I3C_INTRSTATUS_HCSEQCANCELSTAT_Pos (11UL)                   /*!< HCSEQCANCELSTAT (Bit 11)                              */
#define I3C_INTRSTATUS_HCSEQCANCELSTAT_Msk (0x800UL)                /*!< HCSEQCANCELSTAT (Bitfield-Mask: 0x01)                 */
#define I3C_INTRSTATUS_HCINTERNALERRSTAT_Pos (10UL)                 /*!< HCINTERNALERRSTAT (Bit 10)                            */
#define I3C_INTRSTATUS_HCINTERNALERRSTAT_Msk (0x400UL)              /*!< HCINTERNALERRSTAT (Bitfield-Mask: 0x01)               */
/* ===================================================  INTRSTATUSENABLE  ==================================================== */
#define I3C_INTRSTATUSENABLE_HCERRCMDSEQTIMEOUTSTATEN_Pos (13UL)    /*!< HCERRCMDSEQTIMEOUTSTATEN (Bit 13)                     */
#define I3C_INTRSTATUSENABLE_HCERRCMDSEQTIMEOUTSTATEN_Msk (0x2000UL) /*!< HCERRCMDSEQTIMEOUTSTATEN (Bitfield-Mask: 0x01)       */
#define I3C_INTRSTATUSENABLE_HCWARNCMDSEQSTALLSTATEN_Pos (12UL)     /*!< HCWARNCMDSEQSTALLSTATEN (Bit 12)                      */
#define I3C_INTRSTATUSENABLE_HCWARNCMDSEQSTALLSTATEN_Msk (0x1000UL) /*!< HCWARNCMDSEQSTALLSTATEN (Bitfield-Mask: 0x01)         */
#define I3C_INTRSTATUSENABLE_HCSEQCANCELSTATEN_Pos (11UL)           /*!< HCSEQCANCELSTATEN (Bit 11)                            */
#define I3C_INTRSTATUSENABLE_HCSEQCANCELSTATEN_Msk (0x800UL)        /*!< HCSEQCANCELSTATEN (Bitfield-Mask: 0x01)               */
#define I3C_INTRSTATUSENABLE_HCINTERNALERRSTATEN_Pos (10UL)         /*!< HCINTERNALERRSTATEN (Bit 10)                          */
#define I3C_INTRSTATUSENABLE_HCINTERNALERRSTATEN_Msk (0x400UL)      /*!< HCINTERNALERRSTATEN (Bitfield-Mask: 0x01)             */
/* ===================================================  INTRSIGNALENABLE  ==================================================== */
#define I3C_INTRSIGNALENABLE_HCERRCMDSEQTIMEOUTSIGNALEN_Pos (13UL)  /*!< HCERRCMDSEQTIMEOUTSIGNALEN (Bit 13)                   */
#define I3C_INTRSIGNALENABLE_HCERRCMDSEQTIMEOUTSIGNALEN_Msk (0x2000UL) /*!< HCERRCMDSEQTIMEOUTSIGNALEN (Bitfield-Mask: 0x01)   */
#define I3C_INTRSIGNALENABLE_HCWARNCMDSEQSTALLSIGNALEN_Pos (12UL)   /*!< HCWARNCMDSEQSTALLSIGNALEN (Bit 12)                    */
#define I3C_INTRSIGNALENABLE_HCWARNCMDSEQSTALLSIGNALEN_Msk (0x1000UL) /*!< HCWARNCMDSEQSTALLSIGNALEN (Bitfield-Mask: 0x01)     */
#define I3C_INTRSIGNALENABLE_HCSEQCANCELSIGNALEN_Pos (11UL)         /*!< HCSEQCANCELSIGNALEN (Bit 11)                          */
#define I3C_INTRSIGNALENABLE_HCSEQCANCELSIGNALEN_Msk (0x800UL)      /*!< HCSEQCANCELSIGNALEN (Bitfield-Mask: 0x01)             */
#define I3C_INTRSIGNALENABLE_HCINTERNALERRSIGNALEN_Pos (10UL)       /*!< HCINTERNALERRSIGNALEN (Bit 10)                        */
#define I3C_INTRSIGNALENABLE_HCINTERNALERRSIGNALEN_Msk (0x400UL)    /*!< HCINTERNALERRSIGNALEN (Bitfield-Mask: 0x01)           */
/* =======================================================  INTRFORCE  ======================================================= */
#define I3C_INTRFORCE_HCERRCMDSEQTIMEOUTFORCE_Pos (13UL)            /*!< HCERRCMDSEQTIMEOUTFORCE (Bit 13)                      */
#define I3C_INTRFORCE_HCERRCMDSEQTIMEOUTFORCE_Msk (0x2000UL)        /*!< HCERRCMDSEQTIMEOUTFORCE (Bitfield-Mask: 0x01)         */
#define I3C_INTRFORCE_HCWARNCMDSEQSTALLFORCE_Pos (12UL)             /*!< HCWARNCMDSEQSTALLFORCE (Bit 12)                       */
#define I3C_INTRFORCE_HCWARNCMDSEQSTALLFORCE_Msk (0x1000UL)         /*!< HCWARNCMDSEQSTALLFORCE (Bitfield-Mask: 0x01)          */
#define I3C_INTRFORCE_HCSEQCANCELFORCE_Pos (11UL)                   /*!< HCSEQCANCELFORCE (Bit 11)                             */
#define I3C_INTRFORCE_HCSEQCANCELFORCE_Msk (0x800UL)                /*!< HCSEQCANCELFORCE (Bitfield-Mask: 0x01)                */
#define I3C_INTRFORCE_HCINTERNALERRFORCE_Pos (10UL)                 /*!< HCINTERNALERRFORCE (Bit 10)                           */
#define I3C_INTRFORCE_HCINTERNALERRFORCE_Msk (0x400UL)              /*!< HCINTERNALERRFORCE (Bitfield-Mask: 0x01)              */
/* ===================================================  DATSECTIONOFFSET  ==================================================== */
#define I3C_DATSECTIONOFFSET_DATENTRYSIZE_Pos (28UL)                /*!< DATENTRYSIZE (Bit 28)                                 */
#define I3C_DATSECTIONOFFSET_DATENTRYSIZE_Msk (0xf0000000UL)        /*!< DATENTRYSIZE (Bitfield-Mask: 0x0f)                    */
#define I3C_DATSECTIONOFFSET_DATTABLESIZE_Pos (12UL)                /*!< DATTABLESIZE (Bit 12)                                 */
#define I3C_DATSECTIONOFFSET_DATTABLESIZE_Msk (0x7f000UL)           /*!< DATTABLESIZE (Bitfield-Mask: 0x7f)                    */
#define I3C_DATSECTIONOFFSET_DATTABLEOFFSET_Pos (0UL)               /*!< DATTABLEOFFSET (Bit 0)                                */
#define I3C_DATSECTIONOFFSET_DATTABLEOFFSET_Msk (0xfffUL)           /*!< DATTABLEOFFSET (Bitfield-Mask: 0xfff)                 */
/* ===================================================  DCTSECTIONOFFSET  ==================================================== */
#define I3C_DCTSECTIONOFFSET_DCTENTRYSIZE_Pos (28UL)                /*!< DCTENTRYSIZE (Bit 28)                                 */
#define I3C_DCTSECTIONOFFSET_DCTENTRYSIZE_Msk (0xf0000000UL)        /*!< DCTENTRYSIZE (Bitfield-Mask: 0x0f)                    */
#define I3C_DCTSECTIONOFFSET_DCTTABLEINDEX_Pos (19UL)               /*!< DCTTABLEINDEX (Bit 19)                                */
#define I3C_DCTSECTIONOFFSET_DCTTABLEINDEX_Msk (0xf80000UL)         /*!< DCTTABLEINDEX (Bitfield-Mask: 0x1f)                   */
#define I3C_DCTSECTIONOFFSET_DCTTABLESIZE_Pos (12UL)                /*!< DCTTABLESIZE (Bit 12)                                 */
#define I3C_DCTSECTIONOFFSET_DCTTABLESIZE_Msk (0x7f000UL)           /*!< DCTTABLESIZE (Bitfield-Mask: 0x7f)                    */
#define I3C_DCTSECTIONOFFSET_DCTTABLEOFFSET_Pos (0UL)               /*!< DCTTABLEOFFSET (Bit 0)                                */
#define I3C_DCTSECTIONOFFSET_DCTTABLEOFFSET_Msk (0xfffUL)           /*!< DCTTABLEOFFSET (Bitfield-Mask: 0xfff)                 */
/* ===============================================  RINGHEADERSSECTIONOFFSET  ================================================ */
#define I3C_RINGHEADERSSECTIONOFFSET_RHSECTIONOFFSET_Pos (0UL)      /*!< RHSECTIONOFFSET (Bit 0)                               */
#define I3C_RINGHEADERSSECTIONOFFSET_RHSECTIONOFFSET_Msk (0xffffUL) /*!< RHSECTIONOFFSET (Bitfield-Mask: 0xffff)               */
/* ===================================================  PIOSECTIONOFFSET  ==================================================== */
#define I3C_PIOSECTIONOFFSET_PIOSECTIONOFFSET_Pos (0UL)             /*!< PIOSECTIONOFFSET (Bit 0)                              */
#define I3C_PIOSECTIONOFFSET_PIOSECTIONOFFSET_Msk (0xffffUL)        /*!< PIOSECTIONOFFSET (Bitfield-Mask: 0xffff)              */
/* =================================================  EXTCAPSSECTIONOFFSET  ================================================== */
#define I3C_EXTCAPSSECTIONOFFSET_EXTCAPSSECTIONOFFSET_Pos (0UL)     /*!< EXTCAPSSECTIONOFFSET (Bit 0)                          */
#define I3C_EXTCAPSSECTIONOFFSET_EXTCAPSSECTIONOFFSET_Msk (0xffffUL) /*!< EXTCAPSSECTIONOFFSET (Bitfield-Mask: 0xffff)         */
/* =====================================================  INTCTRLCMDSEN  ===================================================== */
#define I3C_INTCTRLCMDSEN_MIPICMDSSUPPORTED_Pos (1UL)               /*!< MIPICMDSSUPPORTED (Bit 1)                             */
#define I3C_INTCTRLCMDSEN_MIPICMDSSUPPORTED_Msk (0xfffeUL)          /*!< MIPICMDSSUPPORTED (Bitfield-Mask: 0x7fff)             */
#define I3C_INTCTRLCMDSEN_ICCSUPPORT_Pos  (0UL)                     /*!< ICCSUPPORT (Bit 0)                                    */
#define I3C_INTCTRLCMDSEN_ICCSUPPORT_Msk  (0x1UL)                   /*!< ICCSUPPORT (Bitfield-Mask: 0x01)                      */
/* =====================================================  IBINOTIFYCTRL  ===================================================== */
#define I3C_IBINOTIFYCTRL_NOTIFYIBIREJECTED_Pos (3UL)               /*!< NOTIFYIBIREJECTED (Bit 3)                             */
#define I3C_IBINOTIFYCTRL_NOTIFYIBIREJECTED_Msk (0x8UL)             /*!< NOTIFYIBIREJECTED (Bitfield-Mask: 0x01)               */
#define I3C_IBINOTIFYCTRL_NOTIFYCRREJECTED_Pos (1UL)                /*!< NOTIFYCRREJECTED (Bit 1)                              */
#define I3C_IBINOTIFYCTRL_NOTIFYCRREJECTED_Msk (0x2UL)              /*!< NOTIFYCRREJECTED (Bitfield-Mask: 0x01)                */
#define I3C_IBINOTIFYCTRL_NOTIFYHJREJECTED_Pos (0UL)                /*!< NOTIFYHJREJECTED (Bit 0)                              */
#define I3C_IBINOTIFYCTRL_NOTIFYHJREJECTED_Msk (0x1UL)              /*!< NOTIFYHJREJECTED (Bitfield-Mask: 0x01)                */
/* =========================================================  DAT0  ========================================================== */
#define I3C_DAT0_DEVICE_Pos               (31UL)                    /*!< DEVICE (Bit 31)                                       */
#define I3C_DAT0_DEVICE_Msk               (0x80000000UL)            /*!< DEVICE (Bitfield-Mask: 0x01)                          */
#define I3C_DAT0_DEVNACKRETRYCNT_Pos      (29UL)                    /*!< DEVNACKRETRYCNT (Bit 29)                              */
#define I3C_DAT0_DEVNACKRETRYCNT_Msk      (0x60000000UL)            /*!< DEVNACKRETRYCNT (Bitfield-Mask: 0x03)                 */
#define I3C_DAT0_RINGID_Pos               (26UL)                    /*!< RINGID (Bit 26)                                       */
#define I3C_DAT0_RINGID_Msk               (0x1c000000UL)            /*!< RINGID (Bitfield-Mask: 0x07)                          */
#define I3C_DAT0_DAT0DYNAMICADDRESS_Pos   (16UL)                    /*!< DAT0DYNAMICADDRESS (Bit 16)                           */
#define I3C_DAT0_DAT0DYNAMICADDRESS_Msk   (0xff0000UL)              /*!< DAT0DYNAMICADDRESS (Bitfield-Mask: 0xff)              */
#define I3C_DAT0_TS_Pos                   (15UL)                    /*!< TS (Bit 15)                                           */
#define I3C_DAT0_TS_Msk                   (0x8000UL)                /*!< TS (Bitfield-Mask: 0x01)                              */
#define I3C_DAT0_MRREJECT_Pos             (14UL)                    /*!< MRREJECT (Bit 14)                                     */
#define I3C_DAT0_MRREJECT_Msk             (0x4000UL)                /*!< MRREJECT (Bitfield-Mask: 0x01)                        */
#define I3C_DAT0_IBIREJECT_Pos            (13UL)                    /*!< IBIREJECT (Bit 13)                                    */
#define I3C_DAT0_IBIREJECT_Msk            (0x2000UL)                /*!< IBIREJECT (Bitfield-Mask: 0x01)                       */
#define I3C_DAT0_IBIPAYLOAD_Pos           (12UL)                    /*!< IBIPAYLOAD (Bit 12)                                   */
#define I3C_DAT0_IBIPAYLOAD_Msk           (0x1000UL)                /*!< IBIPAYLOAD (Bitfield-Mask: 0x01)                      */
#define I3C_DAT0_STATICADDRESS_Pos        (0UL)                     /*!< STATICADDRESS (Bit 0)                                 */
#define I3C_DAT0_STATICADDRESS_Msk        (0x7fUL)                  /*!< STATICADDRESS (Bitfield-Mask: 0x7f)                   */
/* =========================================================  DAT1  ========================================================== */
#define I3C_DAT1_AUTOCMDHDRCODE_Pos       (19UL)                    /*!< AUTOCMDHDRCODE (Bit 19)                               */
#define I3C_DAT1_AUTOCMDHDRCODE_Msk       (0x7f80000UL)             /*!< AUTOCMDHDRCODE (Bitfield-Mask: 0xff)                  */
#define I3C_DAT1_AUTOCMDMODE_Pos          (16UL)                    /*!< AUTOCMDMODE (Bit 16)                                  */
#define I3C_DAT1_AUTOCMDMODE_Msk          (0x70000UL)               /*!< AUTOCMDMODE (Bitfield-Mask: 0x07)                     */
#define I3C_DAT1_AUTOCMDVALUE_Pos         (8UL)                     /*!< AUTOCMDVALUE (Bit 8)                                  */
#define I3C_DAT1_AUTOCMDVALUE_Msk         (0xff00UL)                /*!< AUTOCMDVALUE (Bitfield-Mask: 0xff)                    */
#define I3C_DAT1_AUTOCMDMASK_Pos          (0UL)                     /*!< AUTOCMDMASK (Bit 0)                                   */
#define I3C_DAT1_AUTOCMDMASK_Msk          (0xffUL)                  /*!< AUTOCMDMASK (Bitfield-Mask: 0xff)                     */
/* =========================================================  DCT0  ========================================================== */
#define I3C_DCT0_DCT0PID_Pos              (0UL)                     /*!< DCT0PID (Bit 0)                                       */
#define I3C_DCT0_DCT0PID_Msk              (0xffffffffUL)            /*!< DCT0PID (Bitfield-Mask: 0xffffffff)                   */
/* =========================================================  DCT1  ========================================================== */
#define I3C_DCT1_DCT1PID_Pos              (0UL)                     /*!< DCT1PID (Bit 0)                                       */
#define I3C_DCT1_DCT1PID_Msk              (0xffffUL)                /*!< DCT1PID (Bitfield-Mask: 0xffff)                       */
/* =========================================================  DCT2  ========================================================== */
#define I3C_DCT2_BCR_Pos                  (8UL)                     /*!< BCR (Bit 8)                                           */
#define I3C_DCT2_BCR_Msk                  (0xff00UL)                /*!< BCR (Bitfield-Mask: 0xff)                             */
#define I3C_DCT2_DCR_Pos                  (0UL)                     /*!< DCR (Bit 0)                                           */
#define I3C_DCT2_DCR_Msk                  (0xffUL)                  /*!< DCR (Bitfield-Mask: 0xff)                             */
/* =========================================================  DCT3  ========================================================== */
#define I3C_DCT3_DCT3DYNAMICADDRESS_Pos   (0UL)                     /*!< DCT3DYNAMICADDRESS (Bit 0)                            */
#define I3C_DCT3_DCT3DYNAMICADDRESS_Msk   (0xffUL)                  /*!< DCT3DYNAMICADDRESS (Bitfield-Mask: 0xff)              */
/* ===================================================  COMMANDQUEUEPORT  ==================================================== */
#define I3C_COMMANDQUEUEPORT_CQDATA_Pos   (0UL)                     /*!< CQDATA (Bit 0)                                        */
#define I3C_COMMANDQUEUEPORT_CQDATA_Msk   (0xffffffffUL)            /*!< CQDATA (Bitfield-Mask: 0xffffffff)                    */
/* ===================================================  RESPONSEQUEUEPORT  =================================================== */
#define I3C_RESPONSEQUEUEPORT_RQDATA_Pos  (0UL)                     /*!< RQDATA (Bit 0)                                        */
