AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define I3C_RESPONSEQUEUEPORT_RQDATA_Msk  (0xffffffffUL)            /*!< RQDATA (Bitfield-Mask: 0xffffffff)                    */
/* =====================================================  XFERDATAPORT  ====================================================== */
#define I3C_XFERDATAPORT_XFERDATA_Pos     (0UL)                     /*!< XFERDATA (Bit 0)                                      */
#define I3C_XFERDATAPORT_XFERDATA_Msk     (0xffffffffUL)            /*!< XFERDATA (Bitfield-Mask: 0xffffffff)                  */
/* ========================================================  IBIPORT  ======================================================== */
#define I3C_IBIPORT_IBIDATA_Pos           (0UL)                     /*!< IBIDATA (Bit 0)                                       */
#define I3C_IBIPORT_IBIDATA_Msk           (0xffffffffUL)            /*!< IBIDATA (Bitfield-Mask: 0xffffffff)                   */
/* =====================================================  QUEUETHLDCTRL  ===================================================== */
#define I3C_QUEUETHLDCTRL_IBISTATUSTHLD_Pos (24UL)                  /*!< IBISTATUSTHLD (Bit 24)                                */
#define I3C_QUEUETHLDCTRL_IBISTATUSTHLD_Msk (0xff000000UL)          /*!< IBISTATUSTHLD (Bitfield-Mask: 0xff)                   */
#define I3C_QUEUETHLDCTRL_IBIDATATHLD_Pos (16UL)                    /*!< IBIDATATHLD (Bit 16)                                  */
#define I3C_QUEUETHLDCTRL_IBIDATATHLD_Msk (0xff0000UL)              /*!< IBIDATATHLD (Bitfield-Mask: 0xff)                     */
#define I3C_QUEUETHLDCTRL_RESPBUFTHLD_Pos (8UL)                     /*!< RESPBUFTHLD (Bit 8)                                   */
#define I3C_QUEUETHLDCTRL_RESPBUFTHLD_Msk (0xff00UL)                /*!< RESPBUFTHLD (Bitfield-Mask: 0xff)                     */
#define I3C_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Pos (0UL)                 /*!< CMDEMPTYBUFTHLD (Bit 0)                               */
#define I3C_QUEUETHLDCTRL_CMDEMPTYBUFTHLD_Msk (0xffUL)              /*!< CMDEMPTYBUFTHLD (Bitfield-Mask: 0xff)                 */
/* ==================================================  DATABUFFERTHLDCTRL  =================================================== */
#define I3C_DATABUFFERTHLDCTRL_RXSTARTTHLD_Pos (24UL)               /*!< RXSTARTTHLD (Bit 24)                                  */
#define I3C_DATABUFFERTHLDCTRL_RXSTARTTHLD_Msk (0x7000000UL)        /*!< RXSTARTTHLD (Bitfield-Mask: 0x07)                     */
#define I3C_DATABUFFERTHLDCTRL_TXSTARTTHLD_Pos (16UL)               /*!< TXSTARTTHLD (Bit 16)                                  */
#define I3C_DATABUFFERTHLDCTRL_TXSTARTTHLD_Msk (0x70000UL)          /*!< TXSTARTTHLD (Bitfield-Mask: 0x07)                     */
#define I3C_DATABUFFERTHLDCTRL_RXBUFTHLD_Pos (8UL)                  /*!< RXBUFTHLD (Bit 8)                                     */
#define I3C_DATABUFFERTHLDCTRL_RXBUFTHLD_Msk (0x700UL)              /*!< RXBUFTHLD (Bitfield-Mask: 0x07)                       */
#define I3C_DATABUFFERTHLDCTRL_TXBUFTHLD_Pos (0UL)                  /*!< TXBUFTHLD (Bit 0)                                     */
#define I3C_DATABUFFERTHLDCTRL_TXBUFTHLD_Msk (0x7UL)                /*!< TXBUFTHLD (Bitfield-Mask: 0x07)                       */
/* =====================================================  QUEUESIZECTRL  ===================================================== */
#define I3C_QUEUESIZECTRL_TXDATABUFFERSIZE_Pos (24UL)               /*!< TXDATABUFFERSIZE (Bit 24)                             */
#define I3C_QUEUESIZECTRL_TXDATABUFFERSIZE_Msk (0xff000000UL)       /*!< TXDATABUFFERSIZE (Bitfield-Mask: 0xff)                */
#define I3C_QUEUESIZECTRL_RXDATABUFFERSIZE_Pos (16UL)               /*!< RXDATABUFFERSIZE (Bit 16)                             */
#define I3C_QUEUESIZECTRL_RXDATABUFFERSIZE_Msk (0xff0000UL)         /*!< RXDATABUFFERSIZE (Bitfield-Mask: 0xff)                */
#define I3C_QUEUESIZECTRL_IBI_Pos         (8UL)                     /*!< IBI (Bit 8)                                           */
#define I3C_QUEUESIZECTRL_IBI_Msk         (0xff00UL)                /*!< IBI (Bitfield-Mask: 0xff)                             */
#define I3C_QUEUESIZECTRL_CRQUEUESIZE_Pos (0UL)                     /*!< CRQUEUESIZE (Bit 0)                                   */
#define I3C_QUEUESIZECTRL_CRQUEUESIZE_Msk (0xffUL)                  /*!< CRQUEUESIZE (Bitfield-Mask: 0xff)                     */
/* =====================================================  PIOINTRSTATUS  ===================================================== */
#define I3C_PIOINTRSTATUS_PIOTRANSFERERRSTAT_Pos (9UL)              /*!< PIOTRANSFERERRSTAT (Bit 9)                            */
#define I3C_PIOINTRSTATUS_PIOTRANSFERERRSTAT_Msk (0x200UL)          /*!< PIOTRANSFERERRSTAT (Bitfield-Mask: 0x01)              */
#define I3C_PIOINTRSTATUS_PIOTRANSFERABORTSTAT_Pos (5UL)            /*!< PIOTRANSFERABORTSTAT (Bit 5)                          */
#define I3C_PIOINTRSTATUS_PIOTRANSFERABORTSTAT_Msk (0x20UL)         /*!< PIOTRANSFERABORTSTAT (Bitfield-Mask: 0x01)            */
#define I3C_PIOINTRSTATUS_RESPREADYSTAT_Pos (4UL)                   /*!< RESPREADYSTAT (Bit 4)                                 */
#define I3C_PIOINTRSTATUS_RESPREADYSTAT_Msk (0x10UL)                /*!< RESPREADYSTAT (Bitfield-Mask: 0x01)                   */
#define I3C_PIOINTRSTATUS_CMDQUEUEREADYSTAT_Pos (3UL)               /*!< CMDQUEUEREADYSTAT (Bit 3)                             */
#define I3C_PIOINTRSTATUS_CMDQUEUEREADYSTAT_Msk (0x8UL)             /*!< CMDQUEUEREADYSTAT (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUS_IBISTATUSTHLDSTAT_Pos (2UL)               /*!< IBISTATUSTHLDSTAT (Bit 2)                             */
#define I3C_PIOINTRSTATUS_IBISTATUSTHLDSTAT_Msk (0x4UL)             /*!< IBISTATUSTHLDSTAT (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSTATUS_RXTHLDSTAT_Pos  (1UL)                     /*!< RXTHLDSTAT (Bit 1)                                    */
#define I3C_PIOINTRSTATUS_RXTHLDSTAT_Msk  (0x2UL)                   /*!< RXTHLDSTAT (Bitfield-Mask: 0x01)                      */
#define I3C_PIOINTRSTATUS_TXTHLDSTAT_Pos  (0UL)                     /*!< TXTHLDSTAT (Bit 0)                                    */
#define I3C_PIOINTRSTATUS_TXTHLDSTAT_Msk  (0x1UL)                   /*!< TXTHLDSTAT (Bitfield-Mask: 0x01)                      */
/* ==================================================  PIOINTRSTATUSENABLE  ================================================== */
#define I3C_PIOINTRSTATUSENABLE_PIOTRANSFERERRSTATEN_Pos (9UL)      /*!< PIOTRANSFERERRSTATEN (Bit 9)                          */
#define I3C_PIOINTRSTATUSENABLE_PIOTRANSFERERRSTATEN_Msk (0x200UL)  /*!< PIOTRANSFERERRSTATEN (Bitfield-Mask: 0x01)            */
#define I3C_PIOINTRSTATUSENABLE_PIOTRANSFERABORTSTATEN_Pos (5UL)    /*!< PIOTRANSFERABORTSTATEN (Bit 5)                        */
#define I3C_PIOINTRSTATUSENABLE_PIOTRANSFERABORTSTATEN_Msk (0x20UL) /*!< PIOTRANSFERABORTSTATEN (Bitfield-Mask: 0x01)          */
#define I3C_PIOINTRSTATUSENABLE_RESPREADYSTATEN_Pos (4UL)           /*!< RESPREADYSTATEN (Bit 4)                               */
#define I3C_PIOINTRSTATUSENABLE_RESPREADYSTATEN_Msk (0x10UL)        /*!< RESPREADYSTATEN (Bitfield-Mask: 0x01)                 */
#define I3C_PIOINTRSTATUSENABLE_CMDQUEUEREADYSTATEN_Pos (3UL)       /*!< CMDQUEUEREADYSTATEN (Bit 3)                           */
#define I3C_PIOINTRSTATUSENABLE_CMDQUEUEREADYSTATEN_Msk (0x8UL)     /*!< CMDQUEUEREADYSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSTATUSENABLE_IBISTATUSTHLDSTATEN_Pos (2UL)       /*!< IBISTATUSTHLDSTATEN (Bit 2)                           */
#define I3C_PIOINTRSTATUSENABLE_IBISTATUSTHLDSTATEN_Msk (0x4UL)     /*!< IBISTATUSTHLDSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRSTATUSENABLE_RXTHLDSTATEN_Pos (1UL)              /*!< RXTHLDSTATEN (Bit 1)                                  */
#define I3C_PIOINTRSTATUSENABLE_RXTHLDSTATEN_Msk (0x2UL)            /*!< RXTHLDSTATEN (Bitfield-Mask: 0x01)                    */
#define I3C_PIOINTRSTATUSENABLE_TXTHLDSTATEN_Pos (0UL)              /*!< TXTHLDSTATEN (Bit 0)                                  */
#define I3C_PIOINTRSTATUSENABLE_TXTHLDSTATEN_Msk (0x1UL)            /*!< TXTHLDSTATEN (Bitfield-Mask: 0x01)                    */
/* ==================================================  PIOINTRSIGNALENABLE  ================================================== */
#define I3C_PIOINTRSIGNALENABLE_PIOTRANSFERERRSIGNALEN_Pos (9UL)    /*!< PIOTRANSFERERRSIGNALEN (Bit 9)                        */
#define I3C_PIOINTRSIGNALENABLE_PIOTRANSFERERRSIGNALEN_Msk (0x200UL) /*!< PIOTRANSFERERRSIGNALEN (Bitfield-Mask: 0x01)         */
#define I3C_PIOINTRSIGNALENABLE_PIOTRANSFERABORTSIGNALEN_Pos (5UL)  /*!< PIOTRANSFERABORTSIGNALEN (Bit 5)                      */
#define I3C_PIOINTRSIGNALENABLE_PIOTRANSFERABORTSIGNALEN_Msk (0x20UL) /*!< PIOTRANSFERABORTSIGNALEN (Bitfield-Mask: 0x01)      */
#define I3C_PIOINTRSIGNALENABLE_RESPREADYSIGNALEN_Pos (4UL)         /*!< RESPREADYSIGNALEN (Bit 4)                             */
#define I3C_PIOINTRSIGNALENABLE_RESPREADYSIGNALEN_Msk (0x10UL)      /*!< RESPREADYSIGNALEN (Bitfield-Mask: 0x01)               */
#define I3C_PIOINTRSIGNALENABLE_CMDQUEUEREADYSIGNALEN_Pos (3UL)     /*!< CMDQUEUEREADYSIGNALEN (Bit 3)                         */
#define I3C_PIOINTRSIGNALENABLE_CMDQUEUEREADYSIGNALEN_Msk (0x8UL)   /*!< CMDQUEUEREADYSIGNALEN (Bitfield-Mask: 0x01)           */
#define I3C_PIOINTRSIGNALENABLE_IBITHLDSIGNALEN_Pos (2UL)           /*!< IBITHLDSIGNALEN (Bit 2)                               */
#define I3C_PIOINTRSIGNALENABLE_IBITHLDSIGNALEN_Msk (0x4UL)         /*!< IBITHLDSIGNALEN (Bitfield-Mask: 0x01)                 */
#define I3C_PIOINTRSIGNALENABLE_RXTHLDSIGNALEN_Pos (1UL)            /*!< RXTHLDSIGNALEN (Bit 1)                                */
#define I3C_PIOINTRSIGNALENABLE_RXTHLDSIGNALEN_Msk (0x2UL)          /*!< RXTHLDSIGNALEN (Bitfield-Mask: 0x01)                  */
#define I3C_PIOINTRSIGNALENABLE_TXTHLDSIGNALEN_Pos (0UL)            /*!< TXTHLDSIGNALEN (Bit 0)                                */
#define I3C_PIOINTRSIGNALENABLE_TXTHLDSIGNALEN_Msk (0x1UL)          /*!< TXTHLDSIGNALEN (Bitfield-Mask: 0x01)                  */
/* =====================================================  PIOINTRFORCE  ====================================================== */
#define I3C_PIOINTRFORCE_PIOTRANSFERERRFORCE_Pos (9UL)              /*!< PIOTRANSFERERRFORCE (Bit 9)                           */
#define I3C_PIOINTRFORCE_PIOTRANSFERERRFORCE_Msk (0x200UL)          /*!< PIOTRANSFERERRFORCE (Bitfield-Mask: 0x01)             */
#define I3C_PIOINTRFORCE_PIOTRANSFERABORTFORCE_Pos (5UL)            /*!< PIOTRANSFERABORTFORCE (Bit 5)                         */
#define I3C_PIOINTRFORCE_PIOTRANSFERABORTFORCE_Msk (0x20UL)         /*!< PIOTRANSFERABORTFORCE (Bitfield-Mask: 0x01)           */
#define I3C_PIOINTRFORCE_RESPREADYFORCE_Pos (4UL)                   /*!< RESPREADYFORCE (Bit 4)                                */
#define I3C_PIOINTRFORCE_RESPREADYFORCE_Msk (0x10UL)                /*!< RESPREADYFORCE (Bitfield-Mask: 0x01)                  */
#define I3C_PIOINTRFORCE_CMDQUEUEREADYFORCE_Pos (3UL)               /*!< CMDQUEUEREADYFORCE (Bit 3)                            */
#define I3C_PIOINTRFORCE_CMDQUEUEREADYFORCE_Msk (0x8UL)             /*!< CMDQUEUEREADYFORCE (Bitfield-Mask: 0x01)              */
#define I3C_PIOINTRFORCE_IBITHLDFORCE_Pos (2UL)                     /*!< IBITHLDFORCE (Bit 2)                                  */
#define I3C_PIOINTRFORCE_IBITHLDFORCE_Msk (0x4UL)                   /*!< IBITHLDFORCE (Bitfield-Mask: 0x01)                    */
#define I3C_PIOINTRFORCE_RXTHLDFORCE_Pos  (1UL)                     /*!< RXTHLDFORCE (Bit 1)                                   */
#define I3C_PIOINTRFORCE_RXTHLDFORCE_Msk  (0x2UL)                   /*!< RXTHLDFORCE (Bitfield-Mask: 0x01)                     */
#define I3C_PIOINTRFORCE_TXTHLDFORCE_Pos  (0UL)                     /*!< TXTHLDFORCE (Bit 0)                                   */
#define I3C_PIOINTRFORCE_TXTHLDFORCE_Msk  (0x1UL)                   /*!< TXTHLDFORCE (Bitfield-Mask: 0x01)                     */
/* ======================================================  RHSCONTROL  ======================================================= */
#define I3C_RHSCONTROL_PREAMBLESIZE_Pos   (24UL)                    /*!< PREAMBLESIZE (Bit 24)                                 */
#define I3C_RHSCONTROL_PREAMBLESIZE_Msk   (0xff000000UL)            /*!< PREAMBLESIZE (Bitfield-Mask: 0xff)                    */
#define I3C_RHSCONTROL_HEADERSIZE_Pos     (16UL)                    /*!< HEADERSIZE (Bit 16)                                   */
#define I3C_RHSCONTROL_HEADERSIZE_Msk     (0xff0000UL)              /*!< HEADERSIZE (Bitfield-Mask: 0xff)                      */
#define I3C_RHSCONTROL_MAXHEADERCOUNTCAPABILITY_Pos (4UL)           /*!< MAXHEADERCOUNTCAPABILITY (Bit 4)                      */
#define I3C_RHSCONTROL_MAXHEADERCOUNTCAPABILITY_Msk (0xf0UL)        /*!< MAXHEADERCOUNTCAPABILITY (Bitfield-Mask: 0x0f)        */
#define I3C_RHSCONTROL_MAXHEADERCOUNT_Pos (0UL)                     /*!< MAXHEADERCOUNT (Bit 0)                                */
#define I3C_RHSCONTROL_MAXHEADERCOUNT_Msk (0xfUL)                   /*!< MAXHEADERCOUNT (Bitfield-Mask: 0x0f)                  */
/* =======================================================  RH0OFFSET  ======================================================= */
#define I3C_RH0OFFSET_RH0OFFSET_Pos       (0UL)                     /*!< RH0OFFSET (Bit 0)                                     */
#define I3C_RH0OFFSET_RH0OFFSET_Msk       (0xffffffffUL)            /*!< RH0OFFSET (Bitfield-Mask: 0xffffffff)                 */
/* =======================================================  RH1OFFSET  ======================================================= */
#define I3C_RH1OFFSET_RH1OFFSET_Pos       (0UL)                     /*!< RH1OFFSET (Bit 0)                                     */
#define I3C_RH1OFFSET_RH1OFFSET_Msk       (0xffffffffUL)            /*!< RH1OFFSET (Bitfield-Mask: 0xffffffff)                 */
/* =======================================================  RH2OFFSET  ======================================================= */
#define I3C_RH2OFFSET_RH2OFFSET_Pos       (0UL)                     /*!< RH2OFFSET (Bit 0)                                     */
#define I3C_RH2OFFSET_RH2OFFSET_Msk       (0xffffffffUL)            /*!< RH2OFFSET (Bitfield-Mask: 0xffffffff)                 */
/* =======================================================  RH3OFFSET  ======================================================= */
#define I3C_RH3OFFSET_RH3OFFSET_Pos       (0UL)                     /*!< RH3OFFSET (Bit 0)                                     */
#define I3C_RH3OFFSET_RH3OFFSET_Msk       (0xffffffffUL)            /*!< RH3OFFSET (Bitfield-Mask: 0xffffffff)                 */
/* ========================================================  CRSETUP  ======================================================== */
#define I3C_CRSETUP_XFERSTRUCTSIZE_Pos    (24UL)                    /*!< XFERSTRUCTSIZE (Bit 24)                               */
#define I3C_CRSETUP_XFERSTRUCTSIZE_Msk    (0xff000000UL)            /*!< XFERSTRUCTSIZE (Bitfield-Mask: 0xff)                  */
#define I3C_CRSETUP_RESPSTRUCTSIZE_Pos    (16UL)                    /*!< RESPSTRUCTSIZE (Bit 16)                               */
#define I3C_CRSETUP_RESPSTRUCTSIZE_Msk    (0xff0000UL)              /*!< RESPSTRUCTSIZE (Bitfield-Mask: 0xff)                  */
#define I3C_CRSETUP_RINGSIZE_Pos          (0UL)                     /*!< RINGSIZE (Bit 0)                                      */
#define I3C_CRSETUP_RINGSIZE_Msk          (0xffUL)                  /*!< RINGSIZE (Bitfield-Mask: 0xff)                        */
/* =======================================================  IBISETUP  ======================================================== */
#define I3C_IBISETUP_IBISTATUSSTRUCTSIZE_Pos (24UL)                 /*!< IBISTATUSSTRUCTSIZE (Bit 24)                          */
#define I3C_IBISETUP_IBISTATUSSTRUCTSIZE_Msk (0xff000000UL)         /*!< IBISTATUSSTRUCTSIZE (Bitfield-Mask: 0xff)             */
#define I3C_IBISETUP_IBISTATUSRINGSIZE_Pos (16UL)                   /*!< IBISTATUSRINGSIZE (Bit 16)                            */
#define I3C_IBISETUP_IBISTATUSRINGSIZE_Msk (0xff0000UL)             /*!< IBISTATUSRINGSIZE (Bitfield-Mask: 0xff)               */
#define I3C_IBISETUP_CHUNKSIZE_Pos        (10UL)                    /*!< CHUNKSIZE (Bit 10)                                    */
#define I3C_IBISETUP_CHUNKSIZE_Msk        (0x1c00UL)                /*!< CHUNKSIZE (Bitfield-Mask: 0x07)                       */
#define I3C_IBISETUP_CHUNKCOUNT_Pos       (0UL)                     /*!< CHUNKCOUNT (Bit 0)                                    */
#define I3C_IBISETUP_CHUNKCOUNT_Msk       (0x3ffUL)                 /*!< CHUNKCOUNT (Bitfield-Mask: 0x3ff)                     */
/* =====================================================  CHUNKCONTROL  ====================================================== */
#define I3C_CHUNKCONTROL_CHUNKCOUNTER_Pos (0UL)                     /*!< CHUNKCOUNTER (Bit 0)                                  */
#define I3C_CHUNKCONTROL_CHUNKCOUNTER_Msk (0xffffffffUL)            /*!< CHUNKCOUNTER (Bitfield-Mask: 0xffffffff)              */
/* =====================================================  RHINTRSTATUS  ====================================================== */
#define I3C_RHINTRSTATUS_IBIREADYSTAT_Pos (12UL)                    /*!< IBIREADYSTAT (Bit 12)                                 */
#define I3C_RHINTRSTATUS_IBIREADYSTAT_Msk (0x1000UL)                /*!< IBIREADYSTAT (Bitfield-Mask: 0x01)                    */
#define I3C_RHINTRSTATUS_TRANSFERCOMPLETIONSTAT_Pos (11UL)          /*!< TRANSFERCOMPLETIONSTAT (Bit 11)                       */
#define I3C_RHINTRSTATUS_TRANSFERCOMPLETIONSTAT_Msk (0x800UL)       /*!< TRANSFERCOMPLETIONSTAT (Bitfield-Mask: 0x01)          */
#define I3C_RHINTRSTATUS_RINGOPSTAT_Pos   (10UL)                    /*!< RINGOPSTAT (Bit 10)                                   */
#define I3C_RHINTRSTATUS_RINGOPSTAT_Msk   (0x400UL)                 /*!< RINGOPSTAT (Bitfield-Mask: 0x01)                      */
#define I3C_RHINTRSTATUS_RHTRANSFERERRSTAT_Pos (9UL)                /*!< RHTRANSFERERRSTAT (Bit 9)                             */
#define I3C_RHINTRSTATUS_RHTRANSFERERRSTAT_Msk (0x200UL)            /*!< RHTRANSFERERRSTAT (Bitfield-Mask: 0x01)               */
#define I3C_RHINTRSTATUS_IBIRINGFULLSTAT_Pos (6UL)                  /*!< IBIRINGFULLSTAT (Bit 6)                               */
#define I3C_RHINTRSTATUS_IBIRINGFULLSTAT_Msk (0x40UL)               /*!< IBIRINGFULLSTAT (Bitfield-Mask: 0x01)                 */
#define I3C_RHINTRSTATUS_RHTRANSFERABORTSTAT_Pos (5UL)              /*!< RHTRANSFERABORTSTAT (Bit 5)                           */
#define I3C_RHINTRSTATUS_RHTRANSFERABORTSTAT_Msk (0x20UL)           /*!< RHTRANSFERABORTSTAT (Bitfield-Mask: 0x01)             */
/* ==================================================  RHINTRSTATUSENABLE  =================================================== */
#define I3C_RHINTRSTATUSENABLE_IBIREADYSTATEN_Pos (12UL)            /*!< IBIREADYSTATEN (Bit 12)                               */
#define I3C_RHINTRSTATUSENABLE_IBIREADYSTATEN_Msk (0x1000UL)        /*!< IBIREADYSTATEN (Bitfield-Mask: 0x01)                  */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERCOMPLETIONSTATEN_Pos (11UL) /*!< RHTRANSFERCOMPLETIONSTATEN (Bit 11)                  */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERCOMPLETIONSTATEN_Msk (0x800UL) /*!< RHTRANSFERCOMPLETIONSTATEN (Bitfield-Mask: 0x01)  */
#define I3C_RHINTRSTATUSENABLE_RINGOPSTATEN_Pos (10UL)              /*!< RINGOPSTATEN (Bit 10)                                 */
#define I3C_RHINTRSTATUSENABLE_RINGOPSTATEN_Msk (0x400UL)           /*!< RINGOPSTATEN (Bitfield-Mask: 0x01)                    */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERERRSTATEN_Pos (9UL)        /*!< RHTRANSFERERRSTATEN (Bit 9)                           */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERERRSTATEN_Msk (0x200UL)    /*!< RHTRANSFERERRSTATEN (Bitfield-Mask: 0x01)             */
#define I3C_RHINTRSTATUSENABLE_IBIRINGFULLSTATEN_Pos (6UL)          /*!< IBIRINGFULLSTATEN (Bit 6)                             */
#define I3C_RHINTRSTATUSENABLE_IBIRINGFULLSTATEN_Msk (0x40UL)       /*!< IBIRINGFULLSTATEN (Bitfield-Mask: 0x01)               */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERABORTSTATEN_Pos (5UL)      /*!< RHTRANSFERABORTSTATEN (Bit 5)                         */
#define I3C_RHINTRSTATUSENABLE_RHTRANSFERABORTSTATEN_Msk (0x20UL)   /*!< RHTRANSFERABORTSTATEN (Bitfield-Mask: 0x01)           */
/* ==================================================  RHINTRSIGNALENABLE  =================================================== */
#define I3C_RHINTRSIGNALENABLE_IBIREADYSIGNALEN_Pos (12UL)          /*!< IBIREADYSIGNALEN (Bit 12)                             */
#define I3C_RHINTRSIGNALENABLE_IBIREADYSIGNALEN_Msk (0x1000UL)      /*!< IBIREADYSIGNALEN (Bitfield-Mask: 0x01)                */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERCOMPLETIONSIGNALEN_Pos (11UL) /*!< RHTRANSFERCOMPLETIONSIGNALEN (Bit 11)              */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERCOMPLETIONSIGNALEN_Msk (0x800UL) /*!< RHTRANSFERCOMPLETIONSIGNALEN (Bitfield-Mask: 0x01) */
#define I3C_RHINTRSIGNALENABLE_RINGOP_Pos (10UL)                    /*!< RINGOP (Bit 10)                                       */
#define I3C_RHINTRSIGNALENABLE_RINGOP_Msk (0x400UL)                 /*!< RINGOP (Bitfield-Mask: 0x01)                          */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERERRSIGNALEN_Pos (9UL)      /*!< RHTRANSFERERRSIGNALEN (Bit 9)                         */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERERRSIGNALEN_Msk (0x200UL)  /*!< RHTRANSFERERRSIGNALEN (Bitfield-Mask: 0x01)           */
#define I3C_RHINTRSIGNALENABLE_IBIRINGFULLSIGNALEN_Pos (6UL)        /*!< IBIRINGFULLSIGNALEN (Bit 6)                           */
#define I3C_RHINTRSIGNALENABLE_IBIRINGFULLSIGNALEN_Msk (0x40UL)     /*!< IBIRINGFULLSIGNALEN (Bitfield-Mask: 0x01)             */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERABORTSIGNALEN_Pos (5UL)    /*!< RHTRANSFERABORTSIGNALEN (Bit 5)                       */
#define I3C_RHINTRSIGNALENABLE_RHTRANSFERABORTSIGNALEN_Msk (0x20UL) /*!< RHTRANSFERABORTSIGNALEN (Bitfield-Mask: 0x01)         */
/* ======================================================  RHINTRFORCE  ====================================================== */
#define I3C_RHINTRFORCE_IBIREADYFORCE_Pos (12UL)                    /*!< IBIREADYFORCE (Bit 12)                                */
#define I3C_RHINTRFORCE_IBIREADYFORCE_Msk (0x1000UL)                /*!< IBIREADYFORCE (Bitfield-Mask: 0x01)                   */
#define I3C_RHINTRFORCE_TRANSFERCOMPLETIONFORCE_Pos (11UL)          /*!< TRANSFERCOMPLETIONFORCE (Bit 11)                      */
#define I3C_RHINTRFORCE_TRANSFERCOMPLETIONFORCE_Msk (0x800UL)       /*!< TRANSFERCOMPLETIONFORCE (Bitfield-Mask: 0x01)         */
#define I3C_RHINTRFORCE_RINGOPFORCE_Pos   (10UL)                    /*!< RINGOPFORCE (Bit 10)                                  */
#define I3C_RHINTRFORCE_RINGOPFORCE_Msk   (0x400UL)                 /*!< RINGOPFORCE (Bitfield-Mask: 0x01)                     */
#define I3C_RHINTRFORCE_TRANSFERERRFORCE_Pos (9UL)                  /*!< TRANSFERERRFORCE (Bit 9)                              */
#define I3C_RHINTRFORCE_TRANSFERERRFORCE_Msk (0x200UL)              /*!< TRANSFERERRFORCE (Bitfield-Mask: 0x01)                */
#define I3C_RHINTRFORCE_IBIRINGFULLFORCE_Pos (6UL)                  /*!< IBIRINGFULLFORCE (Bit 6)                              */
#define I3C_RHINTRFORCE_IBIRINGFULLFORCE_Msk (0x40UL)               /*!< IBIRINGFULLFORCE (Bitfield-Mask: 0x01)                */
