AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define I3C_RHINTRFORCE_TRANSFERABORTFORCE_Pos (5UL)                /*!< TRANSFERABORTFORCE (Bit 5)                            */
#define I3C_RHINTRFORCE_TRANSFERABORTFORCE_Msk (0x20UL)             /*!< TRANSFERABORTFORCE (Bitfield-Mask: 0x01)              */
/* =======================================================  RHSTATUS  ======================================================== */
#define I3C_RHSTATUS_LOCKED_Pos           (3UL)                     /*!< LOCKED (Bit 3)                                        */
#define I3C_RHSTATUS_LOCKED_Msk           (0x8UL)                   /*!< LOCKED (Bitfield-Mask: 0x01)                          */
#define I3C_RHSTATUS_ABORTED_Pos          (2UL)                     /*!< ABORTED (Bit 2)                                       */
#define I3C_RHSTATUS_ABORTED_Msk          (0x4UL)                   /*!< ABORTED (Bitfield-Mask: 0x01)                         */
#define I3C_RHSTATUS_RUNNING_Pos          (1UL)                     /*!< RUNNING (Bit 1)                                       */
#define I3C_RHSTATUS_RUNNING_Msk          (0x2UL)                   /*!< RUNNING (Bitfield-Mask: 0x01)                         */
#define I3C_RHSTATUS_ENABLED_Pos          (0UL)                     /*!< ENABLED (Bit 0)                                       */
#define I3C_RHSTATUS_ENABLED_Msk          (0x1UL)                   /*!< ENABLED (Bitfield-Mask: 0x01)                         */
/* =======================================================  RHCONTROL  ======================================================= */
#define I3C_RHCONTROL_RHABORT_Pos         (2UL)                     /*!< RHABORT (Bit 2)                                       */
#define I3C_RHCONTROL_RHABORT_Msk         (0x4UL)                   /*!< RHABORT (Bitfield-Mask: 0x01)                         */
#define I3C_RHCONTROL_RS_Pos              (1UL)                     /*!< RS (Bit 1)                                            */
#define I3C_RHCONTROL_RS_Msk              (0x2UL)                   /*!< RS (Bitfield-Mask: 0x01)                              */
#define I3C_RHCONTROL_ENABLE_Pos          (0UL)                     /*!< ENABLE (Bit 0)                                        */
#define I3C_RHCONTROL_ENABLE_Msk          (0x1UL)                   /*!< ENABLE (Bitfield-Mask: 0x01)                          */
/* =====================================================  RHOPERATION1  ====================================================== */
#define I3C_RHOPERATION1_IBISWDEQPTR_Pos  (16UL)                    /*!< IBISWDEQPTR (Bit 16)                                  */
#define I3C_RHOPERATION1_IBISWDEQPTR_Msk  (0xff0000UL)              /*!< IBISWDEQPTR (Bitfield-Mask: 0xff)                     */
#define I3C_RHOPERATION1_CRSWDEQPTR_Pos   (8UL)                     /*!< CRSWDEQPTR (Bit 8)                                    */
#define I3C_RHOPERATION1_CRSWDEQPTR_Msk   (0xff00UL)                /*!< CRSWDEQPTR (Bitfield-Mask: 0xff)                      */
#define I3C_RHOPERATION1_CRENQPTR_Pos     (0UL)                     /*!< CRENQPTR (Bit 0)                                      */
#define I3C_RHOPERATION1_CRENQPTR_Msk     (0xffUL)                  /*!< CRENQPTR (Bitfield-Mask: 0xff)                        */
/* =====================================================  RHOPERATION2  ====================================================== */
#define I3C_RHOPERATION2_IBIENQPTR_Pos    (16UL)                    /*!< IBIENQPTR (Bit 16)                                    */
#define I3C_RHOPERATION2_IBIENQPTR_Msk    (0xff0000UL)              /*!< IBIENQPTR (Bitfield-Mask: 0xff)                       */
#define I3C_RHOPERATION2_CRDEQPTR_Pos     (0UL)                     /*!< CRDEQPTR (Bit 0)                                      */
#define I3C_RHOPERATION2_CRDEQPTR_Msk     (0xffUL)                  /*!< CRDEQPTR (Bitfield-Mask: 0xff)                        */
/* ====================================================  RHCMDRINGBASELO  ==================================================== */
#define I3C_RHCMDRINGBASELO_RHCMDRINGBASELO_Pos (0UL)               /*!< RHCMDRINGBASELO (Bit 0)                               */
#define I3C_RHCMDRINGBASELO_RHCMDRINGBASELO_Msk (0xffffffffUL)      /*!< RHCMDRINGBASELO (Bitfield-Mask: 0xffffffff)           */
/* ====================================================  RHCMDRINGBASEHI  ==================================================== */
#define I3C_RHCMDRINGBASEHI_RHCMDRINGBASEHI_Pos (0UL)               /*!< RHCMDRINGBASEHI (Bit 0)                               */
#define I3C_RHCMDRINGBASEHI_RHCMDRINGBASEHI_Msk (0xffffffffUL)      /*!< RHCMDRINGBASEHI (Bitfield-Mask: 0xffffffff)           */
/* ===================================================  RHRESPRINGBASELO  ==================================================== */
#define I3C_RHRESPRINGBASELO_RHSPRINGBASELO_Pos (0UL)               /*!< RHSPRINGBASELO (Bit 0)                                */
#define I3C_RHRESPRINGBASELO_RHSPRINGBASELO_Msk (0xffffffffUL)      /*!< RHSPRINGBASELO (Bitfield-Mask: 0xffffffff)            */
/* ===================================================  RHRESPRINGBASEHI  ==================================================== */
#define I3C_RHRESPRINGBASEHI_RHRESPRINGBASEHI_Pos (0UL)             /*!< RHRESPRINGBASEHI (Bit 0)                              */
#define I3C_RHRESPRINGBASEHI_RHRESPRINGBASEHI_Msk (0xffffffffUL)    /*!< RHRESPRINGBASEHI (Bitfield-Mask: 0xffffffff)          */
/* =================================================  RHIBISTATUSRINGBASELO  ================================================= */
#define I3C_RHIBISTATUSRINGBASELO_RHIBISTATBASELO_Pos (0UL)         /*!< RHIBISTATBASELO (Bit 0)                               */
#define I3C_RHIBISTATUSRINGBASELO_RHIBISTATBASELO_Msk (0xffffffffUL) /*!< RHIBISTATBASELO (Bitfield-Mask: 0xffffffff)          */
/* =================================================  RHIBISTATUSRINGBASEHI  ================================================= */
#define I3C_RHIBISTATUSRINGBASEHI_RHIBISTATBASEHI_Pos (0UL)         /*!< RHIBISTATBASEHI (Bit 0)                               */
#define I3C_RHIBISTATUSRINGBASEHI_RHIBISTATBASEHI_Msk (0xffffffffUL) /*!< RHIBISTATBASEHI (Bitfield-Mask: 0xffffffff)          */
/* ==================================================  RHIBIDATARINGBASELO  ================================================== */
#define I3C_RHIBIDATARINGBASELO_RHIBIDATABASELO_Pos (0UL)           /*!< RHIBIDATABASELO (Bit 0)                               */
#define I3C_RHIBIDATARINGBASELO_RHIBIDATABASELO_Msk (0xffffffffUL)  /*!< RHIBIDATABASELO (Bitfield-Mask: 0xffffffff)           */
/* ==================================================  RHIBIDATARINGBASEHI  ================================================== */
#define I3C_RHIBIDATARINGBASEHI_RHIBIDATABASEHI_Pos (0UL)           /*!< RHIBIDATABASEHI (Bit 0)                               */
#define I3C_RHIBIDATARINGBASEHI_RHIBIDATABASEHI_Msk (0xffffffffUL)  /*!< RHIBIDATABASEHI (Bitfield-Mask: 0xffffffff)           */
/* =====================================================  EXTCAPHEADER  ====================================================== */
#define I3C_EXTCAPHEADER_CAPLENGTH_Pos    (8UL)                     /*!< CAPLENGTH (Bit 8)                                     */
#define I3C_EXTCAPHEADER_CAPLENGTH_Msk    (0xffff00UL)              /*!< CAPLENGTH (Bitfield-Mask: 0xffff)                     */
#define I3C_EXTCAPHEADER_CAPID_Pos        (0UL)                     /*!< CAPID (Bit 0)                                         */
#define I3C_EXTCAPHEADER_CAPID_Msk        (0xffUL)                  /*!< CAPID (Bitfield-Mask: 0xff)                           */
/* ===================================================  COMPMANUFACTURER  ==================================================== */
#define I3C_COMPMANUFACTURER_MIPIVENDORID_Pos (0UL)                 /*!< MIPIVENDORID (Bit 0)                                  */
#define I3C_COMPMANUFACTURER_MIPIVENDORID_Msk (0xffffffffUL)        /*!< MIPIVENDORID (Bitfield-Mask: 0xffffffff)              */
/* ======================================================  COMPVERSION  ====================================================== */
#define I3C_COMPVERSION_I3CVERID_Pos      (0UL)                     /*!< I3CVERID (Bit 0)                                      */
#define I3C_COMPVERSION_I3CVERID_Msk      (0xffffffffUL)            /*!< I3CVERID (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  COMPTYPE  ======================================================== */
#define I3C_COMPTYPE_I3CPRODUCTID_Pos     (0UL)                     /*!< I3CPRODUCTID (Bit 0)                                  */
#define I3C_COMPTYPE_I3CPRODUCTID_Msk     (0xffffffffUL)            /*!< I3CPRODUCTID (Bitfield-Mask: 0xffffffff)              */
/* =====================================================  MASTERCONFIG  ====================================================== */
#define I3C_MASTERCONFIG_OPERATIONMODE_Pos (4UL)                    /*!< OPERATIONMODE (Bit 4)                                 */
#define I3C_MASTERCONFIG_OPERATIONMODE_Msk (0x30UL)                 /*!< OPERATIONMODE (Bitfield-Mask: 0x03)                   */
/* ===================================================  I2CURD1SCLLOWCNT  ==================================================== */
#define I3C_I2CURD1SCLLOWCNT_SCLLOWCNTURD1_Pos (0UL)                /*!< SCLLOWCNTURD1 (Bit 0)                                 */
#define I3C_I2CURD1SCLLOWCNT_SCLLOWCNTURD1_Msk (0xffUL)             /*!< SCLLOWCNTURD1 (Bitfield-Mask: 0xff)                   */
/* ===================================================  I2CURD1SCLHIGHCNT  =================================================== */
#define I3C_I2CURD1SCLHIGHCNT_SCLHIGHCNTURD1_Pos (0UL)              /*!< SCLHIGHCNTURD1 (Bit 0)                                */
#define I3C_I2CURD1SCLHIGHCNT_SCLHIGHCNTURD1_Msk (0xffUL)           /*!< SCLHIGHCNTURD1 (Bitfield-Mask: 0xff)                  */
/* ===================================================  I2CURD2SCLLOWCNT  ==================================================== */
#define I3C_I2CURD2SCLLOWCNT_SCLLOWCNTURD2_Pos (0UL)                /*!< SCLLOWCNTURD2 (Bit 0)                                 */
#define I3C_I2CURD2SCLLOWCNT_SCLLOWCNTURD2_Msk (0xffUL)             /*!< SCLLOWCNTURD2 (Bitfield-Mask: 0xff)                   */
/* ===================================================  I2CURD2SCLHIGHCNT  =================================================== */
#define I3C_I2CURD2SCLHIGHCNT_SCLHIGHCNTURD2_Pos (0UL)              /*!< SCLHIGHCNTURD2 (Bit 0)                                */
#define I3C_I2CURD2SCLHIGHCNT_SCLHIGHCNTURD2_Msk (0xffUL)           /*!< SCLHIGHCNTURD2 (Bitfield-Mask: 0xff)                  */
/* ===================================================  I2CURD3SCLLOWCNT  ==================================================== */
#define I3C_I2CURD3SCLLOWCNT_SCLLOWCNTURD3_Pos (0UL)                /*!< SCLLOWCNTURD3 (Bit 0)                                 */
#define I3C_I2CURD3SCLLOWCNT_SCLLOWCNTURD3_Msk (0xffUL)             /*!< SCLLOWCNTURD3 (Bitfield-Mask: 0xff)                   */
/* ===================================================  I2CURD3SCLHIGHCNT  =================================================== */
#define I3C_I2CURD3SCLHIGHCNT_SCLHIGHCNTURD3_Pos (0UL)              /*!< SCLHIGHCNTURD3 (Bit 0)                                */
#define I3C_I2CURD3SCLHIGHCNT_SCLHIGHCNTURD3_Msk (0xffUL)           /*!< SCLHIGHCNTURD3 (Bitfield-Mask: 0xff)                  */


/* =========================================================================================================================== */
/* ================                                           IOM0                                            ================ */
/* =========================================================================================================================== */

