AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =======================================================  VREFGEN5  ======================================================== */
#define MCUCTRL_VREFGEN5_TVRGSBODTRIM_Pos (22UL)                    /*!< TVRGSBODTRIM (Bit 22)                                 */
#define MCUCTRL_VREFGEN5_TVRGSBODTRIM_Msk (0xc00000UL)              /*!< TVRGSBODTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_VREFGEN5_TVRGSPWLGAINADJ_Pos (21UL)                 /*!< TVRGSPWLGAINADJ (Bit 21)                              */
#define MCUCTRL_VREFGEN5_TVRGSPWLGAINADJ_Msk (0x200000UL)           /*!< TVRGSPWLGAINADJ (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Pos (20UL)                /*!< TVRGSCURRENTTRIM (Bit 20)                             */
#define MCUCTRL_VREFGEN5_TVRGSCURRENTTRIM_Msk (0x100000UL)          /*!< TVRGSCURRENTTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Pos (19UL)                 /*!< TVRGSHSENRESDIV (Bit 19)                              */
#define MCUCTRL_VREFGEN5_TVRGSHSENRESDIV_Msk (0x80000UL)            /*!< TVRGSHSENRESDIV (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Pos    (18UL)                    /*!< TVRGSPDNB (Bit 18)                                    */
#define MCUCTRL_VREFGEN5_TVRGSPDNB_Msk    (0x40000UL)               /*!< TVRGSPDNB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Pos (13UL)              /*!< TVRGSPWLTEMPCOTRIM (Bit 13)                           */
#define MCUCTRL_VREFGEN5_TVRGSPWLTEMPCOTRIM_Msk (0x3e000UL)         /*!< TVRGSPWLTEMPCOTRIM (Bitfield-Mask: 0x1f)              */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Pos (12UL)                    /*!< TVRGSSELVREF (Bit 12)                                 */
#define MCUCTRL_VREFGEN5_TVRGSSELVREF_Msk (0x1000UL)                /*!< TVRGSSELVREF (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Pos (7UL)                  /*!< TVRGSTEMPCOTRIM (Bit 7)                               */
#define MCUCTRL_VREFGEN5_TVRGSTEMPCOTRIM_Msk (0xf80UL)              /*!< TVRGSTEMPCOTRIM (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Pos (0UL)                    /*!< TVRGSVREFTRIM (Bit 0)                                 */
#define MCUCTRL_VREFGEN5_TVRGSVREFTRIM_Msk (0x7fUL)                 /*!< TVRGSVREFTRIM (Bitfield-Mask: 0x7f)                   */
/* ========================================================  VREFBUF  ======================================================== */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Pos (14UL)                 /*!< VREFBUFCCOMPTRIM (Bit 14)                             */
#define MCUCTRL_VREFBUF_VREFBUFCCOMPTRIM_Msk (0x1c000UL)            /*!< VREFBUFCCOMPTRIM (Bitfield-Mask: 0x07)                */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Pos (13UL)                 /*!< VREFBUFIBIASTRIM (Bit 13)                             */
#define MCUCTRL_VREFBUF_VREFBUFIBIASTRIM_Msk (0x2000UL)             /*!< VREFBUFIBIASTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Pos (7UL)                   /*!< VREFBUFMISCTRIM (Bit 7)                               */
#define MCUCTRL_VREFBUF_VREFBUFMISCTRIM_Msk (0x1f80UL)              /*!< VREFBUFMISCTRIM (Bitfield-Mask: 0x3f)                 */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Pos   (6UL)                     /*!< VREFBUFPDNB (Bit 6)                                   */
#define MCUCTRL_VREFBUF_VREFBUFPDNB_Msk   (0x40UL)                  /*!< VREFBUFPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VREFBUF_VREFBUFVOLTTRIM_Pos (0UL)                   /*!< VREFBUFVOLTTRIM (Bit 0)                               */
#define MCUCTRL_VREFBUF_VREFBUFVOLTTRIM_Msk (0x3fUL)                /*!< VREFBUFVOLTTRIM (Bitfield-Mask: 0x3f)                 */
/* ========================================================  VRCTRL  ========================================================= */
#define MCUCTRL_VRCTRL_SIMOBUCKACTIVE_Pos (19UL)                    /*!< SIMOBUCKACTIVE (Bit 19)                               */
#define MCUCTRL_VRCTRL_SIMOBUCKACTIVE_Msk (0x80000UL)               /*!< SIMOBUCKACTIVE (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_VRCTRL_SIMOBUCKRSTB_Pos   (18UL)                    /*!< SIMOBUCKRSTB (Bit 18)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKRSTB_Msk   (0x40000UL)               /*!< SIMOBUCKRSTB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_SIMOBUCKPDNB_Pos   (17UL)                    /*!< SIMOBUCKPDNB (Bit 17)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKPDNB_Msk   (0x20000UL)               /*!< SIMOBUCKPDNB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_SIMOBUCKOVER_Pos   (16UL)                    /*!< SIMOBUCKOVER (Bit 16)                                 */
#define MCUCTRL_VRCTRL_SIMOBUCKOVER_Msk   (0x10000UL)               /*!< SIMOBUCKOVER (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_ANALDOACTIVE_Pos   (15UL)                    /*!< ANALDOACTIVE (Bit 15)                                 */
#define MCUCTRL_VRCTRL_ANALDOACTIVE_Msk   (0x8000UL)                /*!< ANALDOACTIVE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_ANALDOPDNB_Pos     (14UL)                    /*!< ANALDOPDNB (Bit 14)                                   */
#define MCUCTRL_VRCTRL_ANALDOPDNB_Msk     (0x4000UL)                /*!< ANALDOPDNB (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_ANALDOOVER_Pos     (13UL)                    /*!< ANALDOOVER (Bit 13)                                   */
#define MCUCTRL_VRCTRL_ANALDOOVER_Msk     (0x2000UL)                /*!< ANALDOOVER (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_MEMLDOTVRGFCVRGSEL_Pos (10UL)                /*!< MEMLDOTVRGFCVRGSEL (Bit 10)                           */
#define MCUCTRL_VRCTRL_MEMLDOTVRGFCVRGSEL_Msk (0xc00UL)             /*!< MEMLDOTVRGFCVRGSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_VRCTRL_MEMLDOCOLDSTARTEN_Pos (9UL)                  /*!< MEMLDOCOLDSTARTEN (Bit 9)                             */
#define MCUCTRL_VRCTRL_MEMLDOCOLDSTARTEN_Msk (0x200UL)              /*!< MEMLDOCOLDSTARTEN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_VRCTRL_MEMLDOACTIVE_Pos   (8UL)                     /*!< MEMLDOACTIVE (Bit 8)                                  */
#define MCUCTRL_VRCTRL_MEMLDOACTIVE_Msk   (0x100UL)                 /*!< MEMLDOACTIVE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_VRCTRL_MEMLDOACTIVEEARLY_Pos (7UL)                  /*!< MEMLDOACTIVEEARLY (Bit 7)                             */
#define MCUCTRL_VRCTRL_MEMLDOACTIVEEARLY_Msk (0x80UL)               /*!< MEMLDOACTIVEEARLY (Bitfield-Mask: 0x01)               */
#define MCUCTRL_VRCTRL_MEMLDOPDNB_Pos     (6UL)                     /*!< MEMLDOPDNB (Bit 6)                                    */
#define MCUCTRL_VRCTRL_MEMLDOPDNB_Msk     (0x40UL)                  /*!< MEMLDOPDNB (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_MEMLDOOVER_Pos     (5UL)                     /*!< MEMLDOOVER (Bit 5)                                    */
#define MCUCTRL_VRCTRL_MEMLDOOVER_Msk     (0x20UL)                  /*!< MEMLDOOVER (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_VRCTRL_CORELDOCOLDSTARTEN_Pos (4UL)                 /*!< CORELDOCOLDSTARTEN (Bit 4)                            */
#define MCUCTRL_VRCTRL_CORELDOCOLDSTARTEN_Msk (0x10UL)              /*!< CORELDOCOLDSTARTEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_VRCTRL_CORELDOACTIVE_Pos  (3UL)                     /*!< CORELDOACTIVE (Bit 3)                                 */
#define MCUCTRL_VRCTRL_CORELDOACTIVE_Msk  (0x8UL)                   /*!< CORELDOACTIVE (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_VRCTRL_CORELDOACTIVEEARLY_Pos (2UL)                 /*!< CORELDOACTIVEEARLY (Bit 2)                            */
#define MCUCTRL_VRCTRL_CORELDOACTIVEEARLY_Msk (0x4UL)               /*!< CORELDOACTIVEEARLY (Bitfield-Mask: 0x01)              */
#define MCUCTRL_VRCTRL_CORELDOPDNB_Pos    (1UL)                     /*!< CORELDOPDNB (Bit 1)                                   */
#define MCUCTRL_VRCTRL_CORELDOPDNB_Msk    (0x2UL)                   /*!< CORELDOPDNB (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_VRCTRL_CORELDOOVER_Pos    (0UL)                     /*!< CORELDOOVER (Bit 0)                                   */
#define MCUCTRL_VRCTRL_CORELDOOVER_Msk    (0x1UL)                   /*!< CORELDOOVER (Bitfield-Mask: 0x01)                     */
/* ========================================================  LDOREG1  ======================================================== */
#define MCUCTRL_LDOREG1_CORELDOIBIASSEL_Pos (21UL)                  /*!< CORELDOIBIASSEL (Bit 21)                              */
#define MCUCTRL_LDOREG1_CORELDOIBIASSEL_Msk (0x200000UL)            /*!< CORELDOIBIASSEL (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_LDOREG1_CORELDOIBIASTRIM_Pos (20UL)                 /*!< CORELDOIBIASTRIM (Bit 20)                             */
#define MCUCTRL_LDOREG1_CORELDOIBIASTRIM_Msk (0x100000UL)           /*!< CORELDOIBIASTRIM (Bitfield-Mask: 0x01)                */
#define MCUCTRL_LDOREG1_CORELDOLPTRIM_Pos (14UL)                    /*!< CORELDOLPTRIM (Bit 14)                                */
#define MCUCTRL_LDOREG1_CORELDOLPTRIM_Msk (0xfc000UL)               /*!< CORELDOLPTRIM (Bitfield-Mask: 0x3f)                   */
#define MCUCTRL_LDOREG1_CORELDOTEMPCOTRIM_Pos (10UL)                /*!< CORELDOTEMPCOTRIM (Bit 10)                            */
#define MCUCTRL_LDOREG1_CORELDOTEMPCOTRIM_Msk (0x3c00UL)            /*!< CORELDOTEMPCOTRIM (Bitfield-Mask: 0x0f)               */
#define MCUCTRL_LDOREG1_CORELDOACTIVETRIM_Pos (0UL)                 /*!< CORELDOACTIVETRIM (Bit 0)                             */
#define MCUCTRL_LDOREG1_CORELDOACTIVETRIM_Msk (0x3ffUL)             /*!< CORELDOACTIVETRIM (Bitfield-Mask: 0x3ff)              */
/* ========================================================  LDOREG2  ======================================================== */
#define MCUCTRL_LDOREG2_TRIMANALDO_Pos    (26UL)                    /*!< TRIMANALDO (Bit 26)                                   */
#define MCUCTRL_LDOREG2_TRIMANALDO_Msk    (0x3c000000UL)            /*!< TRIMANALDO (Bitfield-Mask: 0x0f)                      */
#define MCUCTRL_LDOREG2_MEMLDOIBIASSEL_Pos (25UL)                   /*!< MEMLDOIBIASSEL (Bit 25)                               */
#define MCUCTRL_LDOREG2_MEMLDOIBIASSEL_Msk (0x2000000UL)            /*!< MEMLDOIBIASSEL (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_LDOREG2_MEMLDOLPALTTRIM_Pos (12UL)                  /*!< MEMLDOLPALTTRIM (Bit 12)                              */
#define MCUCTRL_LDOREG2_MEMLDOLPALTTRIM_Msk (0x3f000UL)             /*!< MEMLDOLPALTTRIM (Bitfield-Mask: 0x3f)                 */
#define MCUCTRL_LDOREG2_MEMLDOLPTRIM_Pos  (6UL)                     /*!< MEMLDOLPTRIM (Bit 6)                                  */
#define MCUCTRL_LDOREG2_MEMLDOLPTRIM_Msk  (0xfc0UL)                 /*!< MEMLDOLPTRIM (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_LDOREG2_MEMLDOACTIVETRIM_Pos (0UL)                  /*!< MEMLDOACTIVETRIM (Bit 0)                              */
#define MCUCTRL_LDOREG2_MEMLDOACTIVETRIM_Msk (0x3fUL)               /*!< MEMLDOACTIVETRIM (Bitfield-Mask: 0x3f)                */
/* =========================================================  HFRC  ========================================================== */
#define MCUCTRL_HFRC_HFRCSIMOBUCKTONCLKDIVSEL_Pos (23UL)            /*!< HFRCSIMOBUCKTONCLKDIVSEL (Bit 23)                     */
#define MCUCTRL_HFRC_HFRCSIMOBUCKTONCLKDIVSEL_Msk (0x3800000UL)     /*!< HFRCSIMOBUCKTONCLKDIVSEL (Bitfield-Mask: 0x07)        */
#define MCUCTRL_HFRC_HFRCSIMOBUCKCLKEN_Pos (22UL)                   /*!< HFRCSIMOBUCKCLKEN (Bit 22)                            */
#define MCUCTRL_HFRC_HFRCSIMOBUCKCLKEN_Msk (0x400000UL)             /*!< HFRCSIMOBUCKCLKEN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_HFRC_HFTUNE_Pos           (11UL)                    /*!< HFTUNE (Bit 11)                                       */
#define MCUCTRL_HFRC_HFTUNE_Msk           (0x3ff800UL)              /*!< HFTUNE (Bitfield-Mask: 0x7ff)                         */
#define MCUCTRL_HFRC_HFRCDEL_Pos          (6UL)                     /*!< HFRCDEL (Bit 6)                                       */
#define MCUCTRL_HFRC_HFRCDEL_Msk          (0x7c0UL)                 /*!< HFRCDEL (Bitfield-Mask: 0x1f)                         */
#define MCUCTRL_HFRC_HFRCPWD_Pos          (5UL)                     /*!< HFRCPWD (Bit 5)                                       */
#define MCUCTRL_HFRC_HFRCPWD_Msk          (0x20UL)                  /*!< HFRCPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_HFRC_HFRCBURSTCLKDIS_Pos  (4UL)                     /*!< HFRCBURSTCLKDIS (Bit 4)                               */
#define MCUCTRL_HFRC_HFRCBURSTCLKDIS_Msk  (0x10UL)                  /*!< HFRCBURSTCLKDIS (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_HFRC_HFRCDIS_Pos          (3UL)                     /*!< HFRCDIS (Bit 3)                                       */
#define MCUCTRL_HFRC_HFRCDIS_Msk          (0x8UL)                   /*!< HFRCDIS (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_HFRC_HFRCTEMPCOTRIM_Pos   (1UL)                     /*!< HFRCTEMPCOTRIM (Bit 1)                                */
#define MCUCTRL_HFRC_HFRCTEMPCOTRIM_Msk   (0x6UL)                   /*!< HFRCTEMPCOTRIM (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_HFRC_HFRCSWE_Pos          (0UL)                     /*!< HFRCSWE (Bit 0)                                       */
#define MCUCTRL_HFRC_HFRCSWE_Msk          (0x1UL)                   /*!< HFRCSWE (Bitfield-Mask: 0x01)                         */
/* =========================================================  LFRC  ========================================================== */
#define MCUCTRL_LFRC_LFRCPWTRIMEN_Pos     (17UL)                    /*!< LFRCPWTRIMEN (Bit 17)                                 */
#define MCUCTRL_LFRC_LFRCPWTRIMEN_Msk     (0x20000UL)               /*!< LFRCPWTRIMEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_LFRC_LFRCPWTRIM_Pos       (13UL)                    /*!< LFRCPWTRIM (Bit 13)                                   */
#define MCUCTRL_LFRC_LFRCPWTRIM_Msk       (0x1e000UL)               /*!< LFRCPWTRIM (Bitfield-Mask: 0x0f)                      */
#define MCUCTRL_LFRC_LFRCSIMOCLKDIV_Pos   (10UL)                    /*!< LFRCSIMOCLKDIV (Bit 10)                               */
#define MCUCTRL_LFRC_LFRCSIMOCLKDIV_Msk   (0x1c00UL)                /*!< LFRCSIMOCLKDIV (Bitfield-Mask: 0x07)                  */
#define MCUCTRL_LFRC_LFRCITAILTRIM_Pos    (8UL)                     /*!< LFRCITAILTRIM (Bit 8)                                 */
#define MCUCTRL_LFRC_LFRCITAILTRIM_Msk    (0x300UL)                 /*!< LFRCITAILTRIM (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_LFRC_RESETLFRC_Pos        (7UL)                     /*!< RESETLFRC (Bit 7)                                     */
#define MCUCTRL_LFRC_RESETLFRC_Msk        (0x80UL)                  /*!< RESETLFRC (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_LFRC_PWDLFRC_Pos          (6UL)                     /*!< PWDLFRC (Bit 6)                                       */
#define MCUCTRL_LFRC_PWDLFRC_Msk          (0x40UL)                  /*!< PWDLFRC (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_LFRC_TRIMTUNELFRC_Pos     (1UL)                     /*!< TRIMTUNELFRC (Bit 1)                                  */
#define MCUCTRL_LFRC_TRIMTUNELFRC_Msk     (0x3eUL)                  /*!< TRIMTUNELFRC (Bitfield-Mask: 0x1f)                    */
#define MCUCTRL_LFRC_LFRCSWE_Pos          (0UL)                     /*!< LFRCSWE (Bit 0)                                       */
#define MCUCTRL_LFRC_LFRCSWE_Msk          (0x1UL)                   /*!< LFRCSWE (Bitfield-Mask: 0x01)                         */
/* ========================================================  BODCTRL  ======================================================== */
#define MCUCTRL_BODCTRL_BODRFTRIM_Pos     (13UL)                    /*!< BODRFTRIM (Bit 13)                                    */
#define MCUCTRL_BODCTRL_BODRFTRIM_Msk     (0x3e000UL)               /*!< BODRFTRIM (Bitfield-Mask: 0x1f)                       */
#define MCUCTRL_BODCTRL_BODRFPWD_Pos      (12UL)                    /*!< BODRFPWD (Bit 12)                                     */
#define MCUCTRL_BODCTRL_BODRFPWD_Msk      (0x1000UL)                /*!< BODRFPWD (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_BODCTRL_BODHLVLTRIM_Pos   (10UL)                    /*!< BODHLVLTRIM (Bit 10)                                  */
#define MCUCTRL_BODCTRL_BODHLVLTRIM_Msk   (0xc00UL)                 /*!< BODHLVLTRIM (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_BODCTRL_BODLLVLTTRIM_Pos  (8UL)                     /*!< BODLLVLTTRIM (Bit 8)                                  */
#define MCUCTRL_BODCTRL_BODLLVLTTRIM_Msk  (0x300UL)                 /*!< BODLLVLTTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_BODCTRL_BODHVREFSEL_Pos   (7UL)                     /*!< BODHVREFSEL (Bit 7)                                   */
#define MCUCTRL_BODCTRL_BODHVREFSEL_Msk   (0x80UL)                  /*!< BODHVREFSEL (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_BODCTRL_BODLVREFSEL_Pos   (6UL)                     /*!< BODLVREFSEL (Bit 6)                                   */
#define MCUCTRL_BODCTRL_BODLVREFSEL_Msk   (0x40UL)                  /*!< BODLVREFSEL (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_BODCTRL_BODCLVPWD_Pos     (5UL)                     /*!< BODCLVPWD (Bit 5)                                     */
#define MCUCTRL_BODCTRL_BODCLVPWD_Msk     (0x20UL)                  /*!< BODCLVPWD (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_BODCTRL_BODSPWD_Pos       (4UL)                     /*!< BODSPWD (Bit 4)                                       */
#define MCUCTRL_BODCTRL_BODSPWD_Msk       (0x10UL)                  /*!< BODSPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODCTRL_BODFPWD_Pos       (3UL)                     /*!< BODFPWD (Bit 3)                                       */
#define MCUCTRL_BODCTRL_BODFPWD_Msk       (0x8UL)                   /*!< BODFPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODCTRL_BODCPWD_Pos       (2UL)                     /*!< BODCPWD (Bit 2)                                       */
#define MCUCTRL_BODCTRL_BODCPWD_Msk       (0x4UL)                   /*!< BODCPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODCTRL_BODHPWD_Pos       (1UL)                     /*!< BODHPWD (Bit 1)                                       */
#define MCUCTRL_BODCTRL_BODHPWD_Msk       (0x2UL)                   /*!< BODHPWD (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODCTRL_BODLPWD_Pos       (0UL)                     /*!< BODLPWD (Bit 0)                                       */
#define MCUCTRL_BODCTRL_BODLPWD_Msk       (0x1UL)                   /*!< BODLPWD (Bitfield-Mask: 0x01)                         */
/* ======================================================  ADCPWRCTRL  ======================================================= */
#define MCUCTRL_ADCPWRCTRL_ADCKEEPOUTEN_Pos (16UL)                  /*!< ADCKEEPOUTEN (Bit 16)                                 */
#define MCUCTRL_ADCPWRCTRL_ADCKEEPOUTEN_Msk (0x10000UL)             /*!< ADCKEEPOUTEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_ADCPWRCTRL_ADCRFBUFSLWEN_Pos (15UL)                 /*!< ADCRFBUFSLWEN (Bit 15)                                */
#define MCUCTRL_ADCPWRCTRL_ADCRFBUFSLWEN_Msk (0x8000UL)             /*!< ADCRFBUFSLWEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_ADCPWRCTRL_ADCINBUFEN_Pos (14UL)                    /*!< ADCINBUFEN (Bit 14)                                   */
#define MCUCTRL_ADCPWRCTRL_ADCINBUFEN_Msk (0x4000UL)                /*!< ADCINBUFEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_ADCPWRCTRL_ADCINBUFSEL_Pos (12UL)                   /*!< ADCINBUFSEL (Bit 12)                                  */
#define MCUCTRL_ADCPWRCTRL_ADCINBUFSEL_Msk (0x3000UL)               /*!< ADCINBUFSEL (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_ADCPWRCTRL_ADCVBATDIVEN_Pos (11UL)                  /*!< ADCVBATDIVEN (Bit 11)                                 */
#define MCUCTRL_ADCPWRCTRL_ADCVBATDIVEN_Msk (0x800UL)               /*!< ADCVBATDIVEN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_ADCPWRCTRL_VDDADCRESETN_Pos (9UL)                   /*!< VDDADCRESETN (Bit 9)                                  */
#define MCUCTRL_ADCPWRCTRL_VDDADCRESETN_Msk (0x200UL)               /*!< VDDADCRESETN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_ADCPWRCTRL_VDDADCDIGISOLATE_Pos (8UL)               /*!< VDDADCDIGISOLATE (Bit 8)                              */
#define MCUCTRL_ADCPWRCTRL_VDDADCDIGISOLATE_Msk (0x100UL)           /*!< VDDADCDIGISOLATE (Bitfield-Mask: 0x01)                */
#define MCUCTRL_ADCPWRCTRL_VDDADCSARISOLATE_Pos (7UL)               /*!< VDDADCSARISOLATE (Bit 7)                              */
#define MCUCTRL_ADCPWRCTRL_VDDADCSARISOLATE_Msk (0x80UL)            /*!< VDDADCSARISOLATE (Bitfield-Mask: 0x01)                */
#define MCUCTRL_ADCPWRCTRL_REFKEEPPEN_Pos (6UL)                     /*!< REFKEEPPEN (Bit 6)                                    */
#define MCUCTRL_ADCPWRCTRL_REFKEEPPEN_Msk (0x40UL)                  /*!< REFKEEPPEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_ADCPWRCTRL_REFBUFPEN_Pos  (5UL)                     /*!< REFBUFPEN (Bit 5)                                     */
#define MCUCTRL_ADCPWRCTRL_REFBUFPEN_Msk  (0x20UL)                  /*!< REFBUFPEN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_ADCPWRCTRL_BGTPEN_Pos     (3UL)                     /*!< BGTPEN (Bit 3)                                        */
#define MCUCTRL_ADCPWRCTRL_BGTPEN_Msk     (0x8UL)                   /*!< BGTPEN (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_ADCPWRCTRL_ADCBPSEN_Pos   (2UL)                     /*!< ADCBPSEN (Bit 2)                                      */
#define MCUCTRL_ADCPWRCTRL_ADCBPSEN_Msk   (0x4UL)                   /*!< ADCBPSEN (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_ADCPWRCTRL_ADCAPSEN_Pos   (1UL)                     /*!< ADCAPSEN (Bit 1)                                      */
#define MCUCTRL_ADCPWRCTRL_ADCAPSEN_Msk   (0x2UL)                   /*!< ADCAPSEN (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_ADCPWRCTRL_ADCPWRCTRLSWE_Pos (0UL)                  /*!< ADCPWRCTRLSWE (Bit 0)                                 */
#define MCUCTRL_ADCPWRCTRL_ADCPWRCTRLSWE_Msk (0x1UL)                /*!< ADCPWRCTRLSWE (Bitfield-Mask: 0x01)                   */
/* ========================================================  ADCCAL  ========================================================= */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Pos  (1UL)                     /*!< ADCCALIBRATED (Bit 1)                                 */
#define MCUCTRL_ADCCAL_ADCCALIBRATED_Msk  (0x2UL)                   /*!< ADCCALIBRATED (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_ADCCAL_CALONPWRUP_Pos     (0UL)                     /*!< CALONPWRUP (Bit 0)                                    */
#define MCUCTRL_ADCCAL_CALONPWRUP_Msk     (0x1UL)                   /*!< CALONPWRUP (Bitfield-Mask: 0x01)                      */
