AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ======================================================  ADCBATTLOAD  ====================================================== */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Pos  (0UL)                     /*!< BATTLOAD (Bit 0)                                      */
#define MCUCTRL_ADCBATTLOAD_BATTLOAD_Msk  (0x1UL)                   /*!< BATTLOAD (Bitfield-Mask: 0x01)                        */
/* =======================================================  XTALCTRL  ======================================================== */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Pos (7UL)                    /*!< XTALICOMPTRIM (Bit 7)                                 */
#define MCUCTRL_XTALCTRL_XTALICOMPTRIM_Msk (0x180UL)                /*!< XTALICOMPTRIM (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Pos (5UL)                     /*!< XTALIBUFTRIM (Bit 5)                                  */
#define MCUCTRL_XTALCTRL_XTALIBUFTRIM_Msk (0x60UL)                  /*!< XTALIBUFTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_XTALCTRL_XTALCOMPPDNB_Pos (4UL)                     /*!< XTALCOMPPDNB (Bit 4)                                  */
#define MCUCTRL_XTALCTRL_XTALCOMPPDNB_Msk (0x10UL)                  /*!< XTALCOMPPDNB (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_XTALCTRL_XTALPDNB_Pos     (3UL)                     /*!< XTALPDNB (Bit 3)                                      */
#define MCUCTRL_XTALCTRL_XTALPDNB_Msk     (0x8UL)                   /*!< XTALPDNB (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_XTALCTRL_XTALCOMPBYPASS_Pos (2UL)                   /*!< XTALCOMPBYPASS (Bit 2)                                */
#define MCUCTRL_XTALCTRL_XTALCOMPBYPASS_Msk (0x4UL)                 /*!< XTALCOMPBYPASS (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_XTALCTRL_XTALCOREDISFB_Pos (1UL)                    /*!< XTALCOREDISFB (Bit 1)                                 */
#define MCUCTRL_XTALCTRL_XTALCOREDISFB_Msk (0x2UL)                  /*!< XTALCOREDISFB (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_XTALCTRL_XTALSWE_Pos      (0UL)                     /*!< XTALSWE (Bit 0)                                       */
#define MCUCTRL_XTALCTRL_XTALSWE_Msk      (0x1UL)                   /*!< XTALSWE (Bitfield-Mask: 0x01)                         */
/* ======================================================  XTALGENCTRL  ====================================================== */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Pos (8UL)                /*!< XTALKSBIASTRIM (Bit 8)                                */
#define MCUCTRL_XTALGENCTRL_XTALKSBIASTRIM_Msk (0x3f00UL)           /*!< XTALKSBIASTRIM (Bitfield-Mask: 0x3f)                  */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Pos (2UL)                  /*!< XTALBIASTRIM (Bit 2)                                  */
#define MCUCTRL_XTALGENCTRL_XTALBIASTRIM_Msk (0xfcUL)               /*!< XTALBIASTRIM (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Pos  (0UL)                     /*!< ACWARMUP (Bit 0)                                      */
#define MCUCTRL_XTALGENCTRL_ACWARMUP_Msk  (0x3UL)                   /*!< ACWARMUP (Bitfield-Mask: 0x03)                        */
/* ======================================================  XTALHSCTRL  ======================================================= */
#define MCUCTRL_XTALHSCTRL_XTALHSEXTERNALCLOCK_Pos (8UL)            /*!< XTALHSEXTERNALCLOCK (Bit 8)                           */
#define MCUCTRL_XTALHSCTRL_XTALHSEXTERNALCLOCK_Msk (0x100UL)        /*!< XTALHSEXTERNALCLOCK (Bitfield-Mask: 0x01)             */
#define MCUCTRL_XTALHSCTRL_XTALHSPADOUTEN_Pos (7UL)                 /*!< XTALHSPADOUTEN (Bit 7)                                */
#define MCUCTRL_XTALHSCTRL_XTALHSPADOUTEN_Msk (0x80UL)              /*!< XTALHSPADOUTEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_XTALHSCTRL_XTALHSSELRCOM_Pos (6UL)                  /*!< XTALHSSELRCOM (Bit 6)                                 */
#define MCUCTRL_XTALHSCTRL_XTALHSSELRCOM_Msk (0x40UL)               /*!< XTALHSSELRCOM (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_XTALHSCTRL_XTALHSPDNPNIMPROVE_Pos (5UL)             /*!< XTALHSPDNPNIMPROVE (Bit 5)                            */
#define MCUCTRL_XTALHSCTRL_XTALHSPDNPNIMPROVE_Msk (0x20UL)          /*!< XTALHSPDNPNIMPROVE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_XTALHSCTRL_XTALHSINJECTIONENABLE_Pos (4UL)          /*!< XTALHSINJECTIONENABLE (Bit 4)                         */
#define MCUCTRL_XTALHSCTRL_XTALHSINJECTIONENABLE_Msk (0x10UL)       /*!< XTALHSINJECTIONENABLE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_XTALHSCTRL_XTALHSIBSTENABLE_Pos (3UL)               /*!< XTALHSIBSTENABLE (Bit 3)                              */
#define MCUCTRL_XTALHSCTRL_XTALHSIBSTENABLE_Msk (0x8UL)             /*!< XTALHSIBSTENABLE (Bitfield-Mask: 0x01)                */
#define MCUCTRL_XTALHSCTRL_XTALHSCOMPSEL_Pos (2UL)                  /*!< XTALHSCOMPSEL (Bit 2)                                 */
#define MCUCTRL_XTALHSCTRL_XTALHSCOMPSEL_Msk (0x4UL)                /*!< XTALHSCOMPSEL (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_XTALHSCTRL_XTALHSCOMPPDNB_Pos (1UL)                 /*!< XTALHSCOMPPDNB (Bit 1)                                */
#define MCUCTRL_XTALHSCTRL_XTALHSCOMPPDNB_Msk (0x2UL)               /*!< XTALHSCOMPPDNB (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_XTALHSCTRL_XTALHSPDNB_Pos (0UL)                     /*!< XTALHSPDNB (Bit 0)                                    */
#define MCUCTRL_XTALHSCTRL_XTALHSPDNB_Msk (0x1UL)                   /*!< XTALHSPDNB (Bitfield-Mask: 0x01)                      */
/* ===================================================  MRAMCRYPTOPWRCTRL  =================================================== */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_Pos (9UL)          /*!< CRYPTOCLKGATEN (Bit 9)                                */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOCLKGATEN_Msk (0x200UL)      /*!< CRYPTOCLKGATEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_Pos (8UL)       /*!< CRYPTOPWRDOWREADY (Bit 8)                             */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_CRYPTOPWRDOWREADY_Msk (0x100UL)   /*!< CRYPTOPWRDOWREADY (Bitfield-Mask: 0x01)               */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0FULLPDST_Pos (4UL)           /*!< MRAM0FULLPDST (Bit 4)                                 */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0FULLPDST_Msk (0x10UL)        /*!< MRAM0FULLPDST (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0DEEPPDST_Pos (3UL)           /*!< MRAM0DEEPPDST (Bit 3)                                 */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0DEEPPDST_Msk (0x8UL)         /*!< MRAM0DEEPPDST (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0PWRCTRL_Pos (2UL)            /*!< MRAM0PWRCTRL (Bit 2)                                  */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0PWRCTRL_Msk (0x4UL)          /*!< MRAM0PWRCTRL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0SLPEN_Pos (1UL)              /*!< MRAM0SLPEN (Bit 1)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0SLPEN_Msk (0x2UL)            /*!< MRAM0SLPEN (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0LPREN_Pos (0UL)              /*!< MRAM0LPREN (Bit 0)                                    */
#define MCUCTRL_MRAMCRYPTOPWRCTRL_MRAM0LPREN_Msk (0x1UL)            /*!< MRAM0LPREN (Bitfield-Mask: 0x01)                      */
/* =======================================================  BODISABLE  ======================================================= */
#define MCUCTRL_BODISABLE_BODCLVREN_Pos   (4UL)                     /*!< BODCLVREN (Bit 4)                                     */
#define MCUCTRL_BODISABLE_BODCLVREN_Msk   (0x10UL)                  /*!< BODCLVREN (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_BODISABLE_BODSREN_Pos     (3UL)                     /*!< BODSREN (Bit 3)                                       */
#define MCUCTRL_BODISABLE_BODSREN_Msk     (0x8UL)                   /*!< BODSREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODFREN_Pos     (2UL)                     /*!< BODFREN (Bit 2)                                       */
#define MCUCTRL_BODISABLE_BODFREN_Msk     (0x4UL)                   /*!< BODFREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODCREN_Pos     (1UL)                     /*!< BODCREN (Bit 1)                                       */
#define MCUCTRL_BODISABLE_BODCREN_Msk     (0x2UL)                   /*!< BODCREN (Bitfield-Mask: 0x01)                         */
#define MCUCTRL_BODISABLE_BODLRDE_Pos     (0UL)                     /*!< BODLRDE (Bit 0)                                       */
#define MCUCTRL_BODISABLE_BODLRDE_Msk     (0x1UL)                   /*!< BODLRDE (Bitfield-Mask: 0x01)                         */
/* =======================================================  D2ASPARE  ======================================================== */
#define MCUCTRL_D2ASPARE_D2ASPARE_Pos     (0UL)                     /*!< D2ASPARE (Bit 0)                                      */
#define MCUCTRL_D2ASPARE_D2ASPARE_Msk     (0xffffffffUL)            /*!< D2ASPARE (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  BOOTLOADER  ======================================================= */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Pos (30UL)                  /*!< SECBOOTONRST (Bit 30)                                 */
#define MCUCTRL_BOOTLOADER_SECBOOTONRST_Msk (0xc0000000UL)          /*!< SECBOOTONRST (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_BOOTLOADER_SECBOOT_Pos    (28UL)                    /*!< SECBOOT (Bit 28)                                      */
#define MCUCTRL_BOOTLOADER_SECBOOT_Msk    (0x30000000UL)            /*!< SECBOOT (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Pos (26UL)                /*!< SECBOOTFEATURE (Bit 26)                               */
#define MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Msk (0xc000000UL)         /*!< SECBOOTFEATURE (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_BOOTLOADER_SBLUNLOCK_Pos  (3UL)                     /*!< SBLUNLOCK (Bit 3)                                     */
#define MCUCTRL_BOOTLOADER_SBLUNLOCK_Msk  (0x8UL)                   /*!< SBLUNLOCK (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_BOOTLOADER_PROTUNLOCK_Pos (2UL)                     /*!< PROTUNLOCK (Bit 2)                                    */
#define MCUCTRL_BOOTLOADER_PROTUNLOCK_Msk (0x4UL)                   /*!< PROTUNLOCK (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_BOOTLOADER_SBRUNLOCK_Pos  (1UL)                     /*!< SBRUNLOCK (Bit 1)                                     */
#define MCUCTRL_BOOTLOADER_SBRUNLOCK_Msk  (0x2UL)                   /*!< SBRUNLOCK (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_BOOTLOADER_RSVD0_Pos      (0UL)                     /*!< RSVD0 (Bit 0)                                         */
#define MCUCTRL_BOOTLOADER_RSVD0_Msk      (0x1UL)                   /*!< RSVD0 (Bitfield-Mask: 0x01)                           */
/* ======================================================  SHADOWVALID  ====================================================== */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Pos (7UL)                  /*!< OTPBOOTFAULT (Bit 7)                                  */
#define MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Msk (0x1f80UL)             /*!< OTPBOOTFAULT (Bitfield-Mask: 0x3f)                    */
#define MCUCTRL_SHADOWVALID_OTPREADY_Pos  (6UL)                     /*!< OTPREADY (Bit 6)                                      */
#define MCUCTRL_SHADOWVALID_OTPREADY_Msk  (0x40UL)                  /*!< OTPREADY (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_SHADOWVALID_INFOCSELOTP_Pos (5UL)                   /*!< INFOCSELOTP (Bit 5)                                   */
#define MCUCTRL_SHADOWVALID_INFOCSELOTP_Msk (0x20UL)                /*!< INFOCSELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Pos (4UL)                   /*!< INFO0SELOTP (Bit 4)                                   */
#define MCUCTRL_SHADOWVALID_INFO0SELOTP_Msk (0x10UL)                /*!< INFO0SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Pos (3UL)                   /*!< INFO1SELOTP (Bit 3)                                   */
#define MCUCTRL_SHADOWVALID_INFO1SELOTP_Msk (0x8UL)                 /*!< INFO1SELOTP (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SHADOWVALID_INFO0VALID_Pos (2UL)                    /*!< INFO0VALID (Bit 2)                                    */
#define MCUCTRL_SHADOWVALID_INFO0VALID_Msk (0x4UL)                  /*!< INFO0VALID (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SHADOWVALID_SPINORSLEEPn_Pos (1UL)                  /*!< SPINORSLEEPn (Bit 1)                                  */
#define MCUCTRL_SHADOWVALID_SPINORSLEEPn_Msk (0x2UL)                /*!< SPINORSLEEPn (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_SHADOWVALID_VALID_Pos     (0UL)                     /*!< VALID (Bit 0)                                         */
#define MCUCTRL_SHADOWVALID_VALID_Msk     (0x1UL)                   /*!< VALID (Bitfield-Mask: 0x01)                           */
/* =======================================================  SCRATCH0  ======================================================== */
#define MCUCTRL_SCRATCH0_SCRATCH0_Pos     (0UL)                     /*!< SCRATCH0 (Bit 0)                                      */
#define MCUCTRL_SCRATCH0_SCRATCH0_Msk     (0xffffffffUL)            /*!< SCRATCH0 (Bitfield-Mask: 0xffffffff)                  */
/* =======================================================  SCRATCH1  ======================================================== */
#define MCUCTRL_SCRATCH1_SCRATCH1_Pos     (0UL)                     /*!< SCRATCH1 (Bit 0)                                      */
#define MCUCTRL_SCRATCH1_SCRATCH1_Msk     (0xffffffffUL)            /*!< SCRATCH1 (Bitfield-Mask: 0xffffffff)                  */
/* =========================================================  DBGR1  ========================================================= */
#define MCUCTRL_DBGR1_ONETO8_Pos          (0UL)                     /*!< ONETO8 (Bit 0)                                        */
#define MCUCTRL_DBGR1_ONETO8_Msk          (0xffffffffUL)            /*!< ONETO8 (Bitfield-Mask: 0xffffffff)                    */
/* =========================================================  DBGR2  ========================================================= */
#define MCUCTRL_DBGR2_COOLCODE_Pos        (0UL)                     /*!< COOLCODE (Bit 0)                                      */
#define MCUCTRL_DBGR2_COOLCODE_Msk        (0xffffffffUL)            /*!< COOLCODE (Bitfield-Mask: 0xffffffff)                  */
/* ======================================================  WICCONTROL  ======================================================= */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Pos  (0UL)                     /*!< DEEPISWIC (Bit 0)                                     */
#define MCUCTRL_WICCONTROL_DEEPISWIC_Msk  (0x1UL)                   /*!< DEEPISWIC (Bitfield-Mask: 0x01)                       */
/* ========================================================  DBGCTRL  ======================================================== */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Pos   (12UL)                    /*!< DBGTSCLKSEL (Bit 12)                                  */
#define MCUCTRL_DBGCTRL_DBGTSCLKSEL_Msk   (0x7000UL)                /*!< DBGTSCLKSEL (Bitfield-Mask: 0x07)                     */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Pos  (8UL)                     /*!< DBGETBENABLE (Bit 8)                                  */
#define MCUCTRL_DBGCTRL_DBGETBENABLE_Msk  (0x100UL)                 /*!< DBGETBENABLE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_DBGCTRL_PWRDBGQACTIVE_Pos (5UL)                     /*!< PWRDBGQACTIVE (Bit 5)                                 */
#define MCUCTRL_DBGCTRL_PWRDBGQACTIVE_Msk (0x20UL)                  /*!< PWRDBGQACTIVE (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_DBGCTRL_TPIUBUSY_Pos      (4UL)                     /*!< TPIUBUSY (Bit 4)                                      */
#define MCUCTRL_DBGCTRL_TPIUBUSY_Msk      (0x10UL)                  /*!< TPIUBUSY (Bitfield-Mask: 0x01)                        */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Pos (1UL)                     /*!< DBGTPIUCLKSEL (Bit 1)                                 */
#define MCUCTRL_DBGCTRL_DBGTPIUCLKSEL_Msk (0xeUL)                   /*!< DBGTPIUCLKSEL (Bitfield-Mask: 0x07)                   */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Pos (0UL)                /*!< DBGTPIUTRACEENABLE (Bit 0)                            */
#define MCUCTRL_DBGCTRL_DBGTPIUTRACEENABLE_Msk (0x1UL)              /*!< DBGTPIUTRACEENABLE (Bitfield-Mask: 0x01)              */
/* ======================================================  OTAPOINTER  ======================================================= */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Pos (3UL)                     /*!< OTAPOINTER (Bit 3)                                    */
#define MCUCTRL_OTAPOINTER_OTAPOINTER_Msk (0xfffffff8UL)            /*!< OTAPOINTER (Bitfield-Mask: 0x1fffffff)                */
#define MCUCTRL_OTAPOINTER_OTASBR_Pos     (2UL)                     /*!< OTASBR (Bit 2)                                        */
#define MCUCTRL_OTAPOINTER_OTASBR_Msk     (0x4UL)                   /*!< OTASBR (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_OTAPOINTER_OTASBRUPDATE_Pos (1UL)                   /*!< OTASBRUPDATE (Bit 1)                                  */
#define MCUCTRL_OTAPOINTER_OTASBRUPDATE_Msk (0x2UL)                 /*!< OTASBRUPDATE (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_OTAPOINTER_OTAVALID_Pos   (0UL)                     /*!< OTAVALID (Bit 0)                                      */
#define MCUCTRL_OTAPOINTER_OTAVALID_Msk   (0x1UL)                   /*!< OTAVALID (Bitfield-Mask: 0x01)                        */
/* ======================================================  APBDMACTRL  ======================================================= */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Pos (8UL)                     /*!< HYSTERESIS (Bit 8)                                    */
#define MCUCTRL_APBDMACTRL_HYSTERESIS_Msk (0xff00UL)                /*!< HYSTERESIS (Bitfield-Mask: 0xff)                      */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Pos (1UL)                    /*!< DECODEABORT (Bit 1)                                   */
#define MCUCTRL_APBDMACTRL_DECODEABORT_Msk (0x2UL)                  /*!< DECODEABORT (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Pos  (0UL)                     /*!< DMAENABLE (Bit 0)                                     */
#define MCUCTRL_APBDMACTRL_DMAENABLE_Msk  (0x1UL)                   /*!< DMAENABLE (Bitfield-Mask: 0x01)                       */
/* =====================================================  FORCEAXICLKEN  ===================================================== */
#define MCUCTRL_FORCEAXICLKEN_FRCAPBDMACGCLKEN_Pos (3UL)            /*!< FRCAPBDMACGCLKEN (Bit 3)                              */
#define MCUCTRL_FORCEAXICLKEN_FRCAPBDMACGCLKEN_Msk (0x8UL)          /*!< FRCAPBDMACGCLKEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_FORCEAXICLKEN_FRCCM55SAHBCGCLKEN_Pos (2UL)          /*!< FRCCM55SAHBCGCLKEN (Bit 2)                            */
#define MCUCTRL_FORCEAXICLKEN_FRCCM55SAHBCGCLKEN_Msk (0x4UL)        /*!< FRCCM55SAHBCGCLKEN (Bitfield-Mask: 0x01)              */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICGCLKEN_Pos (1UL)               /*!< FRCAXICGCLKEN (Bit 1)                                 */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICGCLKEN_Msk (0x2UL)             /*!< FRCAXICGCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Pos (0UL)                 /*!< FRCAXICLKEN (Bit 0)                                   */
#define MCUCTRL_FORCEAXICLKEN_FRCAXICLKEN_Msk (0x1UL)               /*!< FRCAXICLKEN (Bitfield-Mask: 0x01)                     */
/* ======================================================  KEXTCLKSEL  ======================================================= */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Pos (0UL)                     /*!< KEXTCLKSEL (Bit 0)                                    */
#define MCUCTRL_KEXTCLKSEL_KEXTCLKSEL_Msk (0xffffffffUL)            /*!< KEXTCLKSEL (Bitfield-Mask: 0xffffffff)                */
/* =======================================================  SIMOBUCK0  ======================================================= */
#define MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN_Pos (23UL)               /*!< SIMOBUCKHPTRIMEN (Bit 23)                             */
#define MCUCTRL_SIMOBUCK0_SIMOBUCKHPTRIMEN_Msk (0x800000UL)         /*!< SIMOBUCKHPTRIMEN (Bitfield-Mask: 0x01)                */
#define MCUCTRL_SIMOBUCK0_TRIMCHANGEDLYPRE_Pos (21UL)               /*!< TRIMCHANGEDLYPRE (Bit 21)                             */
#define MCUCTRL_SIMOBUCK0_TRIMCHANGEDLYPRE_Msk (0x600000UL)         /*!< TRIMCHANGEDLYPRE (Bitfield-Mask: 0x03)                */
#define MCUCTRL_SIMOBUCK0_TRIMCHANGEDLYPOST_Pos (19UL)              /*!< TRIMCHANGEDLYPOST (Bit 19)                            */
#define MCUCTRL_SIMOBUCK0_TRIMCHANGEDLYPOST_Msk (0x180000UL)        /*!< TRIMCHANGEDLYPOST (Bitfield-Mask: 0x03)               */
#define MCUCTRL_SIMOBUCK0_TNPDELAYTRIM_Pos (17UL)                   /*!< TNPDELAYTRIM (Bit 17)                                 */
#define MCUCTRL_SIMOBUCK0_TNPDELAYTRIM_Msk (0x60000UL)              /*!< TNPDELAYTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_SIMOBUCK0_TPNDELAYTRIM_Pos (15UL)                   /*!< TPNDELAYTRIM (Bit 15)                                 */
#define MCUCTRL_SIMOBUCK0_TPNDELAYTRIM_Msk (0x18000UL)              /*!< TPNDELAYTRIM (Bitfield-Mask: 0x03)                    */
#define MCUCTRL_SIMOBUCK0_NMOSDRVSTRTRIM_Pos (11UL)                 /*!< NMOSDRVSTRTRIM (Bit 11)                               */
#define MCUCTRL_SIMOBUCK0_NMOSDRVSTRTRIM_Msk (0x7800UL)             /*!< NMOSDRVSTRTRIM (Bitfield-Mask: 0x0f)                  */
#define MCUCTRL_SIMOBUCK0_PMOSDRVSTRTRIM_Pos (7UL)                  /*!< PMOSDRVSTRTRIM (Bit 7)                                */
#define MCUCTRL_SIMOBUCK0_PMOSDRVSTRTRIM_Msk (0x780UL)              /*!< PMOSDRVSTRTRIM (Bitfield-Mask: 0x0f)                  */
#define MCUCTRL_SIMOBUCK0_DEEPSLEEPCCMEN_Pos (6UL)                  /*!< DEEPSLEEPCCMEN (Bit 6)                                */
#define MCUCTRL_SIMOBUCK0_DEEPSLEEPCCMEN_Msk (0x40UL)               /*!< DEEPSLEEPCCMEN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_SIMOBUCK0_CCMEN_Pos       (5UL)                     /*!< CCMEN (Bit 5)                                         */
#define MCUCTRL_SIMOBUCK0_CCMEN_Msk       (0x20UL)                  /*!< CCMEN (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_SIMOBUCK0_VDDRFRXCOMPEN_Pos (4UL)                   /*!< VDDRFRXCOMPEN (Bit 4)                                 */
#define MCUCTRL_SIMOBUCK0_VDDRFRXCOMPEN_Msk (0x10UL)                /*!< VDDRFRXCOMPEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Pos (3UL)                  /*!< VDDCLVRXCOMPEN (Bit 3)                                */
#define MCUCTRL_SIMOBUCK0_VDDCLVRXCOMPEN_Msk (0x8UL)                /*!< VDDCLVRXCOMPEN (Bitfield-Mask: 0x01)                  */
