AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Pos (29UL)                   /*!< PWRSWVDDRCPUPGN (Bit 29)                              */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUPGN_Msk (0x20000000UL)           /*!< PWRSWVDDRCPUPGN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSELOVERRIDE_Pos (28UL)        /*!< PWRSWVDDRCPUDYNSELOVERRIDE (Bit 28)                   */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSELOVERRIDE_Msk (0x10000000UL) /*!< PWRSWVDDRCPUDYNSELOVERRIDE (Bitfield-Mask: 0x01)     */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Pos (27UL)                /*!< PWRSWVDDRCPUDYNSEL (Bit 27)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDRCPUDYNSEL_Msk (0x8000000UL)         /*!< PWRSWVDDRCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Pos (26UL)                /*!< PWRSWVDDMLOVERRIDE (Bit 26)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMLOVERRIDE_Msk (0x4000000UL)         /*!< PWRSWVDDMLOVERRIDE (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Pos (25UL)                 /*!< PWRSWVDDMLSTATSEL (Bit 25)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDMLSTATSEL_Msk (0x2000000UL)          /*!< PWRSWVDDMLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Pos (24UL)                  /*!< PWRSWVDDMLDYNSEL (Bit 24)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDMLDYNSEL_Msk (0x1000000UL)           /*!< PWRSWVDDMLDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSELPOLSEL_Pos (18UL)         /*!< PWRSWVDDMCPUSTATSELPOLSEL (Bit 18)                    */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSELPOLSEL_Msk (0x40000UL)    /*!< PWRSWVDDMCPUSTATSELPOLSEL (Bitfield-Mask: 0x01)       */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Pos (17UL)              /*!< PWRSWVDDMCPUOVERRIDE (Bit 17)                         */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUOVERRIDE_Msk (0x20000UL)         /*!< PWRSWVDDMCPUOVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Pos (16UL)               /*!< PWRSWVDDMCPUSTATSEL (Bit 16)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUSTATSEL_Msk (0x10000UL)          /*!< PWRSWVDDMCPUSTATSEL (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Pos (15UL)                /*!< PWRSWVDDMCPUDYNSEL (Bit 15)                           */
#define MCUCTRL_PWRSW0_PWRSWVDDMCPUDYNSEL_Msk (0x8000UL)            /*!< PWRSWVDDMCPUDYNSEL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELBITSWAP_Pos (10UL)          /*!< PWRSWVDDCPUDYNSELBITSWAP (Bit 10)                     */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELBITSWAP_Msk (0x400UL)       /*!< PWRSWVDDCPUDYNSELBITSWAP (Bitfield-Mask: 0x01)        */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSELBITSWAP_Pos (9UL)          /*!< PWRSWVDDCAORDYNSELBITSWAP (Bit 9)                     */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSELBITSWAP_Msk (0x200UL)      /*!< PWRSWVDDCAORDYNSELBITSWAP (Bitfield-Mask: 0x01)       */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGNOVERRIDE_Pos (8UL)            /*!< PWRSWVDDCAORPGNOVERRIDE (Bit 8)                       */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORPGNOVERRIDE_Msk (0x100UL)        /*!< PWRSWVDDCAORPGNOVERRIDE (Bitfield-Mask: 0x01)         */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Pos (7UL)               /*!< PWRSWVDDCAOROVERRIDE (Bit 7)                          */
#define MCUCTRL_PWRSW0_PWRSWVDDCAOROVERRIDE_Msk (0x80UL)            /*!< PWRSWVDDCAOROVERRIDE (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Pos (5UL)                 /*!< PWRSWVDDCAORDYNSEL (Bit 5)                            */
#define MCUCTRL_PWRSW0_PWRSWVDDCAORDYNSEL_Msk (0x60UL)              /*!< PWRSWVDDCAORDYNSEL (Bitfield-Mask: 0x03)              */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGNOVERRIDE_Pos (4UL)             /*!< PWRSWVDDCPUPGNOVERRIDE (Bit 4)                        */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGNOVERRIDE_Msk (0x10UL)          /*!< PWRSWVDDCPUPGNOVERRIDE (Bitfield-Mask: 0x01)          */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Pos (3UL)                     /*!< PWRSWVDDCPUPGN (Bit 3)                                */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUPGN_Msk (0x8UL)                   /*!< PWRSWVDDCPUPGN (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELOVERRIDE_Pos (2UL)          /*!< PWRSWVDDCPUDYNSELOVERRIDE (Bit 2)                     */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSELOVERRIDE_Msk (0x4UL)        /*!< PWRSWVDDCPUDYNSELOVERRIDE (Bitfield-Mask: 0x01)       */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Pos (0UL)                  /*!< PWRSWVDDCPUDYNSEL (Bit 0)                             */
#define MCUCTRL_PWRSW0_PWRSWVDDCPUDYNSEL_Msk (0x3UL)                /*!< PWRSWVDDCPUDYNSEL (Bitfield-Mask: 0x03)               */
/* ========================================================  PWRSW1  ========================================================= */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Pos (31UL)                /*!< SHORTVDDFVDDSORVAL (Bit 31)                           */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSORVAL_Msk (0x80000000UL)        /*!< SHORTVDDFVDDSORVAL (Bitfield-Mask: 0x01)              */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Pos (30UL)                 /*!< SHORTVDDFVDDSOREN (Bit 30)                            */
#define MCUCTRL_PWRSW1_SHORTVDDFVDDSOREN_Msk (0x40000000UL)         /*!< SHORTVDDFVDDSOREN (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Pos (29UL)              /*!< SHORTVDDCVDDCLVORVAL (Bit 29)                         */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVORVAL_Msk (0x20000000UL)      /*!< SHORTVDDCVDDCLVORVAL (Bitfield-Mask: 0x01)            */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Pos (28UL)               /*!< SHORTVDDCVDDCLVOREN (Bit 28)                          */
#define MCUCTRL_PWRSW1_SHORTVDDCVDDCLVOREN_Msk (0x10000000UL)       /*!< SHORTVDDCVDDCLVOREN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Pos  (27UL)                    /*!< FORCEVDDRMOFF (Bit 27)                                */
#define MCUCTRL_PWRSW1_FORCEVDDRMOFF_Msk  (0x8000000UL)             /*!< FORCEVDDRMOFF (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDF_Pos (26UL)                    /*!< FORCEVDDRMVDDF (Bit 26)                               */
#define MCUCTRL_PWRSW1_FORCEVDDRMVDDF_Msk (0x4000000UL)             /*!< FORCEVDDRMVDDF (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Pos (20UL)                 /*!< PWRSWVDDLOVERRIDE (Bit 20)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDLOVERRIDE_Msk (0x100000UL)           /*!< PWRSWVDDLOVERRIDE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Pos   (19UL)                    /*!< PWRSWVDDLPGN (Bit 19)                                 */
#define MCUCTRL_PWRSW1_PWRSWVDDLPGN_Msk   (0x80000UL)               /*!< PWRSWVDDLPGN (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGNOVERRIDE_Pos (18UL)             /*!< PWRSWVDDRMPGNOVERRIDE (Bit 18)                        */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGNOVERRIDE_Msk (0x40000UL)        /*!< PWRSWVDDRMPGNOVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSELOVERRIDE_Pos (17UL)          /*!< PWRSWVDDRMDYNSELOVERRIDE (Bit 17)                     */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSELOVERRIDE_Msk (0x20000UL)     /*!< PWRSWVDDRMDYNSELOVERRIDE (Bitfield-Mask: 0x01)        */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Pos (16UL)                 /*!< PWRSWVDDRMSTATSEL (Bit 16)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRMSTATSEL_Msk (0x10000UL)            /*!< PWRSWVDDRMSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Pos  (15UL)                    /*!< PWRSWVDDRMPGN (Bit 15)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRMPGN_Msk  (0x8000UL)                /*!< PWRSWVDDRMPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Pos (14UL)                  /*!< PWRSWVDDRMDYNSEL (Bit 14)                             */
#define MCUCTRL_PWRSW1_PWRSWVDDRMDYNSEL_Msk (0x4000UL)              /*!< PWRSWVDDRMDYNSEL (Bitfield-Mask: 0x01)                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGNOVERRIDE_Pos (13UL)             /*!< PWRSWVDDRLPGNOVERRIDE (Bit 13)                        */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGNOVERRIDE_Msk (0x2000UL)         /*!< PWRSWVDDRLPGNOVERRIDE (Bitfield-Mask: 0x01)           */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSELOVERRIDE_Pos (12UL)          /*!< PWRSWVDDRLDYNSELOVERRIDE (Bit 12)                     */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSELOVERRIDE_Msk (0x1000UL)      /*!< PWRSWVDDRLDYNSELOVERRIDE (Bitfield-Mask: 0x01)        */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Pos (11UL)                 /*!< PWRSWVDDRLSTATSEL (Bit 11)                            */
#define MCUCTRL_PWRSW1_PWRSWVDDRLSTATSEL_Msk (0x800UL)              /*!< PWRSWVDDRLSTATSEL (Bitfield-Mask: 0x01)               */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Pos  (10UL)                    /*!< PWRSWVDDRLPGN (Bit 10)                                */
#define MCUCTRL_PWRSW1_PWRSWVDDRLPGN_Msk  (0x400UL)                 /*!< PWRSWVDDRLPGN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Pos (9UL)                   /*!< PWRSWVDDRLDYNSEL (Bit 9)                              */
#define MCUCTRL_PWRSW1_PWRSWVDDRLDYNSEL_Msk (0x200UL)               /*!< PWRSWVDDRLDYNSEL (Bitfield-Mask: 0x01)                */
/* ======================================================  USBRSTCTRL  ======================================================= */
#define MCUCTRL_USBRSTCTRL_USBUTMIRSTRELEASE_Pos (2UL)              /*!< USBUTMIRSTRELEASE (Bit 2)                             */
#define MCUCTRL_USBRSTCTRL_USBUTMIRSTRELEASE_Msk (0x4UL)            /*!< USBUTMIRSTRELEASE (Bitfield-Mask: 0x01)               */
#define MCUCTRL_USBRSTCTRL_USBPORRSTRELEASE_Pos (1UL)               /*!< USBPORRSTRELEASE (Bit 1)                              */
#define MCUCTRL_USBRSTCTRL_USBPORRSTRELEASE_Msk (0x2UL)             /*!< USBPORRSTRELEASE (Bitfield-Mask: 0x01)                */
#define MCUCTRL_USBRSTCTRL_USBRSTENABLE_Pos (0UL)                   /*!< USBRSTENABLE (Bit 0)                                  */
#define MCUCTRL_USBRSTCTRL_USBRSTENABLE_Msk (0x1UL)                 /*!< USBRSTENABLE (Bitfield-Mask: 0x01)                    */
/* ======================================================  FLASHWPROT0  ====================================================== */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Pos   (0UL)                     /*!< FW0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT0_FW0BITS_Msk   (0xffffffffUL)            /*!< FW0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT1  ====================================================== */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Pos   (0UL)                     /*!< FW1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT1_FW1BITS_Msk   (0xffffffffUL)            /*!< FW1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT2  ====================================================== */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Pos   (0UL)                     /*!< FW2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT2_FW2BITS_Msk   (0xffffffffUL)            /*!< FW2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHWPROT3  ====================================================== */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Pos   (0UL)                     /*!< FW3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHWPROT3_FW3BITS_Msk   (0xffffffffUL)            /*!< FW3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT0  ====================================================== */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Pos   (0UL)                     /*!< FR0BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT0_FR0BITS_Msk   (0xffffffffUL)            /*!< FR0BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT1  ====================================================== */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Pos   (0UL)                     /*!< FR1BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT1_FR1BITS_Msk   (0xffffffffUL)            /*!< FR1BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT2  ====================================================== */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Pos   (0UL)                     /*!< FR2BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT2_FR2BITS_Msk   (0xffffffffUL)            /*!< FR2BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  FLASHRPROT3  ====================================================== */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Pos   (0UL)                     /*!< FR3BITS (Bit 0)                                       */
#define MCUCTRL_FLASHRPROT3_FR3BITS_Msk   (0xffffffffUL)            /*!< FR3BITS (Bitfield-Mask: 0xffffffff)                   */
/* ======================================================  SRAMWPROT0  ======================================================= */
#define MCUCTRL_SRAMWPROT0_SRAMWPROT0_Pos (0UL)                     /*!< SRAMWPROT0 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT0_SRAMWPROT0_Msk (0xffffffffUL)            /*!< SRAMWPROT0 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT1  ======================================================= */
#define MCUCTRL_SRAMWPROT1_SRAMWPROT1_Pos (0UL)                     /*!< SRAMWPROT1 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT1_SRAMWPROT1_Msk (0xffffffffUL)            /*!< SRAMWPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT2  ======================================================= */
#define MCUCTRL_SRAMWPROT2_SRAMWPROT2_Pos (0UL)                     /*!< SRAMWPROT2 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT2_SRAMWPROT2_Msk (0xffffffffUL)            /*!< SRAMWPROT2 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMWPROT3  ======================================================= */
#define MCUCTRL_SRAMWPROT3_SRAMWPROT3_Pos (0UL)                     /*!< SRAMWPROT3 (Bit 0)                                    */
#define MCUCTRL_SRAMWPROT3_SRAMWPROT3_Msk (0xffffUL)                /*!< SRAMWPROT3 (Bitfield-Mask: 0xffff)                    */
/* ======================================================  SRAMRPROT0  ======================================================= */
#define MCUCTRL_SRAMRPROT0_SRAMRPROT0_Pos (0UL)                     /*!< SRAMRPROT0 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT0_SRAMRPROT0_Msk (0xffffffffUL)            /*!< SRAMRPROT0 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT1  ======================================================= */
#define MCUCTRL_SRAMRPROT1_SRAMRPROT1_Pos (0UL)                     /*!< SRAMRPROT1 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT1_SRAMRPROT1_Msk (0xffffffffUL)            /*!< SRAMRPROT1 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT2  ======================================================= */
#define MCUCTRL_SRAMRPROT2_SRAMRPROT2_Pos (0UL)                     /*!< SRAMRPROT2 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT2_SRAMRPROT2_Msk (0xffffffffUL)            /*!< SRAMRPROT2 (Bitfield-Mask: 0xffffffff)                */
/* ======================================================  SRAMRPROT3  ======================================================= */
#define MCUCTRL_SRAMRPROT3_SRAMRPROT3_Pos (0UL)                     /*!< SRAMRPROT3 (Bit 0)                                    */
#define MCUCTRL_SRAMRPROT3_SRAMRPROT3_Msk (0xffffUL)                /*!< SRAMRPROT3 (Bitfield-Mask: 0xffff)                    */
/* =======================================================  SDIO0CTRL  ======================================================= */
#define MCUCTRL_SDIO0CTRL_SDIO0DATOPENDRAINEN_Pos (18UL)            /*!< SDIO0DATOPENDRAINEN (Bit 18)                          */
#define MCUCTRL_SDIO0CTRL_SDIO0DATOPENDRAINEN_Msk (0x40000UL)       /*!< SDIO0DATOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO0CTRL_SDIO0CMDOPENDRAINEN_Pos (17UL)            /*!< SDIO0CMDOPENDRAINEN (Bit 17)                          */
#define MCUCTRL_SDIO0CTRL_SDIO0CMDOPENDRAINEN_Msk (0x20000UL)       /*!< SDIO0CMDOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Pos (15UL)                 /*!< SDIO0XINCLKSEL (Bit 15)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKSEL_Msk (0x18000UL)            /*!< SDIO0XINCLKSEL (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_SDIO0CTRL_SDIO0ASYNCWKUPENA_Pos (14UL)              /*!< SDIO0ASYNCWKUPENA (Bit 14)                            */
#define MCUCTRL_SDIO0CTRL_SDIO0ASYNCWKUPENA_Msk (0x4000UL)          /*!< SDIO0ASYNCWKUPENA (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYSEL_Pos (10UL)                /*!< SDIO0OTAPDLYSEL (Bit 10)                              */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYSEL_Msk (0x3c00UL)            /*!< SDIO0OTAPDLYSEL (Bitfield-Mask: 0x0f)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYENA_Pos (9UL)                 /*!< SDIO0OTAPDLYENA (Bit 9)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0OTAPDLYENA_Msk (0x200UL)             /*!< SDIO0OTAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYSEL_Pos (4UL)                 /*!< SDIO0ITAPDLYSEL (Bit 4)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYSEL_Msk (0x1f0UL)             /*!< SDIO0ITAPDLYSEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYENA_Pos (3UL)                 /*!< SDIO0ITAPDLYENA (Bit 3)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPDLYENA_Msk (0x8UL)               /*!< SDIO0ITAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPCHGWIN_Pos (2UL)                 /*!< SDIO0ITAPCHGWIN (Bit 2)                               */
#define MCUCTRL_SDIO0CTRL_SDIO0ITAPCHGWIN_Msk (0x4UL)               /*!< SDIO0ITAPCHGWIN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKEN_Pos (1UL)                   /*!< SDIO0XINCLKEN (Bit 1)                                 */
#define MCUCTRL_SDIO0CTRL_SDIO0XINCLKEN_Msk (0x2UL)                 /*!< SDIO0XINCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SDIO0CTRL_SDIO0SYSCLKEN_Pos (0UL)                   /*!< SDIO0SYSCLKEN (Bit 0)                                 */
#define MCUCTRL_SDIO0CTRL_SDIO0SYSCLKEN_Msk (0x1UL)                 /*!< SDIO0SYSCLKEN (Bitfield-Mask: 0x01)                   */
/* =======================================================  SDIO1CTRL  ======================================================= */
#define MCUCTRL_SDIO1CTRL_SDIO1DATOPENDRAINEN_Pos (18UL)            /*!< SDIO1DATOPENDRAINEN (Bit 18)                          */
#define MCUCTRL_SDIO1CTRL_SDIO1DATOPENDRAINEN_Msk (0x40000UL)       /*!< SDIO1DATOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO1CTRL_SDIO1CMDOPENDRAINEN_Pos (17UL)            /*!< SDIO1CMDOPENDRAINEN (Bit 17)                          */
#define MCUCTRL_SDIO1CTRL_SDIO1CMDOPENDRAINEN_Msk (0x20000UL)       /*!< SDIO1CMDOPENDRAINEN (Bitfield-Mask: 0x01)             */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Pos (15UL)                 /*!< SDIO1XINCLKSEL (Bit 15)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKSEL_Msk (0x18000UL)            /*!< SDIO1XINCLKSEL (Bitfield-Mask: 0x03)                  */
#define MCUCTRL_SDIO1CTRL_SDIO1ASYNCWKUPENA_Pos (14UL)              /*!< SDIO1ASYNCWKUPENA (Bit 14)                            */
#define MCUCTRL_SDIO1CTRL_SDIO1ASYNCWKUPENA_Msk (0x4000UL)          /*!< SDIO1ASYNCWKUPENA (Bitfield-Mask: 0x01)               */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYSEL_Pos (10UL)                /*!< SDIO1OTAPDLYSEL (Bit 10)                              */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYSEL_Msk (0x3c00UL)            /*!< SDIO1OTAPDLYSEL (Bitfield-Mask: 0x0f)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYENA_Pos (9UL)                 /*!< SDIO1OTAPDLYENA (Bit 9)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1OTAPDLYENA_Msk (0x200UL)             /*!< SDIO1OTAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYSEL_Pos (4UL)                 /*!< SDIO1ITAPDLYSEL (Bit 4)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYSEL_Msk (0x1f0UL)             /*!< SDIO1ITAPDLYSEL (Bitfield-Mask: 0x1f)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYENA_Pos (3UL)                 /*!< SDIO1ITAPDLYENA (Bit 3)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPDLYENA_Msk (0x8UL)               /*!< SDIO1ITAPDLYENA (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPCHGWIN_Pos (2UL)                 /*!< SDIO1ITAPCHGWIN (Bit 2)                               */
#define MCUCTRL_SDIO1CTRL_SDIO1ITAPCHGWIN_Msk (0x4UL)               /*!< SDIO1ITAPCHGWIN (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKEN_Pos (1UL)                   /*!< SDIO1XINCLKEN (Bit 1)                                 */
#define MCUCTRL_SDIO1CTRL_SDIO1XINCLKEN_Msk (0x2UL)                 /*!< SDIO1XINCLKEN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_SDIO1CTRL_SDIO1SYSCLKEN_Pos (0UL)                   /*!< SDIO1SYSCLKEN (Bit 0)                                 */
#define MCUCTRL_SDIO1CTRL_SDIO1SYSCLKEN_Msk (0x1UL)                 /*!< SDIO1SYSCLKEN (Bitfield-Mask: 0x01)                   */
/* ========================================================  PDMCTRL  ======================================================== */
#define MCUCTRL_PDMCTRL_PDMGLOBALEN_Pos   (0UL)                     /*!< PDMGLOBALEN (Bit 0)                                   */
#define MCUCTRL_PDMCTRL_PDMGLOBALEN_Msk   (0x1UL)                   /*!< PDMGLOBALEN (Bitfield-Mask: 0x01)                     */
/* ========================================================  DSIBIST  ======================================================== */
#define MCUCTRL_DSIBIST_DSIBISTDONE_Pos   (31UL)                    /*!< DSIBISTDONE (Bit 31)                                  */
#define MCUCTRL_DSIBIST_DSIBISTDONE_Msk   (0x80000000UL)            /*!< DSIBISTDONE (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESC_Pos (30UL)                  /*!< DSIBISTERRRXESC (Bit 30)                              */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESC_Msk (0x40000000UL)          /*!< DSIBISTERRRXESC (Bitfield-Mask: 0x01)                 */
