AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define MCUCTRL_DSIBIST_DSIBISTERRRXESCSYNC_Pos (29UL)              /*!< DSIBISTERRRXESCSYNC (Bit 29)                          */
#define MCUCTRL_DSIBIST_DSIBISTERRRXESCSYNC_Msk (0x20000000UL)      /*!< DSIBISTERRRXESCSYNC (Bitfield-Mask: 0x01)             */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHS_Pos (28UL)                   /*!< DSIBISTERRRXHS (Bit 28)                               */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHS_Msk (0x10000000UL)           /*!< DSIBISTERRRXHS (Bitfield-Mask: 0x01)                  */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHSSYNC_Pos (27UL)               /*!< DSIBISTERRRXHSSYNC (Bit 27)                           */
#define MCUCTRL_DSIBIST_DSIBISTERRRXHSSYNC_Msk (0x8000000UL)        /*!< DSIBISTERRRXHSSYNC (Bitfield-Mask: 0x01)              */
#define MCUCTRL_DSIBIST_DSIBISTSEED_Pos   (8UL)                     /*!< DSIBISTSEED (Bit 8)                                   */
#define MCUCTRL_DSIBIST_DSIBISTSEED_Msk   (0xff00UL)                /*!< DSIBISTSEED (Bitfield-Mask: 0xff)                     */
#define MCUCTRL_DSIBIST_DSIBISTMODE_Pos   (2UL)                     /*!< DSIBISTMODE (Bit 2)                                   */
#define MCUCTRL_DSIBIST_DSIBISTMODE_Msk   (0xcUL)                   /*!< DSIBISTMODE (Bitfield-Mask: 0x03)                     */
#define MCUCTRL_DSIBIST_DSIBISTFORCEERR_Pos (1UL)                   /*!< DSIBISTFORCEERR (Bit 1)                               */
#define MCUCTRL_DSIBIST_DSIBISTFORCEERR_Msk (0x2UL)                 /*!< DSIBISTFORCEERR (Bitfield-Mask: 0x01)                 */
#define MCUCTRL_DSIBIST_DSIBISTLP_Pos     (0UL)                     /*!< DSIBISTLP (Bit 0)                                     */
#define MCUCTRL_DSIBIST_DSIBISTLP_Msk     (0x1UL)                   /*!< DSIBISTLP (Bitfield-Mask: 0x01)                       */
/* =====================================================  SSRAMMISCCTRL  ===================================================== */
#define MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK_Pos (2UL)                  /*!< CM4SRAMCHK (Bit 2)                                    */
#define MCUCTRL_SSRAMMISCCTRL_CM4SRAMCHK_Msk (0x4UL)                /*!< CM4SRAMCHK (Bitfield-Mask: 0x01)                      */
#define MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK_Pos (1UL)                 /*!< DISPSRAMCHK (Bit 1)                                   */
#define MCUCTRL_SSRAMMISCCTRL_DISPSRAMCHK_Msk (0x2UL)               /*!< DISPSRAMCHK (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK_Pos (0UL)                  /*!< GFXSRAMCHK (Bit 0)                                    */
#define MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK_Msk (0x1UL)                /*!< GFXSRAMCHK (Bitfield-Mask: 0x01)                      */
/* ======================================================  DISPSTATUS  ======================================================= */
#define MCUCTRL_DISPSTATUS_DSISTATUS_Pos  (0UL)                     /*!< DSISTATUS (Bit 0)                                     */
#define MCUCTRL_DISPSTATUS_DSISTATUS_Msk  (0x7UL)                   /*!< DSISTATUS (Bitfield-Mask: 0x07)                       */
/* ========================================================  CPUCFG  ========================================================= */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Pos   (4UL)                     /*!< CFGNSSTCALIB (Bit 4)                                  */
#define MCUCTRL_CPUCFG_CFGNSSTCALIB_Msk   (0x3ffffff0UL)            /*!< CFGNSSTCALIB (Bitfield-Mask: 0x3ffffff)               */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Pos   (3UL)                     /*!< INITL1RSTDIS (Bit 3)                                  */
#define MCUCTRL_CPUCFG_INITL1RSTDIS_Msk   (0x8UL)                   /*!< INITL1RSTDIS (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Pos    (2UL)                     /*!< INITPAHBDIS (Bit 2)                                   */
#define MCUCTRL_CPUCFG_INITPAHBDIS_Msk    (0x4UL)                   /*!< INITPAHBDIS (Bitfield-Mask: 0x01)                     */
#define MCUCTRL_CPUCFG_INITTCMDIS_Pos     (0UL)                     /*!< INITTCMDIS (Bit 0)                                    */
#define MCUCTRL_CPUCFG_INITTCMDIS_Msk     (0x3UL)                   /*!< INITTCMDIS (Bitfield-Mask: 0x03)                      */
/* ========================================================  PLLCTL0  ======================================================== */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDN_Pos (31UL)                    /*!< SYSPLLVDDFPDN (Bit 31)                                */
#define MCUCTRL_PLLCTL0_SYSPLLVDDFPDN_Msk (0x80000000UL)            /*!< SYSPLLVDDFPDN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDN_Pos (30UL)                    /*!< SYSPLLVDDHPDN (Bit 30)                                */
#define MCUCTRL_PLLCTL0_SYSPLLVDDHPDN_Msk (0x40000000UL)            /*!< SYSPLLVDDHPDN (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Pos     (29UL)                    /*!< SYSPLLPDB (Bit 29)                                    */
#define MCUCTRL_PLLCTL0_SYSPLLPDB_Msk     (0x20000000UL)            /*!< SYSPLLPDB (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_VCOSELECT_Pos     (9UL)                     /*!< VCOSELECT (Bit 9)                                     */
#define MCUCTRL_PLLCTL0_VCOSELECT_Msk     (0x200UL)                 /*!< VCOSELECT (Bitfield-Mask: 0x01)                       */
#define MCUCTRL_PLLCTL0_BYPASS_Pos        (8UL)                     /*!< BYPASS (Bit 8)                                        */
#define MCUCTRL_PLLCTL0_BYPASS_Msk        (0x100UL)                 /*!< BYPASS (Bitfield-Mask: 0x01)                          */
#define MCUCTRL_PLLCTL0_FREFSEL_Pos       (5UL)                     /*!< FREFSEL (Bit 5)                                       */
#define MCUCTRL_PLLCTL0_FREFSEL_Msk       (0x60UL)                  /*!< FREFSEL (Bitfield-Mask: 0x03)                         */
#define MCUCTRL_PLLCTL0_DACPD_Pos         (4UL)                     /*!< DACPD (Bit 4)                                         */
#define MCUCTRL_PLLCTL0_DACPD_Msk         (0x10UL)                  /*!< DACPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_DSMPD_Pos         (3UL)                     /*!< DSMPD (Bit 3)                                         */
#define MCUCTRL_PLLCTL0_DSMPD_Msk         (0x8UL)                   /*!< DSMPD (Bitfield-Mask: 0x01)                           */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Pos  (2UL)                     /*!< FOUT4PHASEPD (Bit 2)                                  */
#define MCUCTRL_PLLCTL0_FOUT4PHASEPD_Msk  (0x4UL)                   /*!< FOUT4PHASEPD (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Pos (1UL)                     /*!< FOUTPOSTDIVPD (Bit 1)                                 */
#define MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Msk (0x2UL)                   /*!< FOUTPOSTDIVPD (Bitfield-Mask: 0x01)                   */
#define MCUCTRL_PLLCTL0_FOUTVCOPD_Pos     (0UL)                     /*!< FOUTVCOPD (Bit 0)                                     */
#define MCUCTRL_PLLCTL0_FOUTVCOPD_Msk     (0x1UL)                   /*!< FOUTVCOPD (Bitfield-Mask: 0x01)                       */
/* ========================================================  PLLDIV0  ======================================================== */
#define MCUCTRL_PLLDIV0_FRAC_Pos          (0UL)                     /*!< FRAC (Bit 0)                                          */
#define MCUCTRL_PLLDIV0_FRAC_Msk          (0xffffffUL)              /*!< FRAC (Bitfield-Mask: 0xffffff)                        */
/* ========================================================  PLLDIV1  ======================================================== */
#define MCUCTRL_PLLDIV1_FBDIV_Pos         (16UL)                    /*!< FBDIV (Bit 16)                                        */
#define MCUCTRL_PLLDIV1_FBDIV_Msk         (0xfff0000UL)             /*!< FBDIV (Bitfield-Mask: 0xfff)                          */
#define MCUCTRL_PLLDIV1_POSTDIV1_Pos      (12UL)                    /*!< POSTDIV1 (Bit 12)                                     */
#define MCUCTRL_PLLDIV1_POSTDIV1_Msk      (0x7000UL)                /*!< POSTDIV1 (Bitfield-Mask: 0x07)                        */
#define MCUCTRL_PLLDIV1_POSTDIV2_Pos      (8UL)                     /*!< POSTDIV2 (Bit 8)                                      */
#define MCUCTRL_PLLDIV1_POSTDIV2_Msk      (0x700UL)                 /*!< POSTDIV2 (Bitfield-Mask: 0x07)                        */
#define MCUCTRL_PLLDIV1_REFDIV_Pos        (0UL)                     /*!< REFDIV (Bit 0)                                        */
#define MCUCTRL_PLLDIV1_REFDIV_Msk        (0x3fUL)                  /*!< REFDIV (Bitfield-Mask: 0x3f)                          */
/* ========================================================  PLLSTAT  ======================================================== */
#define MCUCTRL_PLLSTAT_LOCK_Pos          (0UL)                     /*!< LOCK (Bit 0)                                          */
#define MCUCTRL_PLLSTAT_LOCK_Msk          (0x1UL)                   /*!< LOCK (Bitfield-Mask: 0x01)                            */
/* =======================================================  PLLMUXCTL  ======================================================= */
#define MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_Pos (3UL)                   /*!< I2S0PLLCLKSEL (Bit 3)                                 */
#define MCUCTRL_PLLMUXCTL_I2S0PLLCLKSEL_Msk (0x18UL)                /*!< I2S0PLLCLKSEL (Bitfield-Mask: 0x03)                   */
#define MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_Pos (2UL)                    /*!< USBPLLCLKSEL (Bit 2)                                  */
#define MCUCTRL_PLLMUXCTL_USBPLLCLKSEL_Msk (0x4UL)                  /*!< USBPLLCLKSEL (Bitfield-Mask: 0x01)                    */
#define MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_Pos (0UL)                    /*!< PDMPLLCLKSEL (Bit 0)                                  */
#define MCUCTRL_PLLMUXCTL_PDMPLLCLKSEL_Msk (0x3UL)                  /*!< PDMPLLCLKSEL (Bitfield-Mask: 0x03)                    */
/* ======================================================  CM4CODEBASE  ====================================================== */
#define MCUCTRL_CM4CODEBASE_CM4CODEBASE_Pos (4UL)                   /*!< CM4CODEBASE (Bit 4)                                   */
#define MCUCTRL_CM4CODEBASE_CM4CODEBASE_Msk (0xfffffff0UL)          /*!< CM4CODEBASE (Bitfield-Mask: 0xfffffff)                */
/* =====================================================  RADIOFINECNT  ====================================================== */
#define MCUCTRL_RADIOFINECNT_FINECNT_Pos  (0UL)                     /*!< FINECNT (Bit 0)                                       */
#define MCUCTRL_RADIOFINECNT_FINECNT_Msk  (0x3ffUL)                 /*!< FINECNT (Bitfield-Mask: 0x3ff)                        */
/* =====================================================  RADIOCLKNCNT  ====================================================== */
#define MCUCTRL_RADIOCLKNCNT_CLKNCNT_Pos  (0UL)                     /*!< CLKNCNT (Bit 0)                                       */
#define MCUCTRL_RADIOCLKNCNT_CLKNCNT_Msk  (0xfffffffUL)             /*!< CLKNCNT (Bitfield-Mask: 0xfffffff)                    */


/* =========================================================================================================================== */
/* ================                                           MSPI0                                           ================ */
/* =========================================================================================================================== */

