AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ======================================================  MCUPERFREQ  ======================================================= */
#define PWRCTRL_MCUPERFREQ_PWRSTMCUE_Pos  (30UL)                    /*!< PWRSTMCUE (Bit 30)                                    */
#define PWRCTRL_MCUPERFREQ_PWRSTMCUE_Msk  (0xc0000000UL)            /*!< PWRSTMCUE (Bitfield-Mask: 0x03)                       */
#define PWRCTRL_MCUPERFREQ_PWRENMCUE_Pos  (29UL)                    /*!< PWRENMCUE (Bit 29)                                    */
#define PWRCTRL_MCUPERFREQ_PWRENMCUE_Msk  (0x20000000UL)            /*!< PWRENMCUE (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_MCUPERFREQ_WAITFORHP2_Pos (5UL)                     /*!< WAITFORHP2 (Bit 5)                                    */
#define PWRCTRL_MCUPERFREQ_WAITFORHP2_Msk (0x20UL)                  /*!< WAITFORHP2 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_MCUPERFREQ_MCUPERFSTATUS_Pos (3UL)                  /*!< MCUPERFSTATUS (Bit 3)                                 */
#define PWRCTRL_MCUPERFREQ_MCUPERFSTATUS_Msk (0x18UL)               /*!< MCUPERFSTATUS (Bitfield-Mask: 0x03)                   */
#define PWRCTRL_MCUPERFREQ_MCUPERFACK_Pos (2UL)                     /*!< MCUPERFACK (Bit 2)                                    */
#define PWRCTRL_MCUPERFREQ_MCUPERFACK_Msk (0x4UL)                   /*!< MCUPERFACK (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_MCUPERFREQ_MCUPERFREQ_Pos (0UL)                     /*!< MCUPERFREQ (Bit 0)                                    */
#define PWRCTRL_MCUPERFREQ_MCUPERFREQ_Msk (0x3UL)                   /*!< MCUPERFREQ (Bitfield-Mask: 0x03)                      */
/* =======================================================  DEVPWREN  ======================================================== */
#define PWRCTRL_DEVPWREN_PWRENNETAOL_Pos  (31UL)                    /*!< PWRENNETAOL (Bit 31)                                  */
#define PWRCTRL_DEVPWREN_PWRENNETAOL_Msk  (0x80000000UL)            /*!< PWRENNETAOL (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENI3C_Pos     (30UL)                    /*!< PWRENI3C (Bit 30)                                     */
#define PWRCTRL_DEVPWREN_PWRENI3C_Msk     (0x40000000UL)            /*!< PWRENI3C (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENIOSFD1_Pos  (29UL)                    /*!< PWRENIOSFD1 (Bit 29)                                  */
#define PWRCTRL_DEVPWREN_PWRENIOSFD1_Msk  (0x20000000UL)            /*!< PWRENIOSFD1 (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENIOSFD0_Pos  (28UL)                    /*!< PWRENIOSFD0 (Bit 28)                                  */
#define PWRCTRL_DEVPWREN_PWRENIOSFD0_Msk  (0x10000000UL)            /*!< PWRENIOSFD0 (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENOTP_Pos     (27UL)                    /*!< PWRENOTP (Bit 27)                                     */
#define PWRCTRL_DEVPWREN_PWRENOTP_Msk     (0x8000000UL)             /*!< PWRENOTP (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENDBG_Pos     (26UL)                    /*!< PWRENDBG (Bit 26)                                     */
#define PWRCTRL_DEVPWREN_PWRENDBG_Msk     (0x4000000UL)             /*!< PWRENDBG (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENUSBPHY_Pos  (25UL)                    /*!< PWRENUSBPHY (Bit 25)                                  */
#define PWRCTRL_DEVPWREN_PWRENUSBPHY_Msk  (0x2000000UL)             /*!< PWRENUSBPHY (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENUSB_Pos     (24UL)                    /*!< PWRENUSB (Bit 24)                                     */
#define PWRCTRL_DEVPWREN_PWRENUSB_Msk     (0x1000000UL)             /*!< PWRENUSB (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENSDIO1_Pos   (23UL)                    /*!< PWRENSDIO1 (Bit 23)                                   */
#define PWRCTRL_DEVPWREN_PWRENSDIO1_Msk   (0x800000UL)              /*!< PWRENSDIO1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENSDIO0_Pos   (22UL)                    /*!< PWRENSDIO0 (Bit 22)                                   */
#define PWRCTRL_DEVPWREN_PWRENSDIO0_Msk   (0x400000UL)              /*!< PWRENSDIO0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENCRYPTO_Pos  (21UL)                    /*!< PWRENCRYPTO (Bit 21)                                  */
#define PWRCTRL_DEVPWREN_PWRENCRYPTO_Msk  (0x200000UL)              /*!< PWRENCRYPTO (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENDISPPHY_Pos (20UL)                    /*!< PWRENDISPPHY (Bit 20)                                 */
#define PWRCTRL_DEVPWREN_PWRENDISPPHY_Msk (0x100000UL)              /*!< PWRENDISPPHY (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_DEVPWREN_PWRENDISP_Pos    (19UL)                    /*!< PWRENDISP (Bit 19)                                    */
#define PWRCTRL_DEVPWREN_PWRENDISP_Msk    (0x80000UL)               /*!< PWRENDISP (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENGFX_Pos     (18UL)                    /*!< PWRENGFX (Bit 18)                                     */
#define PWRCTRL_DEVPWREN_PWRENGFX_Msk     (0x40000UL)               /*!< PWRENGFX (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENMSPI2_Pos   (16UL)                    /*!< PWRENMSPI2 (Bit 16)                                   */
#define PWRCTRL_DEVPWREN_PWRENMSPI2_Msk   (0x10000UL)               /*!< PWRENMSPI2 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENMSPI1_Pos   (15UL)                    /*!< PWRENMSPI1 (Bit 15)                                   */
#define PWRCTRL_DEVPWREN_PWRENMSPI1_Msk   (0x8000UL)                /*!< PWRENMSPI1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENMSPI0_Pos   (14UL)                    /*!< PWRENMSPI0 (Bit 14)                                   */
#define PWRCTRL_DEVPWREN_PWRENMSPI0_Msk   (0x4000UL)                /*!< PWRENMSPI0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENADC_Pos     (13UL)                    /*!< PWRENADC (Bit 13)                                     */
#define PWRCTRL_DEVPWREN_PWRENADC_Msk     (0x2000UL)                /*!< PWRENADC (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREN_PWRENUART1_Pos   (10UL)                    /*!< PWRENUART1 (Bit 10)                                   */
#define PWRCTRL_DEVPWREN_PWRENUART1_Msk   (0x400UL)                 /*!< PWRENUART1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENUART0_Pos   (9UL)                     /*!< PWRENUART0 (Bit 9)                                    */
#define PWRCTRL_DEVPWREN_PWRENUART0_Msk   (0x200UL)                 /*!< PWRENUART0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWREN_PWRENI3CPHY_Pos  (7UL)                     /*!< PWRENI3CPHY (Bit 7)                                   */
#define PWRCTRL_DEVPWREN_PWRENI3CPHY_Msk  (0x80UL)                  /*!< PWRENI3CPHY (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWREN_PWRENIOM5_Pos    (6UL)                     /*!< PWRENIOM5 (Bit 6)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM5_Msk    (0x40UL)                  /*!< PWRENIOM5 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENIOM4_Pos    (5UL)                     /*!< PWRENIOM4 (Bit 5)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM4_Msk    (0x20UL)                  /*!< PWRENIOM4 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENIOM3_Pos    (4UL)                     /*!< PWRENIOM3 (Bit 4)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM3_Msk    (0x10UL)                  /*!< PWRENIOM3 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENIOM2_Pos    (3UL)                     /*!< PWRENIOM2 (Bit 3)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM2_Msk    (0x8UL)                   /*!< PWRENIOM2 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENIOM1_Pos    (2UL)                     /*!< PWRENIOM1 (Bit 2)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM1_Msk    (0x4UL)                   /*!< PWRENIOM1 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREN_PWRENIOM0_Pos    (1UL)                     /*!< PWRENIOM0 (Bit 1)                                     */
#define PWRCTRL_DEVPWREN_PWRENIOM0_Msk    (0x2UL)                   /*!< PWRENIOM0 (Bitfield-Mask: 0x01)                       */
/* =====================================================  DEVPWRSTATUS  ====================================================== */
#define PWRCTRL_DEVPWRSTATUS_PWRSTNETAOL_Pos (31UL)                 /*!< PWRSTNETAOL (Bit 31)                                  */
#define PWRCTRL_DEVPWRSTATUS_PWRSTNETAOL_Msk (0x80000000UL)         /*!< PWRSTNETAOL (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTI3C_Pos (30UL)                    /*!< PWRSTI3C (Bit 30)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTI3C_Msk (0x40000000UL)            /*!< PWRSTI3C (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOSFD1_Pos (29UL)                 /*!< PWRSTIOSFD1 (Bit 29)                                  */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOSFD1_Msk (0x20000000UL)         /*!< PWRSTIOSFD1 (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOSFD0_Pos (28UL)                 /*!< PWRSTIOSFD0 (Bit 28)                                  */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOSFD0_Msk (0x10000000UL)         /*!< PWRSTIOSFD0 (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTOTP_Pos (27UL)                    /*!< PWRSTOTP (Bit 27)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTOTP_Msk (0x8000000UL)             /*!< PWRSTOTP (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDBG_Pos (26UL)                    /*!< PWRSTDBG (Bit 26)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDBG_Msk (0x4000000UL)             /*!< PWRSTDBG (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUSBPHY_Pos (25UL)                 /*!< PWRSTUSBPHY (Bit 25)                                  */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUSBPHY_Msk (0x2000000UL)          /*!< PWRSTUSBPHY (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUSB_Pos (24UL)                    /*!< PWRSTUSB (Bit 24)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUSB_Msk (0x1000000UL)             /*!< PWRSTUSB (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTSDIO1_Pos (23UL)                  /*!< PWRSTSDIO1 (Bit 23)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTSDIO1_Msk (0x800000UL)            /*!< PWRSTSDIO1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTSDIO0_Pos (22UL)                  /*!< PWRSTSDIO0 (Bit 22)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTSDIO0_Msk (0x400000UL)            /*!< PWRSTSDIO0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTCRYPTO_Pos (21UL)                 /*!< PWRSTCRYPTO (Bit 21)                                  */
#define PWRCTRL_DEVPWRSTATUS_PWRSTCRYPTO_Msk (0x200000UL)           /*!< PWRSTCRYPTO (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDISPPHY_Pos (20UL)                /*!< PWRSTDISPPHY (Bit 20)                                 */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDISPPHY_Msk (0x100000UL)          /*!< PWRSTDISPPHY (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDISP_Pos (19UL)                   /*!< PWRSTDISP (Bit 19)                                    */
#define PWRCTRL_DEVPWRSTATUS_PWRSTDISP_Msk (0x80000UL)              /*!< PWRSTDISP (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTGFX_Pos (18UL)                    /*!< PWRSTGFX (Bit 18)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTGFX_Msk (0x40000UL)               /*!< PWRSTGFX (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTPLL_Pos (17UL)                    /*!< PWRSTPLL (Bit 17)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTPLL_Msk (0x20000UL)               /*!< PWRSTPLL (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI2_Pos (16UL)                  /*!< PWRSTMSPI2 (Bit 16)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI2_Msk (0x10000UL)             /*!< PWRSTMSPI2 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI1_Pos (15UL)                  /*!< PWRSTMSPI1 (Bit 15)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI1_Msk (0x8000UL)              /*!< PWRSTMSPI1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI0_Pos (14UL)                  /*!< PWRSTMSPI0 (Bit 14)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTMSPI0_Msk (0x4000UL)              /*!< PWRSTMSPI0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTADC_Pos (13UL)                    /*!< PWRSTADC (Bit 13)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTADC_Msk (0x2000UL)                /*!< PWRSTADC (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUART1_Pos (10UL)                  /*!< PWRSTUART1 (Bit 10)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUART1_Msk (0x400UL)               /*!< PWRSTUART1 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUART0_Pos (9UL)                   /*!< PWRSTUART0 (Bit 9)                                    */
#define PWRCTRL_DEVPWRSTATUS_PWRSTUART0_Msk (0x200UL)               /*!< PWRSTUART0 (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_DEVPWRSTATUS_PWRSTI3CPHY_Pos (7UL)                  /*!< PWRSTI3CPHY (Bit 7)                                   */
#define PWRCTRL_DEVPWRSTATUS_PWRSTI3CPHY_Msk (0x80UL)               /*!< PWRSTI3CPHY (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM5_Pos (6UL)                    /*!< PWRSTIOM5 (Bit 6)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM5_Msk (0x40UL)                 /*!< PWRSTIOM5 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM4_Pos (5UL)                    /*!< PWRSTIOM4 (Bit 5)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM4_Msk (0x20UL)                 /*!< PWRSTIOM4 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM3_Pos (4UL)                    /*!< PWRSTIOM3 (Bit 4)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM3_Msk (0x10UL)                 /*!< PWRSTIOM3 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM2_Pos (3UL)                    /*!< PWRSTIOM2 (Bit 3)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM2_Msk (0x8UL)                  /*!< PWRSTIOM2 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM1_Pos (2UL)                    /*!< PWRSTIOM1 (Bit 2)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM1_Msk (0x4UL)                  /*!< PWRSTIOM1 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM0_Pos (1UL)                    /*!< PWRSTIOM0 (Bit 1)                                     */
#define PWRCTRL_DEVPWRSTATUS_PWRSTIOM0_Msk (0x2UL)                  /*!< PWRSTIOM0 (Bitfield-Mask: 0x01)                       */
/* ======================================================  AUDSSPWREN  ======================================================= */
#define PWRCTRL_AUDSSPWREN_PWRENI2S0_Pos  (6UL)                     /*!< PWRENI2S0 (Bit 6)                                     */
#define PWRCTRL_AUDSSPWREN_PWRENI2S0_Msk  (0x40UL)                  /*!< PWRENI2S0 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_AUDSSPWREN_PWRENPDM0_Pos  (2UL)                     /*!< PWRENPDM0 (Bit 2)                                     */
#define PWRCTRL_AUDSSPWREN_PWRENPDM0_Msk  (0x4UL)                   /*!< PWRENPDM0 (Bitfield-Mask: 0x01)                       */
/* ====================================================  AUDSSPWRSTATUS  ===================================================== */
#define PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_Pos (6UL)                  /*!< PWRSTI2S0 (Bit 6)                                     */
#define PWRCTRL_AUDSSPWRSTATUS_PWRSTI2S0_Msk (0x40UL)               /*!< PWRSTI2S0 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_Pos (2UL)                  /*!< PWRSTPDM0 (Bit 2)                                     */
#define PWRCTRL_AUDSSPWRSTATUS_PWRSTPDM0_Msk (0x4UL)                /*!< PWRSTPDM0 (Bitfield-Mask: 0x01)                       */
/* =======================================================  MEMPWREN  ======================================================== */
#define PWRCTRL_MEMPWREN_PWRENROM_Pos     (5UL)                     /*!< PWRENROM (Bit 5)                                      */
#define PWRCTRL_MEMPWREN_PWRENROM_Msk     (0x20UL)                  /*!< PWRENROM (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_MEMPWREN_PWRENNVM_Pos     (3UL)                     /*!< PWRENNVM (Bit 3)                                      */
#define PWRCTRL_MEMPWREN_PWRENNVM_Msk     (0x8UL)                   /*!< PWRENNVM (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_MEMPWREN_PWRENTCM_Pos     (0UL)                     /*!< PWRENTCM (Bit 0)                                      */
#define PWRCTRL_MEMPWREN_PWRENTCM_Msk     (0x3UL)                   /*!< PWRENTCM (Bitfield-Mask: 0x03)                        */
/* =====================================================  MEMPWRSTATUS  ====================================================== */
#define PWRCTRL_MEMPWRSTATUS_PWRSTROM_Pos (7UL)                     /*!< PWRSTROM (Bit 7)                                      */
#define PWRCTRL_MEMPWRSTATUS_PWRSTROM_Msk (0x80UL)                  /*!< PWRSTROM (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_MEMPWRSTATUS_PWRSTCACHE_Pos (4UL)                   /*!< PWRSTCACHE (Bit 4)                                    */
#define PWRCTRL_MEMPWRSTATUS_PWRSTCACHE_Msk (0x10UL)                /*!< PWRSTCACHE (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_MEMPWRSTATUS_PWRSTNVM0_Pos (3UL)                    /*!< PWRSTNVM0 (Bit 3)                                     */
#define PWRCTRL_MEMPWRSTATUS_PWRSTNVM0_Msk (0x8UL)                  /*!< PWRSTNVM0 (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_MEMPWRSTATUS_PWRSTTCM_Pos (0UL)                     /*!< PWRSTTCM (Bit 0)                                      */
#define PWRCTRL_MEMPWRSTATUS_PWRSTTCM_Msk (0x3UL)                   /*!< PWRSTTCM (Bitfield-Mask: 0x03)                        */
/* =======================================================  MEMRETCFG  ======================================================= */
#define PWRCTRL_MEMRETCFG_NVMPWDCFG_Pos   (2UL)                     /*!< NVMPWDCFG (Bit 2)                                     */
#define PWRCTRL_MEMRETCFG_NVMPWDCFG_Msk   (0xcUL)                   /*!< NVMPWDCFG (Bitfield-Mask: 0x03)                       */
#define PWRCTRL_MEMRETCFG_NVMPWDSLP_Pos   (1UL)                     /*!< NVMPWDSLP (Bit 1)                                     */
#define PWRCTRL_MEMRETCFG_NVMPWDSLP_Msk   (0x2UL)                   /*!< NVMPWDSLP (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_MEMRETCFG_TCMPWDSLP_Pos   (0UL)                     /*!< TCMPWDSLP (Bit 0)                                     */
#define PWRCTRL_MEMRETCFG_TCMPWDSLP_Msk   (0x1UL)                   /*!< TCMPWDSLP (Bitfield-Mask: 0x01)                       */
/* =====================================================  SYSPWRSTATUS  ====================================================== */
#define PWRCTRL_SYSPWRSTATUS_SYSDEEPSLEEP_Pos (31UL)                /*!< SYSDEEPSLEEP (Bit 31)                                 */
#define PWRCTRL_SYSPWRSTATUS_SYSDEEPSLEEP_Msk (0x80000000UL)        /*!< SYSDEEPSLEEP (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_SYSPWRSTATUS_COREDEEPSLEEP_Pos (30UL)               /*!< COREDEEPSLEEP (Bit 30)                                */
#define PWRCTRL_SYSPWRSTATUS_COREDEEPSLEEP_Msk (0x40000000UL)       /*!< COREDEEPSLEEP (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_SYSPWRSTATUS_CORESLEEP_Pos (29UL)                   /*!< CORESLEEP (Bit 29)                                    */
#define PWRCTRL_SYSPWRSTATUS_CORESLEEP_Msk (0x20000000UL)           /*!< CORESLEEP (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_SYSPWRSTATUS_SYSDEEPERSLEEP_Pos (28UL)              /*!< SYSDEEPERSLEEP (Bit 28)                               */
#define PWRCTRL_SYSPWRSTATUS_SYSDEEPERSLEEP_Msk (0x10000000UL)      /*!< SYSDEEPERSLEEP (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUH_Pos (1UL)                    /*!< PWRSTMCUH (Bit 1)                                     */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUH_Msk (0x2UL)                  /*!< PWRSTMCUH (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUL_Pos (0UL)                    /*!< PWRSTMCUL (Bit 0)                                     */
#define PWRCTRL_SYSPWRSTATUS_PWRSTMCUL_Msk (0x1UL)                  /*!< PWRSTMCUL (Bitfield-Mask: 0x01)                       */
/* ======================================================  SSRAMPWREN  ======================================================= */
#define PWRCTRL_SSRAMPWREN_PWRENSSRAM_Pos (0UL)                     /*!< PWRENSSRAM (Bit 0)                                    */
#define PWRCTRL_SSRAMPWREN_PWRENSSRAM_Msk (0x3UL)                   /*!< PWRENSSRAM (Bitfield-Mask: 0x03)                      */
/* ======================================================  SSRAMPWRST  ======================================================= */
#define PWRCTRL_SSRAMPWRST_SSRAMPWRST_Pos (0UL)                     /*!< SSRAMPWRST (Bit 0)                                    */
#define PWRCTRL_SSRAMPWRST_SSRAMPWRST_Msk (0x3UL)                   /*!< SSRAMPWRST (Bitfield-Mask: 0x03)                      */
/* ======================================================  SSRAMRETCFG  ====================================================== */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTDISP_Pos (6UL)                  /*!< SSRAMACTDISP (Bit 6)                                  */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTDISP_Msk (0xc0UL)               /*!< SSRAMACTDISP (Bitfield-Mask: 0x03)                    */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTGFX_Pos (4UL)                   /*!< SSRAMACTGFX (Bit 4)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTGFX_Msk (0x30UL)                /*!< SSRAMACTGFX (Bitfield-Mask: 0x03)                     */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTMCU_Pos (2UL)                   /*!< SSRAMACTMCU (Bit 2)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMACTMCU_Msk (0xcUL)                 /*!< SSRAMACTMCU (Bitfield-Mask: 0x03)                     */
