AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Pos (0UL)                   /*!< SSRAMPWDSLP (Bit 0)                                   */
#define PWRCTRL_SSRAMRETCFG_SSRAMPWDSLP_Msk (0x3UL)                 /*!< SSRAMPWDSLP (Bitfield-Mask: 0x03)                     */
/* =====================================================  DEVPWREVENTEN  ===================================================== */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Pos (12UL)                    /*!< PDMEVEN (Bit 12)                                      */
#define PWRCTRL_DEVPWREVENTEN_PDMEVEN_Msk (0x1000UL)                /*!< PDMEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Pos (10UL)                  /*!< MSPI2EVEN (Bit 10)                                    */
#define PWRCTRL_DEVPWREVENTEN_MSPI2EVEN_Msk (0x400UL)               /*!< MSPI2EVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Pos (9UL)                   /*!< MSPI1EVEN (Bit 9)                                     */
#define PWRCTRL_DEVPWREVENTEN_MSPI1EVEN_Msk (0x200UL)               /*!< MSPI1EVEN (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Pos (8UL)                    /*!< MSPIEVEN (Bit 8)                                      */
#define PWRCTRL_DEVPWREVENTEN_MSPIEVEN_Msk (0x100UL)                /*!< MSPIEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_AUDEVEN_Pos (7UL)                     /*!< AUDEVEN (Bit 7)                                       */
#define PWRCTRL_DEVPWREVENTEN_AUDEVEN_Msk (0x80UL)                  /*!< AUDEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Pos (5UL)                     /*!< ADCEVEN (Bit 5)                                       */
#define PWRCTRL_DEVPWREVENTEN_ADCEVEN_Msk (0x20UL)                  /*!< ADCEVEN (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Pos (4UL)                    /*!< HCPCEVEN (Bit 4)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPCEVEN_Msk (0x10UL)                 /*!< HCPCEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Pos (3UL)                    /*!< HCPBEVEN (Bit 3)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPBEVEN_Msk (0x8UL)                  /*!< HCPBEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Pos (2UL)                    /*!< HCPAEVEN (Bit 2)                                      */
#define PWRCTRL_DEVPWREVENTEN_HCPAEVEN_Msk (0x4UL)                  /*!< HCPAEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Pos (1UL)                    /*!< MCUHEVEN (Bit 1)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCUHEVEN_Msk (0x2UL)                  /*!< MCUHEVEN (Bitfield-Mask: 0x01)                        */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Pos (0UL)                    /*!< MCULEVEN (Bit 0)                                      */
#define PWRCTRL_DEVPWREVENTEN_MCULEVEN_Msk (0x1UL)                  /*!< MCULEVEN (Bitfield-Mask: 0x01)                        */
/* =====================================================  MEMPWREVENTEN  ===================================================== */
#define PWRCTRL_MEMPWREVENTEN_NVM0EN_Pos  (3UL)                     /*!< NVM0EN (Bit 3)                                        */
#define PWRCTRL_MEMPWREVENTEN_NVM0EN_Msk  (0x8UL)                   /*!< NVM0EN (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Pos  (0UL)                     /*!< DTCMEN (Bit 0)                                        */
#define PWRCTRL_MEMPWREVENTEN_DTCMEN_Msk  (0x7UL)                   /*!< DTCMEN (Bitfield-Mask: 0x07)                          */
/* ======================================================  MMSOVERRIDE  ====================================================== */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETDISP_Pos (6UL)            /*!< MMSOVRSSRAMRETDISP (Bit 6)                            */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETDISP_Msk (0xc0UL)         /*!< MMSOVRSSRAMRETDISP (Bitfield-Mask: 0x03)              */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMDISP_Pos (5UL)               /*!< MMSOVRSSRAMDISP (Bit 5)                               */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMDISP_Msk (0x20UL)            /*!< MMSOVRSSRAMDISP (Bitfield-Mask: 0x01)                 */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULDISP_Pos (4UL)                /*!< MMSOVRMCULDISP (Bit 4)                                */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULDISP_Msk (0x10UL)             /*!< MMSOVRMCULDISP (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETGFX_Pos (2UL)             /*!< MMSOVRSSRAMRETGFX (Bit 2)                             */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMRETGFX_Msk (0xcUL)           /*!< MMSOVRSSRAMRETGFX (Bitfield-Mask: 0x03)               */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_Pos (1UL)                /*!< MMSOVRSSRAMGFX (Bit 1)                                */
#define PWRCTRL_MMSOVERRIDE_MMSOVRSSRAMGFX_Msk (0x2UL)              /*!< MMSOVRSSRAMGFX (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_Pos (0UL)                 /*!< MMSOVRMCULGFX (Bit 0)                                 */
#define PWRCTRL_MMSOVERRIDE_MMSOVRMCULGFX_Msk (0x1UL)               /*!< MMSOVRMCULGFX (Bitfield-Mask: 0x01)                   */
/* ======================================================  CPUPWRCTRL  ======================================================= */
#define PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN_Pos (13UL)                 /*!< DEEPERSLEEPEN (Bit 13)                                */
#define PWRCTRL_CPUPWRCTRL_DEEPERSLEEPEN_Msk (0x2000UL)             /*!< DEEPERSLEEPEN (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_Pos (12UL)                /*!< DISFUNCRETMODE (Bit 12)                               */
#define PWRCTRL_CPUPWRCTRL_DISFUNCRETMODE_Msk (0x1000UL)            /*!< DISFUNCRETMODE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_Pos (11UL)                   /*!< DBGCLKSTATE (Bit 11)                                  */
#define PWRCTRL_CPUPWRCTRL_DBGCLKSTATE_Msk (0x800UL)                /*!< DBGCLKSTATE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_FCLKSTATE_Pos  (10UL)                    /*!< FCLKSTATE (Bit 10)                                    */
#define PWRCTRL_CPUPWRCTRL_FCLKSTATE_Msk  (0x400UL)                 /*!< FCLKSTATE (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Pos (9UL)                    /*!< PMUCLKSTATE (Bit 9)                                   */
#define PWRCTRL_CPUPWRCTRL_PMUCLKSTATE_Msk (0x200UL)                /*!< PMUCLKSTATE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Pos (7UL)                   /*!< IWICCLKSTATE (Bit 7)                                  */
#define PWRCTRL_CPUPWRCTRL_IWICCLKSTATE_Msk (0x80UL)                /*!< IWICCLKSTATE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Pos (6UL)                    /*!< CPUCLKOVREN (Bit 6)                                   */
#define PWRCTRL_CPUPWRCTRL_CPUCLKOVREN_Msk (0x40UL)                 /*!< CPUCLKOVREN (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Pos (4UL)                    /*!< EPUPWRSTATE (Bit 4)                                   */
#define PWRCTRL_CPUPWRCTRL_EPUPWRSTATE_Msk (0x30UL)                 /*!< EPUPWRSTATE (Bitfield-Mask: 0x03)                     */
#define PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Pos (3UL)                   /*!< EPUMODEOVREN (Bit 3)                                  */
#define PWRCTRL_CPUPWRCTRL_EPUMODEOVREN_Msk (0x8UL)                 /*!< EPUMODEOVREN (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRCTRL_SLEEPMODE_Pos  (2UL)                     /*!< SLEEPMODE (Bit 2)                                     */
#define PWRCTRL_CPUPWRCTRL_SLEEPMODE_Msk  (0x4UL)                   /*!< SLEEPMODE (Bitfield-Mask: 0x01)                       */
/* =====================================================  CPUPWRSTATUS  ====================================================== */
#define PWRCTRL_CPUPWRSTATUS_MEMRETNOCACHE_Pos (30UL)               /*!< MEMRETNOCACHE (Bit 30)                                */
#define PWRCTRL_CPUPWRSTATUS_MEMRETNOCACHE_Msk (0x40000000UL)       /*!< MEMRETNOCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_ONNOCACHE_Pos (29UL)                   /*!< ONNOCACHE (Bit 29)                                    */
#define PWRCTRL_CPUPWRSTATUS_ONNOCACHE_Msk (0x20000000UL)           /*!< ONNOCACHE (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFNOCACHE_Pos (28UL)               /*!< EPUOFFNOCACHE (Bit 28)                                */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFNOCACHE_Msk (0x10000000UL)       /*!< EPUOFFNOCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETNOCACHE_Pos (27UL)              /*!< FUNCRETNOCACHE (Bit 27)                               */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETNOCACHE_Msk (0x8000000UL)       /*!< FUNCRETNOCACHE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETNOCACHE_Pos (26UL)             /*!< LOGICRETNOCACHE (Bit 26)                              */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETNOCACHE_Msk (0x4000000UL)      /*!< LOGICRETNOCACHE (Bitfield-Mask: 0x01)                 */
#define PWRCTRL_CPUPWRSTATUS_FULLRETNOCACHE_Pos (25UL)              /*!< FULLRETNOCACHE (Bit 25)                               */
#define PWRCTRL_CPUPWRSTATUS_FULLRETNOCACHE_Msk (0x2000000UL)       /*!< FULLRETNOCACHE (Bitfield-Mask: 0x01)                  */
#define PWRCTRL_CPUPWRSTATUS_MEMRETCACHE_Pos (24UL)                 /*!< MEMRETCACHE (Bit 24)                                  */
#define PWRCTRL_CPUPWRSTATUS_MEMRETCACHE_Msk (0x1000000UL)          /*!< MEMRETCACHE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRSTATUS_ONCACHE_Pos  (23UL)                    /*!< ONCACHE (Bit 23)                                      */
#define PWRCTRL_CPUPWRSTATUS_ONCACHE_Msk  (0x800000UL)              /*!< ONCACHE (Bitfield-Mask: 0x01)                         */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFCACHE_Pos (22UL)                 /*!< EPUOFFCACHE (Bit 22)                                  */
#define PWRCTRL_CPUPWRSTATUS_EPUOFFCACHE_Msk (0x400000UL)           /*!< EPUOFFCACHE (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETCACHE_Pos (21UL)                /*!< FUNCRETCACHE (Bit 21)                                 */
#define PWRCTRL_CPUPWRSTATUS_FUNCRETCACHE_Msk (0x200000UL)          /*!< FUNCRETCACHE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETCACHE_Pos (20UL)               /*!< LOGICRETCACHE (Bit 20)                                */
#define PWRCTRL_CPUPWRSTATUS_LOGICRETCACHE_Msk (0x100000UL)         /*!< LOGICRETCACHE (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_FULLRETCACHE_Pos (19UL)                /*!< FULLRETCACHE (Bit 19)                                 */
#define PWRCTRL_CPUPWRSTATUS_FULLRETCACHE_Msk (0x80000UL)           /*!< FULLRETCACHE (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_CPUPWRSTATUS_CPUHP2_Pos   (4UL)                     /*!< CPUHP2 (Bit 4)                                        */
#define PWRCTRL_CPUPWRSTATUS_CPUHP2_Msk   (0x10UL)                  /*!< CPUHP2 (Bitfield-Mask: 0x01)                          */
#define PWRCTRL_CPUPWRSTATUS_CPUHP_Pos    (3UL)                     /*!< CPUHP (Bit 3)                                         */
#define PWRCTRL_CPUPWRSTATUS_CPUHP_Msk    (0x8UL)                   /*!< CPUHP (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_CPUPWRSTATUS_CPULP_Pos    (2UL)                     /*!< CPULP (Bit 2)                                         */
#define PWRCTRL_CPUPWRSTATUS_CPULP_Msk    (0x4UL)                   /*!< CPULP (Bitfield-Mask: 0x01)                           */
#define PWRCTRL_CPUPWRSTATUS_CPUAMBIQSLEEP_Pos (1UL)                /*!< CPUAMBIQSLEEP (Bit 1)                                 */
#define PWRCTRL_CPUPWRSTATUS_CPUAMBIQSLEEP_Msk (0x2UL)              /*!< CPUAMBIQSLEEP (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_CPUPWRSTATUS_CPUARMSLEEP_Pos (0UL)                  /*!< CPUARMSLEEP (Bit 0)                                   */
#define PWRCTRL_CPUPWRSTATUS_CPUARMSLEEP_Msk (0x1UL)                /*!< CPUARMSLEEP (Bitfield-Mask: 0x01)                     */
/* =======================================================  PWRACKOVR  ======================================================= */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPLL_Pos (26UL)              /*!< PWRACKOVERRIDEPLL (Bit 26)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPLL_Msk (0x4000000UL)       /*!< PWRACKOVERRIDEPLL (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESYS_Pos (25UL)              /*!< PWRACKOVERRIDESYS (Bit 25)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESYS_Msk (0x2000000UL)       /*!< PWRACKOVERRIDESYS (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEI3CPHY_Pos (24UL)           /*!< PWRACKOVERRIDEI3CPHY (Bit 24)                         */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEI3CPHY_Msk (0x1000000UL)    /*!< PWRACKOVERRIDEI3CPHY (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDENETAOL_Pos (23UL)           /*!< PWRACKOVERRIDENETAOL (Bit 23)                         */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDENETAOL_Msk (0x800000UL)     /*!< PWRACKOVERRIDENETAOL (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_Pos (22UL)          /*!< PWRACKOVERRIDEDISPPHY (Bit 22)                        */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISPPHY_Msk (0x400000UL)    /*!< PWRACKOVERRIDEDISPPHY (Bitfield-Mask: 0x01)           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_Pos (21UL)             /*!< PWRACKOVERRIDEDISP (Bit 21)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDISP_Msk (0x200000UL)       /*!< PWRACKOVERRIDEDISP (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Pos (20UL)            /*!< PWRACKOVERRIDEMSPI2 (Bit 20)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI2_Msk (0x100000UL)      /*!< PWRACKOVERRIDEMSPI2 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Pos (19UL)            /*!< PWRACKOVERRIDEMSPI1 (Bit 19)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI1_Msk (0x80000UL)       /*!< PWRACKOVERRIDEMSPI1 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Pos (18UL)             /*!< PWRACKOVERRIDEMSPI (Bit 18)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMSPI_Msk (0x40000UL)        /*!< PWRACKOVERRIDEMSPI (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Pos (17UL)              /*!< PWRACKOVERRIDEROM (Bit 17)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEROM_Msk (0x20000UL)         /*!< PWRACKOVERRIDEROM (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_Pos (16UL)             /*!< PWRACKOVERRIDEMCUE (Bit 16)                           */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUE_Msk (0x10000UL)        /*!< PWRACKOVERRIDEMCUE (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_Pos (15UL)              /*!< PWRACKOVERRIDEOTP (Bit 15)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEOTP_Msk (0x8000UL)          /*!< PWRACKOVERRIDEOTP (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO1_Pos (14UL)            /*!< PWRACKOVERRIDESDIO1 (Bit 14)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO1_Msk (0x4000UL)        /*!< PWRACKOVERRIDESDIO1 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPDM_Pos (13UL)              /*!< PWRACKOVERRIDEPDM (Bit 13)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEPDM_Msk (0x2000UL)          /*!< PWRACKOVERRIDEPDM (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSBPHY_Pos (12UL)           /*!< PWRACKOVERRIDEUSBPHY (Bit 12)                         */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSBPHY_Msk (0x1000UL)       /*!< PWRACKOVERRIDEUSBPHY (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSB_Pos (11UL)              /*!< PWRACKOVERRIDEUSB (Bit 11)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEUSB_Msk (0x800UL)           /*!< PWRACKOVERRIDEUSB (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO0_Pos (10UL)            /*!< PWRACKOVERRIDESDIO0 (Bit 10)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDESDIO0_Msk (0x400UL)         /*!< PWRACKOVERRIDESDIO0 (Bitfield-Mask: 0x01)             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUL_Pos (9UL)              /*!< PWRACKOVERRIDEMCUL (Bit 9)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEMCUL_Msk (0x200UL)          /*!< PWRACKOVERRIDEMCUL (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEIOS_Pos (8UL)               /*!< PWRACKOVERRIDEIOS (Bit 8)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEIOS_Msk (0x100UL)           /*!< PWRACKOVERRIDEIOS (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPC_Pos (7UL)              /*!< PWRACKOVERRIDEHCPC (Bit 7)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPC_Msk (0x80UL)           /*!< PWRACKOVERRIDEHCPC (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_Pos (6UL)              /*!< PWRACKOVERRIDEHCPB (Bit 6)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPB_Msk (0x40UL)           /*!< PWRACKOVERRIDEHCPB (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_Pos (5UL)              /*!< PWRACKOVERRIDEHCPA (Bit 5)                            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEHCPA_Msk (0x20UL)           /*!< PWRACKOVERRIDEHCPA (Bitfield-Mask: 0x01)              */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_Pos (4UL)               /*!< PWRACKOVERRIDEGFX (Bit 4)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEGFX_Msk (0x10UL)            /*!< PWRACKOVERRIDEGFX (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_Pos (3UL)               /*!< PWRACKOVERRIDEDBG (Bit 3)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEDBG_Msk (0x8UL)             /*!< PWRACKOVERRIDEDBG (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_Pos (2UL)            /*!< PWRACKOVERRIDECRYPTO (Bit 2)                          */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDECRYPTO_Msk (0x4UL)          /*!< PWRACKOVERRIDECRYPTO (Bitfield-Mask: 0x01)            */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Pos (1UL)               /*!< PWRACKOVERRIDEAUD (Bit 1)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEAUD_Msk (0x2UL)             /*!< PWRACKOVERRIDEAUD (Bitfield-Mask: 0x01)               */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Pos (0UL)               /*!< PWRACKOVERRIDEADC (Bit 0)                             */
#define PWRCTRL_PWRACKOVR_PWRACKOVERRIDEADC_Msk (0x1UL)             /*!< PWRACKOVERRIDEADC (Bitfield-Mask: 0x01)               */
/* =====================================================  PWRCNTDEFVAL  ====================================================== */
#define PWRCTRL_PWRCNTDEFVAL_PWRACKWAITDELSIMOSTMC_Pos (6UL)        /*!< PWRACKWAITDELSIMOSTMC (Bit 6)                         */
#define PWRCTRL_PWRCNTDEFVAL_PWRACKWAITDELSIMOSTMC_Msk (0xffc0UL)   /*!< PWRACKWAITDELSIMOSTMC (Bitfield-Mask: 0x3ff)          */
#define PWRCTRL_PWRCNTDEFVAL_PWRDEFVALDEVSTMC_Pos (0UL)             /*!< PWRDEFVALDEVSTMC (Bit 0)                              */
#define PWRCTRL_PWRCNTDEFVAL_PWRDEFVALDEVSTMC_Msk (0x3fUL)          /*!< PWRDEFVALDEVSTMC (Bitfield-Mask: 0x3f)                */
/* =======================================================  EPURETCFG  ======================================================= */
#define PWRCTRL_EPURETCFG_EPURETSLP_Pos   (0UL)                     /*!< EPURETSLP (Bit 0)                                     */
#define PWRCTRL_EPURETCFG_EPURETSLP_Msk   (0x1UL)                   /*!< EPURETSLP (Bitfield-Mask: 0x01)                       */
/* ======================================================  CM4PWRCTRL  ======================================================= */
#define PWRCTRL_CM4PWRCTRL_CM4POWERONREQ_Pos (0UL)                  /*!< CM4POWERONREQ (Bit 0)                                 */
#define PWRCTRL_CM4PWRCTRL_CM4POWERONREQ_Msk (0x1UL)                /*!< CM4POWERONREQ (Bitfield-Mask: 0x01)                   */
/* ======================================================  CM4PWRSTATE  ====================================================== */
#define PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_Pos (0UL)                  /*!< CM4PWRSTATUS (Bit 0)                                  */
#define PWRCTRL_CM4PWRSTATE_CM4PWRSTATUS_Msk (0x3UL)                /*!< CM4PWRSTATUS (Bitfield-Mask: 0x03)                    */
/* ========================================================  VRCTRL  ========================================================= */
#define PWRCTRL_VRCTRL_SIMOBUCKEN_Pos     (0UL)                     /*!< SIMOBUCKEN (Bit 0)                                    */
#define PWRCTRL_VRCTRL_SIMOBUCKEN_Msk     (0x1UL)                   /*!< SIMOBUCKEN (Bitfield-Mask: 0x01)                      */
/* =====================================================  LEGACYVRLPOVR  ===================================================== */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISPPHY_Pos (23UL)              /*!< IGNOREDISPPHY (Bit 23)                                */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISPPHY_Msk (0x800000UL)        /*!< IGNOREDISPPHY (Bitfield-Mask: 0x01)                   */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISP_Pos (22UL)                 /*!< IGNOREDISP (Bit 22)                                   */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREDISP_Msk (0x400000UL)           /*!< IGNOREDISP (Bitfield-Mask: 0x01)                      */
#define PWRCTRL_LEGACYVRLPOVR_IGNORENETAOL_Pos (21UL)               /*!< IGNORENETAOL (Bit 21)                                 */
#define PWRCTRL_LEGACYVRLPOVR_IGNORENETAOL_Msk (0x200000UL)         /*!< IGNORENETAOL (Bitfield-Mask: 0x01)                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREPDM_Pos (20UL)                  /*!< IGNOREPDM (Bit 20)                                    */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREPDM_Msk (0x100000UL)            /*!< IGNOREPDM (Bitfield-Mask: 0x01)                       */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI2_Pos (19UL)                /*!< IGNOREMSPI2 (Bit 19)                                  */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI2_Msk (0x80000UL)           /*!< IGNOREMSPI2 (Bitfield-Mask: 0x01)                     */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI1_Pos (18UL)                /*!< IGNOREMSPI1 (Bit 18)                                  */
#define PWRCTRL_LEGACYVRLPOVR_IGNOREMSPI1_Msk (0x40000UL)           /*!< IGNOREMSPI1 (Bitfield-Mask: 0x01)                     */
