AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==========================================================  CFG  ========================================================== */
#define RSTGEN_CFG_SECUREWDREN_Pos        (2UL)                     /*!< SECUREWDREN (Bit 2)                                   */
#define RSTGEN_CFG_SECUREWDREN_Msk        (0x4UL)                   /*!< SECUREWDREN (Bitfield-Mask: 0x01)                     */
#define RSTGEN_CFG_WDREN_Pos              (1UL)                     /*!< WDREN (Bit 1)                                         */
#define RSTGEN_CFG_WDREN_Msk              (0x2UL)                   /*!< WDREN (Bitfield-Mask: 0x01)                           */
#define RSTGEN_CFG_BODHREN_Pos            (0UL)                     /*!< BODHREN (Bit 0)                                       */
#define RSTGEN_CFG_BODHREN_Msk            (0x1UL)                   /*!< BODHREN (Bitfield-Mask: 0x01)                         */
/* =========================================================  SWPOI  ========================================================= */
#define RSTGEN_SWPOI_SWPOIKEY_Pos         (0UL)                     /*!< SWPOIKEY (Bit 0)                                      */
#define RSTGEN_SWPOI_SWPOIKEY_Msk         (0xffUL)                  /*!< SWPOIKEY (Bitfield-Mask: 0xff)                        */
/* =========================================================  SWPOR  ========================================================= */
#define RSTGEN_SWPOR_SWPORKEY_Pos         (0UL)                     /*!< SWPORKEY (Bit 0)                                      */
#define RSTGEN_SWPOR_SWPORKEY_Msk         (0xffUL)                  /*!< SWPORKEY (Bitfield-Mask: 0xff)                        */
/* =======================================================  SIMOBODM  ======================================================== */
#define RSTGEN_SIMOBODM_DIGBOERF_Pos      (4UL)                     /*!< DIGBOERF (Bit 4)                                      */
#define RSTGEN_SIMOBODM_DIGBOERF_Msk      (0x10UL)                  /*!< DIGBOERF (Bitfield-Mask: 0x01)                        */
#define RSTGEN_SIMOBODM_DIGBOECLV_Pos     (3UL)                     /*!< DIGBOECLV (Bit 3)                                     */
#define RSTGEN_SIMOBODM_DIGBOECLV_Msk     (0x8UL)                   /*!< DIGBOECLV (Bitfield-Mask: 0x01)                       */
#define RSTGEN_SIMOBODM_DIGBOES_Pos       (2UL)                     /*!< DIGBOES (Bit 2)                                       */
#define RSTGEN_SIMOBODM_DIGBOES_Msk       (0x4UL)                   /*!< DIGBOES (Bitfield-Mask: 0x01)                         */
#define RSTGEN_SIMOBODM_DIGBOEF_Pos       (1UL)                     /*!< DIGBOEF (Bit 1)                                       */
#define RSTGEN_SIMOBODM_DIGBOEF_Msk       (0x2UL)                   /*!< DIGBOEF (Bitfield-Mask: 0x01)                         */
#define RSTGEN_SIMOBODM_DIGBOEC_Pos       (0UL)                     /*!< DIGBOEC (Bit 0)                                       */
#define RSTGEN_SIMOBODM_DIGBOEC_Msk       (0x1UL)                   /*!< DIGBOEC (Bitfield-Mask: 0x01)                         */
/* ========================================================  SWRESET  ======================================================== */
#define RSTGEN_SWRESET_RSVD4_Pos          (4UL)                     /*!< RSVD4 (Bit 4)                                         */
#define RSTGEN_SWRESET_RSVD4_Msk          (0x10UL)                  /*!< RSVD4 (Bitfield-Mask: 0x01)                           */
#define RSTGEN_SWRESET_SWRSTTPIU_Pos      (3UL)                     /*!< SWRSTTPIU (Bit 3)                                     */
#define RSTGEN_SWRESET_SWRSTTPIU_Msk      (0x8UL)                   /*!< SWRSTTPIU (Bitfield-Mask: 0x01)                       */
#define RSTGEN_SWRESET_SWRSTEWIC_Pos      (2UL)                     /*!< SWRSTEWIC (Bit 2)                                     */
#define RSTGEN_SWRESET_SWRSTEWIC_Msk      (0x4UL)                   /*!< SWRSTEWIC (Bitfield-Mask: 0x01)                       */
#define RSTGEN_SWRESET_SWRSTIWIC_Pos      (1UL)                     /*!< SWRSTIWIC (Bit 1)                                     */
#define RSTGEN_SWRESET_SWRSTIWIC_Msk      (0x2UL)                   /*!< SWRSTIWIC (Bitfield-Mask: 0x01)                       */
#define RSTGEN_SWRESET_SWRSTDBG_Pos       (0UL)                     /*!< SWRSTDBG (Bit 0)                                      */
#define RSTGEN_SWRESET_SWRSTDBG_Msk       (0x1UL)                   /*!< SWRSTDBG (Bitfield-Mask: 0x01)                        */
/* =========================================================  INTEN  ========================================================= */
#define RSTGEN_INTEN_BODDIGRF_Pos         (5UL)                     /*!< BODDIGRF (Bit 5)                                      */
#define RSTGEN_INTEN_BODDIGRF_Msk         (0x20UL)                  /*!< BODDIGRF (Bitfield-Mask: 0x01)                        */
#define RSTGEN_INTEN_BODDIGCLV_Pos        (4UL)                     /*!< BODDIGCLV (Bit 4)                                     */
#define RSTGEN_INTEN_BODDIGCLV_Msk        (0x10UL)                  /*!< BODDIGCLV (Bitfield-Mask: 0x01)                       */
#define RSTGEN_INTEN_BODDIGS_Pos          (3UL)                     /*!< BODDIGS (Bit 3)                                       */
#define RSTGEN_INTEN_BODDIGS_Msk          (0x8UL)                   /*!< BODDIGS (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTEN_BODDIGF_Pos          (2UL)                     /*!< BODDIGF (Bit 2)                                       */
#define RSTGEN_INTEN_BODDIGF_Msk          (0x4UL)                   /*!< BODDIGF (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTEN_BODDIGC_Pos          (1UL)                     /*!< BODDIGC (Bit 1)                                       */
#define RSTGEN_INTEN_BODDIGC_Msk          (0x2UL)                   /*!< BODDIGC (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTEN_BODH_Pos             (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTEN_BODH_Msk             (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSTAT  ======================================================== */
#define RSTGEN_INTSTAT_BODDIGRF_Pos       (5UL)                     /*!< BODDIGRF (Bit 5)                                      */
#define RSTGEN_INTSTAT_BODDIGRF_Msk       (0x20UL)                  /*!< BODDIGRF (Bitfield-Mask: 0x01)                        */
#define RSTGEN_INTSTAT_BODDIGCLV_Pos      (4UL)                     /*!< BODDIGCLV (Bit 4)                                     */
#define RSTGEN_INTSTAT_BODDIGCLV_Msk      (0x10UL)                  /*!< BODDIGCLV (Bitfield-Mask: 0x01)                       */
#define RSTGEN_INTSTAT_BODDIGS_Pos        (3UL)                     /*!< BODDIGS (Bit 3)                                       */
#define RSTGEN_INTSTAT_BODDIGS_Msk        (0x8UL)                   /*!< BODDIGS (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSTAT_BODDIGF_Pos        (2UL)                     /*!< BODDIGF (Bit 2)                                       */
#define RSTGEN_INTSTAT_BODDIGF_Msk        (0x4UL)                   /*!< BODDIGF (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSTAT_BODDIGC_Pos        (1UL)                     /*!< BODDIGC (Bit 1)                                       */
#define RSTGEN_INTSTAT_BODDIGC_Msk        (0x2UL)                   /*!< BODDIGC (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSTAT_BODH_Pos           (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTSTAT_BODH_Msk           (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTCLR  ========================================================= */
#define RSTGEN_INTCLR_BODDIGRF_Pos        (5UL)                     /*!< BODDIGRF (Bit 5)                                      */
#define RSTGEN_INTCLR_BODDIGRF_Msk        (0x20UL)                  /*!< BODDIGRF (Bitfield-Mask: 0x01)                        */
#define RSTGEN_INTCLR_BODDIGCLV_Pos       (4UL)                     /*!< BODDIGCLV (Bit 4)                                     */
#define RSTGEN_INTCLR_BODDIGCLV_Msk       (0x10UL)                  /*!< BODDIGCLV (Bitfield-Mask: 0x01)                       */
#define RSTGEN_INTCLR_BODDIGS_Pos         (3UL)                     /*!< BODDIGS (Bit 3)                                       */
#define RSTGEN_INTCLR_BODDIGS_Msk         (0x8UL)                   /*!< BODDIGS (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTCLR_BODDIGF_Pos         (2UL)                     /*!< BODDIGF (Bit 2)                                       */
#define RSTGEN_INTCLR_BODDIGF_Msk         (0x4UL)                   /*!< BODDIGF (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTCLR_BODDIGC_Pos         (1UL)                     /*!< BODDIGC (Bit 1)                                       */
#define RSTGEN_INTCLR_BODDIGC_Msk         (0x2UL)                   /*!< BODDIGC (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTCLR_BODH_Pos            (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTCLR_BODH_Msk            (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* ========================================================  INTSET  ========================================================= */
#define RSTGEN_INTSET_BODDIGRF_Pos        (5UL)                     /*!< BODDIGRF (Bit 5)                                      */
#define RSTGEN_INTSET_BODDIGRF_Msk        (0x20UL)                  /*!< BODDIGRF (Bitfield-Mask: 0x01)                        */
#define RSTGEN_INTSET_BODDIGCLV_Pos       (4UL)                     /*!< BODDIGCLV (Bit 4)                                     */
#define RSTGEN_INTSET_BODDIGCLV_Msk       (0x10UL)                  /*!< BODDIGCLV (Bitfield-Mask: 0x01)                       */
#define RSTGEN_INTSET_BODDIGS_Pos         (3UL)                     /*!< BODDIGS (Bit 3)                                       */
#define RSTGEN_INTSET_BODDIGS_Msk         (0x8UL)                   /*!< BODDIGS (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSET_BODDIGF_Pos         (2UL)                     /*!< BODDIGF (Bit 2)                                       */
#define RSTGEN_INTSET_BODDIGF_Msk         (0x4UL)                   /*!< BODDIGF (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSET_BODDIGC_Pos         (1UL)                     /*!< BODDIGC (Bit 1)                                       */
#define RSTGEN_INTSET_BODDIGC_Msk         (0x2UL)                   /*!< BODDIGC (Bitfield-Mask: 0x01)                         */
#define RSTGEN_INTSET_BODH_Pos            (0UL)                     /*!< BODH (Bit 0)                                          */
#define RSTGEN_INTSET_BODH_Msk            (0x1UL)                   /*!< BODH (Bitfield-Mask: 0x01)                            */
/* =========================================================  STAT  ========================================================== */
#define RSTGEN_STAT_SBLRCVYSUCCESS_Pos    (31UL)                    /*!< SBLRCVYSUCCESS (Bit 31)                               */
#define RSTGEN_STAT_SBLRCVYSUCCESS_Msk    (0x80000000UL)            /*!< SBLRCVYSUCCESS (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_SBLRCVYFAIL_Pos       (30UL)                    /*!< SBLRCVYFAIL (Bit 30)                                  */
#define RSTGEN_STAT_SBLRCVYFAIL_Msk       (0x40000000UL)            /*!< SBLRCVYFAIL (Bitfield-Mask: 0x01)                     */
#define RSTGEN_STAT_OEMRCVYSUCCESS_Pos    (29UL)                    /*!< OEMRCVYSUCCESS (Bit 29)                               */
#define RSTGEN_STAT_OEMRCVYSUCCESS_Msk    (0x20000000UL)            /*!< OEMRCVYSUCCESS (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_OEMRCVYFAIL_Pos       (28UL)                    /*!< OEMRCVYFAIL (Bit 28)                                  */
#define RSTGEN_STAT_OEMRCVYFAIL_Msk       (0x10000000UL)            /*!< OEMRCVYFAIL (Bitfield-Mask: 0x01)                     */
#define RSTGEN_STAT_OEMNVIMAGELOAD_Pos    (27UL)                    /*!< OEMNVIMAGELOAD (Bit 27)                               */
#define RSTGEN_STAT_OEMNVIMAGELOAD_Msk    (0x8000000UL)             /*!< OEMNVIMAGELOAD (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_OEMNVOTA_Pos          (26UL)                    /*!< OEMNVOTA (Bit 26)                                     */
#define RSTGEN_STAT_OEMNVOTA_Msk          (0x4000000UL)             /*!< OEMNVOTA (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_OEMWIREDLOAD_Pos      (25UL)                    /*!< OEMWIREDLOAD (Bit 25)                                 */
#define RSTGEN_STAT_OEMWIREDLOAD_Msk      (0x2000000UL)             /*!< OEMWIREDLOAD (Bitfield-Mask: 0x01)                    */
#define RSTGEN_STAT_OEMWIREDOTA_Pos       (24UL)                    /*!< OEMWIREDOTA (Bit 24)                                  */
#define RSTGEN_STAT_OEMWIREDOTA_Msk       (0x1000000UL)             /*!< OEMWIREDOTA (Bitfield-Mask: 0x01)                     */
#define RSTGEN_STAT_SBLNVIMAGELOAD_Pos    (23UL)                    /*!< SBLNVIMAGELOAD (Bit 23)                               */
#define RSTGEN_STAT_SBLNVIMAGELOAD_Msk    (0x800000UL)              /*!< SBLNVIMAGELOAD (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_SBLNVOTA_Pos          (22UL)                    /*!< SBLNVOTA (Bit 22)                                     */
#define RSTGEN_STAT_SBLNVOTA_Msk          (0x400000UL)              /*!< SBLNVOTA (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_SBLWIREDLOAD_Pos      (21UL)                    /*!< SBLWIREDLOAD (Bit 21)                                 */
#define RSTGEN_STAT_SBLWIREDLOAD_Msk      (0x200000UL)              /*!< SBLWIREDLOAD (Bitfield-Mask: 0x01)                    */
#define RSTGEN_STAT_SBLWIREDOTA_Pos       (20UL)                    /*!< SBLWIREDOTA (Bit 20)                                  */
#define RSTGEN_STAT_SBLWIREDOTA_Msk       (0x100000UL)              /*!< SBLWIREDOTA (Bitfield-Mask: 0x01)                     */
#define RSTGEN_STAT_RCVYINITIATED_Pos     (18UL)                    /*!< RCVYINITIATED (Bit 18)                                */
#define RSTGEN_STAT_RCVYINITIATED_Msk     (0xc0000UL)               /*!< RCVYINITIATED (Bitfield-Mask: 0x03)                   */
#define RSTGEN_STAT_RCVYSPILOAD_Pos       (17UL)                    /*!< RCVYSPILOAD (Bit 17)                                  */
#define RSTGEN_STAT_RCVYSPILOAD_Msk       (0x20000UL)               /*!< RCVYSPILOAD (Bitfield-Mask: 0x01)                     */
#define RSTGEN_STAT_RCVYUARTLOAD_Pos      (16UL)                    /*!< RCVYUARTLOAD (Bit 16)                                 */
#define RSTGEN_STAT_RCVYUARTLOAD_Msk      (0x10000UL)               /*!< RCVYUARTLOAD (Bitfield-Mask: 0x01)                    */
#define RSTGEN_STAT_RCVYINPROGRESS_Pos    (15UL)                    /*!< RCVYINPROGRESS (Bit 15)                               */
#define RSTGEN_STAT_RCVYINPROGRESS_Msk    (0x8000UL)                /*!< RCVYINPROGRESS (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_CM4TIMEOUTSTAT_Pos    (14UL)                    /*!< CM4TIMEOUTSTAT (Bit 14)                               */
#define RSTGEN_STAT_CM4TIMEOUTSTAT_Msk    (0x4000UL)                /*!< CM4TIMEOUTSTAT (Bitfield-Mask: 0x01)                  */
#define RSTGEN_STAT_SECUREWDRSTAT_Pos     (13UL)                    /*!< SECUREWDRSTAT (Bit 13)                                */
#define RSTGEN_STAT_SECUREWDRSTAT_Msk     (0x2000UL)                /*!< SECUREWDRSTAT (Bitfield-Mask: 0x01)                   */
#define RSTGEN_STAT_AIRCRSTAT_Pos         (12UL)                    /*!< AIRCRSTAT (Bit 12)                                    */
#define RSTGEN_STAT_AIRCRSTAT_Msk         (0x1000UL)                /*!< AIRCRSTAT (Bitfield-Mask: 0x01)                       */
#define RSTGEN_STAT_BOSSTAT_Pos           (10UL)                    /*!< BOSSTAT (Bit 10)                                      */
#define RSTGEN_STAT_BOSSTAT_Msk           (0x400UL)                 /*!< BOSSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_BOFSTAT_Pos           (9UL)                     /*!< BOFSTAT (Bit 9)                                       */
#define RSTGEN_STAT_BOFSTAT_Msk           (0x200UL)                 /*!< BOFSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_BOCSTAT_Pos           (8UL)                     /*!< BOCSTAT (Bit 8)                                       */
#define RSTGEN_STAT_BOCSTAT_Msk           (0x100UL)                 /*!< BOCSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_BOUSTAT_Pos           (7UL)                     /*!< BOUSTAT (Bit 7)                                       */
#define RSTGEN_STAT_BOUSTAT_Msk           (0x80UL)                  /*!< BOUSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_WDRSTAT_Pos           (6UL)                     /*!< WDRSTAT (Bit 6)                                       */
#define RSTGEN_STAT_WDRSTAT_Msk           (0x40UL)                  /*!< WDRSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_DBGRSTAT_Pos          (5UL)                     /*!< DBGRSTAT (Bit 5)                                      */
#define RSTGEN_STAT_DBGRSTAT_Msk          (0x20UL)                  /*!< DBGRSTAT (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_POIRSTAT_Pos          (4UL)                     /*!< POIRSTAT (Bit 4)                                      */
#define RSTGEN_STAT_POIRSTAT_Msk          (0x10UL)                  /*!< POIRSTAT (Bitfield-Mask: 0x01)                        */
#define RSTGEN_STAT_SWRSTAT_Pos           (3UL)                     /*!< SWRSTAT (Bit 3)                                       */
#define RSTGEN_STAT_SWRSTAT_Msk           (0x8UL)                   /*!< SWRSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_BORSTAT_Pos           (2UL)                     /*!< BORSTAT (Bit 2)                                       */
#define RSTGEN_STAT_BORSTAT_Msk           (0x4UL)                   /*!< BORSTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_POASTAT_Pos           (1UL)                     /*!< POASTAT (Bit 1)                                       */
#define RSTGEN_STAT_POASTAT_Msk           (0x2UL)                   /*!< POASTAT (Bitfield-Mask: 0x01)                         */
#define RSTGEN_STAT_EXRSTAT_Pos           (0UL)                     /*!< EXRSTAT (Bit 0)                                       */
#define RSTGEN_STAT_EXRSTAT_Msk           (0x1UL)                   /*!< EXRSTAT (Bitfield-Mask: 0x01)                         */


/* =========================================================================================================================== */
/* ================                                            RTC                                            ================ */
/* =========================================================================================================================== */

