AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================================  RTCCTL  ========================================================= */
#define RTC_RTCCTL_HR1224_Pos             (5UL)                     /*!< HR1224 (Bit 5)                                        */
#define RTC_RTCCTL_HR1224_Msk             (0x20UL)                  /*!< HR1224 (Bitfield-Mask: 0x01)                          */
#define RTC_RTCCTL_RSTOP_Pos              (4UL)                     /*!< RSTOP (Bit 4)                                         */
#define RTC_RTCCTL_RSTOP_Msk              (0x10UL)                  /*!< RSTOP (Bitfield-Mask: 0x01)                           */
#define RTC_RTCCTL_RPT_Pos                (1UL)                     /*!< RPT (Bit 1)                                           */
#define RTC_RTCCTL_RPT_Msk                (0xeUL)                   /*!< RPT (Bitfield-Mask: 0x07)                             */
#define RTC_RTCCTL_WRTC_Pos               (0UL)                     /*!< WRTC (Bit 0)                                          */
#define RTC_RTCCTL_WRTC_Msk               (0x1UL)                   /*!< WRTC (Bitfield-Mask: 0x01)                            */
/* ========================================================  RTCSTAT  ======================================================== */
#define RTC_RTCSTAT_WRITEBUSY_Pos         (0UL)                     /*!< WRITEBUSY (Bit 0)                                     */
#define RTC_RTCSTAT_WRITEBUSY_Msk         (0x1UL)                   /*!< WRITEBUSY (Bitfield-Mask: 0x01)                       */
/* ========================================================  CTRLOW  ========================================================= */
#define RTC_CTRLOW_CTRHR_Pos              (24UL)                    /*!< CTRHR (Bit 24)                                        */
#define RTC_CTRLOW_CTRHR_Msk              (0x3f000000UL)            /*!< CTRHR (Bitfield-Mask: 0x3f)                           */
#define RTC_CTRLOW_CTRMIN_Pos             (16UL)                    /*!< CTRMIN (Bit 16)                                       */
#define RTC_CTRLOW_CTRMIN_Msk             (0x7f0000UL)              /*!< CTRMIN (Bitfield-Mask: 0x7f)                          */
#define RTC_CTRLOW_CTRSEC_Pos             (8UL)                     /*!< CTRSEC (Bit 8)                                        */
#define RTC_CTRLOW_CTRSEC_Msk             (0x7f00UL)                /*!< CTRSEC (Bitfield-Mask: 0x7f)                          */
#define RTC_CTRLOW_CTR100_Pos             (0UL)                     /*!< CTR100 (Bit 0)                                        */
#define RTC_CTRLOW_CTR100_Msk             (0xffUL)                  /*!< CTR100 (Bitfield-Mask: 0xff)                          */
/* =========================================================  CTRUP  ========================================================= */
#define RTC_CTRUP_CTERR_Pos               (31UL)                    /*!< CTERR (Bit 31)                                        */
#define RTC_CTRUP_CTERR_Msk               (0x80000000UL)            /*!< CTERR (Bitfield-Mask: 0x01)                           */
#define RTC_CTRUP_CEB_Pos                 (29UL)                    /*!< CEB (Bit 29)                                          */
#define RTC_CTRUP_CEB_Msk                 (0x20000000UL)            /*!< CEB (Bitfield-Mask: 0x01)                             */
#define RTC_CTRUP_CB_Pos                  (28UL)                    /*!< CB (Bit 28)                                           */
#define RTC_CTRUP_CB_Msk                  (0x10000000UL)            /*!< CB (Bitfield-Mask: 0x01)                              */
#define RTC_CTRUP_CTRWKDY_Pos             (24UL)                    /*!< CTRWKDY (Bit 24)                                      */
#define RTC_CTRUP_CTRWKDY_Msk             (0x7000000UL)             /*!< CTRWKDY (Bitfield-Mask: 0x07)                         */
#define RTC_CTRUP_CTRYR_Pos               (16UL)                    /*!< CTRYR (Bit 16)                                        */
#define RTC_CTRUP_CTRYR_Msk               (0xff0000UL)              /*!< CTRYR (Bitfield-Mask: 0xff)                           */
#define RTC_CTRUP_CTRMO_Pos               (8UL)                     /*!< CTRMO (Bit 8)                                         */
#define RTC_CTRUP_CTRMO_Msk               (0x1f00UL)                /*!< CTRMO (Bitfield-Mask: 0x1f)                           */
#define RTC_CTRUP_CTRDATE_Pos             (0UL)                     /*!< CTRDATE (Bit 0)                                       */
#define RTC_CTRUP_CTRDATE_Msk             (0x3fUL)                  /*!< CTRDATE (Bitfield-Mask: 0x3f)                         */
/* ========================================================  ALMLOW  ========================================================= */
#define RTC_ALMLOW_ALMHR_Pos              (24UL)                    /*!< ALMHR (Bit 24)                                        */
#define RTC_ALMLOW_ALMHR_Msk              (0x3f000000UL)            /*!< ALMHR (Bitfield-Mask: 0x3f)                           */
#define RTC_ALMLOW_ALMMIN_Pos             (16UL)                    /*!< ALMMIN (Bit 16)                                       */
#define RTC_ALMLOW_ALMMIN_Msk             (0x7f0000UL)              /*!< ALMMIN (Bitfield-Mask: 0x7f)                          */
#define RTC_ALMLOW_ALMSEC_Pos             (8UL)                     /*!< ALMSEC (Bit 8)                                        */
#define RTC_ALMLOW_ALMSEC_Msk             (0x7f00UL)                /*!< ALMSEC (Bitfield-Mask: 0x7f)                          */
#define RTC_ALMLOW_ALM100_Pos             (0UL)                     /*!< ALM100 (Bit 0)                                        */
#define RTC_ALMLOW_ALM100_Msk             (0xffUL)                  /*!< ALM100 (Bitfield-Mask: 0xff)                          */
/* =========================================================  ALMUP  ========================================================= */
#define RTC_ALMUP_ALMWKDY_Pos             (16UL)                    /*!< ALMWKDY (Bit 16)                                      */
#define RTC_ALMUP_ALMWKDY_Msk             (0x70000UL)               /*!< ALMWKDY (Bitfield-Mask: 0x07)                         */
#define RTC_ALMUP_ALMMO_Pos               (8UL)                     /*!< ALMMO (Bit 8)                                         */
#define RTC_ALMUP_ALMMO_Msk               (0x1f00UL)                /*!< ALMMO (Bitfield-Mask: 0x1f)                           */
#define RTC_ALMUP_ALMDATE_Pos             (0UL)                     /*!< ALMDATE (Bit 0)                                       */
#define RTC_ALMUP_ALMDATE_Msk             (0x3fUL)                  /*!< ALMDATE (Bitfield-Mask: 0x3f)                         */
/* =========================================================  INTEN  ========================================================= */
#define RTC_INTEN_ALM_Pos                 (0UL)                     /*!< ALM (Bit 0)                                           */
#define RTC_INTEN_ALM_Msk                 (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSTAT  ======================================================== */
#define RTC_INTSTAT_ALM_Pos               (0UL)                     /*!< ALM (Bit 0)                                           */
#define RTC_INTSTAT_ALM_Msk               (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTCLR  ========================================================= */
#define RTC_INTCLR_ALM_Pos                (0UL)                     /*!< ALM (Bit 0)                                           */
#define RTC_INTCLR_ALM_Msk                (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */
/* ========================================================  INTSET  ========================================================= */
#define RTC_INTSET_ALM_Pos                (0UL)                     /*!< ALM (Bit 0)                                           */
#define RTC_INTSET_ALM_Msk                (0x1UL)                   /*!< ALM (Bitfield-Mask: 0x01)                             */


/* =========================================================================================================================== */
/* ================                                            SCM                                            ================ */
/* =========================================================================================================================== */

/* =====================================================  SCMCNTRCTRL1  ====================================================== */
#define SCM_SCMCNTRCTRL1_CLKDIV_Pos       (4UL)                     /*!< CLKDIV (Bit 4)                                        */
#define SCM_SCMCNTRCTRL1_CLKDIV_Msk       (0x1f0UL)                 /*!< CLKDIV (Bitfield-Mask: 0x1f)                          */
#define SCM_SCMCNTRCTRL1_FORCELP_Pos      (3UL)                     /*!< FORCELP (Bit 3)                                       */
#define SCM_SCMCNTRCTRL1_FORCELP_Msk      (0x8UL)                   /*!< FORCELP (Bitfield-Mask: 0x01)                         */
#define SCM_SCMCNTRCTRL1_SCMMODESEL_Pos   (1UL)                     /*!< SCMMODESEL (Bit 1)                                    */
#define SCM_SCMCNTRCTRL1_SCMMODESEL_Msk   (0x6UL)                   /*!< SCMMODESEL (Bitfield-Mask: 0x03)                      */
#define SCM_SCMCNTRCTRL1_ENABLESCM_Pos    (0UL)                     /*!< ENABLESCM (Bit 0)                                     */
#define SCM_SCMCNTRCTRL1_ENABLESCM_Msk    (0x1UL)                   /*!< ENABLESCM (Bitfield-Mask: 0x01)                       */
/* =====================================================  SCMCNTRCTRL2  ====================================================== */
#define SCM_SCMCNTRCTRL2_FCNT2_Pos        (16UL)                    /*!< FCNT2 (Bit 16)                                        */
#define SCM_SCMCNTRCTRL2_FCNT2_Msk        (0xffff0000UL)            /*!< FCNT2 (Bitfield-Mask: 0xffff)                         */
#define SCM_SCMCNTRCTRL2_FCNT1_Pos        (0UL)                     /*!< FCNT1 (Bit 0)                                         */
#define SCM_SCMCNTRCTRL2_FCNT1_Msk        (0xffffUL)                /*!< FCNT1 (Bitfield-Mask: 0xffff)                         */
/* =====================================================  LPTHRESHVDDS  ====================================================== */
#define SCM_LPTHRESHVDDS_LPTHRESHVDDS_Pos (0UL)                     /*!< LPTHRESHVDDS (Bit 0)                                  */
#define SCM_LPTHRESHVDDS_LPTHRESHVDDS_Msk (0xfffffUL)               /*!< LPTHRESHVDDS (Bitfield-Mask: 0xfffff)                 */
/* =====================================================  LPTHRESHVDDF  ====================================================== */
#define SCM_LPTHRESHVDDF_LPTHRESHVDDF_Pos (0UL)                     /*!< LPTHRESHVDDF (Bit 0)                                  */
#define SCM_LPTHRESHVDDF_LPTHRESHVDDF_Msk (0xfffffUL)               /*!< LPTHRESHVDDF (Bitfield-Mask: 0xfffff)                 */
/* =====================================================  LPTHRESHVDDC  ====================================================== */
#define SCM_LPTHRESHVDDC_LPTHRESHVDDC_Pos (0UL)                     /*!< LPTHRESHVDDC (Bit 0)                                  */
#define SCM_LPTHRESHVDDC_LPTHRESHVDDC_Msk (0xfffffUL)               /*!< LPTHRESHVDDC (Bitfield-Mask: 0xfffff)                 */
/* ====================================================  LPTHRESHVDDCLV  ===================================================== */
#define SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Pos (0UL)                 /*!< LPTHRESHVDDCLV (Bit 0)                                */
#define SCM_LPTHRESHVDDCLV_LPTHRESHVDDCLV_Msk (0xfffffUL)           /*!< LPTHRESHVDDCLV (Bitfield-Mask: 0xfffff)               */
/* =====================================================  LPTHRESHVDDRF  ===================================================== */
#define SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Pos (0UL)                   /*!< LPTHRESHVDDRF (Bit 0)                                 */
#define SCM_LPTHRESHVDDRF_LPTHRESHVDDRF_Msk (0xfffffUL)             /*!< LPTHRESHVDDRF (Bitfield-Mask: 0xfffff)                */
/* =======================================================  LPHYSTCNT  ======================================================= */
#define SCM_LPHYSTCNT_LPHYSTCNT_Pos       (0UL)                     /*!< LPHYSTCNT (Bit 0)                                     */
#define SCM_LPHYSTCNT_LPHYSTCNT_Msk       (0xfffffUL)               /*!< LPHYSTCNT (Bitfield-Mask: 0xfffff)                    */
/* ======================================================  ACTTHRESH1  ======================================================= */
#define SCM_ACTTHRESH1_ACTTHRESHVDDS_Pos  (16UL)                    /*!< ACTTHRESHVDDS (Bit 16)                                */
#define SCM_ACTTHRESH1_ACTTHRESHVDDS_Msk  (0xffff0000UL)            /*!< ACTTHRESHVDDS (Bitfield-Mask: 0xffff)                 */
#define SCM_ACTTHRESH1_ACTTHRESHVDDF_Pos  (0UL)                     /*!< ACTTHRESHVDDF (Bit 0)                                 */
#define SCM_ACTTHRESH1_ACTTHRESHVDDF_Msk  (0xffffUL)                /*!< ACTTHRESHVDDF (Bitfield-Mask: 0xffff)                 */
/* ======================================================  ACTTHRESH2  ======================================================= */
#define SCM_ACTTHRESH2_ACTTHRESHVDDC_Pos  (16UL)                    /*!< ACTTHRESHVDDC (Bit 16)                                */
#define SCM_ACTTHRESH2_ACTTHRESHVDDC_Msk  (0xffff0000UL)            /*!< ACTTHRESHVDDC (Bitfield-Mask: 0xffff)                 */
#define SCM_ACTTHRESH2_ACTTHRESHVDDCLV_Pos (0UL)                    /*!< ACTTHRESHVDDCLV (Bit 0)                               */
#define SCM_ACTTHRESH2_ACTTHRESHVDDCLV_Msk (0xffffUL)               /*!< ACTTHRESHVDDCLV (Bitfield-Mask: 0xffff)               */
/* ======================================================  ACTTHRESH3  ======================================================= */
#define SCM_ACTTHRESH3_ACTTHRESHVDDRF_Pos (0UL)                     /*!< ACTTHRESHVDDRF (Bit 0)                                */
#define SCM_ACTTHRESH3_ACTTHRESHVDDRF_Msk (0xffffUL)                /*!< ACTTHRESHVDDRF (Bitfield-Mask: 0xffff)                */
/* ========================================================  LPSTAT  ========================================================= */
#define SCM_LPSTAT_GOTOLP_Pos             (2UL)                     /*!< GOTOLP (Bit 2)                                        */
#define SCM_LPSTAT_GOTOLP_Msk             (0x4UL)                   /*!< GOTOLP (Bitfield-Mask: 0x01)                          */
#define SCM_LPSTAT_ACTTRIG_Pos            (1UL)                     /*!< ACTTRIG (Bit 1)                                       */
#define SCM_LPSTAT_ACTTRIG_Msk            (0x2UL)                   /*!< ACTTRIG (Bitfield-Mask: 0x01)                         */
#define SCM_LPSTAT_LPOVRTRIG_Pos          (0UL)                     /*!< LPOVRTRIG (Bit 0)                                     */
#define SCM_LPSTAT_LPOVRTRIG_Msk          (0x1UL)                   /*!< LPOVRTRIG (Bitfield-Mask: 0x01)                       */


/* =========================================================================================================================== */
/* ================                                           SDIO0                                           ================ */
/* =========================================================================================================================== */

