AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
#define SDIO0_INTSTAT_INTA_Msk            (0x200UL)                 /*!< INTA (Bitfield-Mask: 0x01)                            */
#define SDIO0_INTSTAT_CARDINTERRUPT_Pos   (8UL)                     /*!< CARDINTERRUPT (Bit 8)                                 */
#define SDIO0_INTSTAT_CARDINTERRUPT_Msk   (0x100UL)                 /*!< CARDINTERRUPT (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSTAT_CARDREMOVAL_Pos     (7UL)                     /*!< CARDREMOVAL (Bit 7)                                   */
#define SDIO0_INTSTAT_CARDREMOVAL_Msk     (0x80UL)                  /*!< CARDREMOVAL (Bitfield-Mask: 0x01)                     */
#define SDIO0_INTSTAT_CARDINSERTION_Pos   (6UL)                     /*!< CARDINSERTION (Bit 6)                                 */
#define SDIO0_INTSTAT_CARDINSERTION_Msk   (0x40UL)                  /*!< CARDINSERTION (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSTAT_BUFFERREADREADY_Pos (5UL)                     /*!< BUFFERREADREADY (Bit 5)                               */
#define SDIO0_INTSTAT_BUFFERREADREADY_Msk (0x20UL)                  /*!< BUFFERREADREADY (Bitfield-Mask: 0x01)                 */
#define SDIO0_INTSTAT_BUFFERWRITEREADY_Pos (4UL)                    /*!< BUFFERWRITEREADY (Bit 4)                              */
#define SDIO0_INTSTAT_BUFFERWRITEREADY_Msk (0x10UL)                 /*!< BUFFERWRITEREADY (Bitfield-Mask: 0x01)                */
#define SDIO0_INTSTAT_DMAINTERRUPT_Pos    (3UL)                     /*!< DMAINTERRUPT (Bit 3)                                  */
#define SDIO0_INTSTAT_DMAINTERRUPT_Msk    (0x8UL)                   /*!< DMAINTERRUPT (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSTAT_BLOCKGAPEVENT_Pos   (2UL)                     /*!< BLOCKGAPEVENT (Bit 2)                                 */
#define SDIO0_INTSTAT_BLOCKGAPEVENT_Msk   (0x4UL)                   /*!< BLOCKGAPEVENT (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSTAT_TRANSFERCOMPLETE_Pos (1UL)                    /*!< TRANSFERCOMPLETE (Bit 1)                              */
#define SDIO0_INTSTAT_TRANSFERCOMPLETE_Msk (0x2UL)                  /*!< TRANSFERCOMPLETE (Bitfield-Mask: 0x01)                */
#define SDIO0_INTSTAT_COMMANDCOMPLETE_Pos (0UL)                     /*!< COMMANDCOMPLETE (Bit 0)                               */
#define SDIO0_INTSTAT_COMMANDCOMPLETE_Msk (0x1UL)                   /*!< COMMANDCOMPLETE (Bitfield-Mask: 0x01)                 */
/* =======================================================  INTENABLE  ======================================================= */
#define SDIO0_INTENABLE_VENDORSPECIFICERRORSTATUSENABLE_Pos (29UL)  /*!< VENDORSPECIFICERRORSTATUSENABLE (Bit 29)              */
#define SDIO0_INTENABLE_VENDORSPECIFICERRORSTATUSENABLE_Msk (0xe0000000UL) /*!< VENDORSPECIFICERRORSTATUSENABLE (Bitfield-Mask: 0x07) */
#define SDIO0_INTENABLE_TGTRESPERRHOSTERRSTATEN_Pos (28UL)          /*!< TGTRESPERRHOSTERRSTATEN (Bit 28)                      */
#define SDIO0_INTENABLE_TGTRESPERRHOSTERRSTATEN_Msk (0x10000000UL)  /*!< TGTRESPERRHOSTERRSTATEN (Bitfield-Mask: 0x01)         */
#define SDIO0_INTENABLE_TUNINGERRORSTATUS_Pos (26UL)                /*!< TUNINGERRORSTATUS (Bit 26)                            */
#define SDIO0_INTENABLE_TUNINGERRORSTATUS_Msk (0x4000000UL)         /*!< TUNINGERRORSTATUS (Bitfield-Mask: 0x01)               */
#define SDIO0_INTENABLE_ADMAERRORSTATUSENABLE_Pos (25UL)            /*!< ADMAERRORSTATUSENABLE (Bit 25)                        */
#define SDIO0_INTENABLE_ADMAERRORSTATUSENABLE_Msk (0x2000000UL)     /*!< ADMAERRORSTATUSENABLE (Bitfield-Mask: 0x01)           */
#define SDIO0_INTENABLE_AUTOCMD12ERRORSTATUSENABLE_Pos (24UL)       /*!< AUTOCMD12ERRORSTATUSENABLE (Bit 24)                   */
#define SDIO0_INTENABLE_AUTOCMD12ERRORSTATUSENABLE_Msk (0x1000000UL) /*!< AUTOCMD12ERRORSTATUSENABLE (Bitfield-Mask: 0x01)     */
#define SDIO0_INTENABLE_CURRENTLIMITERRORSTATUSENABLE_Pos (23UL)    /*!< CURRENTLIMITERRORSTATUSENABLE (Bit 23)                */
#define SDIO0_INTENABLE_CURRENTLIMITERRORSTATUSENABLE_Msk (0x800000UL) /*!< CURRENTLIMITERRORSTATUSENABLE (Bitfield-Mask: 0x01) */
#define SDIO0_INTENABLE_DATAENDBITERRORSTATUSENABLE_Pos (22UL)      /*!< DATAENDBITERRORSTATUSENABLE (Bit 22)                  */
#define SDIO0_INTENABLE_DATAENDBITERRORSTATUSENABLE_Msk (0x400000UL) /*!< DATAENDBITERRORSTATUSENABLE (Bitfield-Mask: 0x01)    */
#define SDIO0_INTENABLE_DATACRCERRORSTATUSENABLE_Pos (21UL)         /*!< DATACRCERRORSTATUSENABLE (Bit 21)                     */
#define SDIO0_INTENABLE_DATACRCERRORSTATUSENABLE_Msk (0x200000UL)   /*!< DATACRCERRORSTATUSENABLE (Bitfield-Mask: 0x01)        */
#define SDIO0_INTENABLE_DATATIMEOUTERRORSTATUSENABLE_Pos (20UL)     /*!< DATATIMEOUTERRORSTATUSENABLE (Bit 20)                 */
#define SDIO0_INTENABLE_DATATIMEOUTERRORSTATUSENABLE_Msk (0x100000UL) /*!< DATATIMEOUTERRORSTATUSENABLE (Bitfield-Mask: 0x01)  */
#define SDIO0_INTENABLE_COMMANDINDEXERRORSTATUSENABLE_Pos (19UL)    /*!< COMMANDINDEXERRORSTATUSENABLE (Bit 19)                */
#define SDIO0_INTENABLE_COMMANDINDEXERRORSTATUSENABLE_Msk (0x80000UL) /*!< COMMANDINDEXERRORSTATUSENABLE (Bitfield-Mask: 0x01) */
#define SDIO0_INTENABLE_COMMANDENDBITERRORSTATUSENABLE_Pos (18UL)   /*!< COMMANDENDBITERRORSTATUSENABLE (Bit 18)               */
#define SDIO0_INTENABLE_COMMANDENDBITERRORSTATUSENABLE_Msk (0x40000UL) /*!< COMMANDENDBITERRORSTATUSENABLE (Bitfield-Mask: 0x01) */
#define SDIO0_INTENABLE_COMMANDCRCERRORSTATUSENABLE_Pos (17UL)      /*!< COMMANDCRCERRORSTATUSENABLE (Bit 17)                  */
#define SDIO0_INTENABLE_COMMANDCRCERRORSTATUSENABLE_Msk (0x20000UL) /*!< COMMANDCRCERRORSTATUSENABLE (Bitfield-Mask: 0x01)     */
#define SDIO0_INTENABLE_COMMANDTIMEOUTERRORSTATUSENABLE_Pos (16UL)  /*!< COMMANDTIMEOUTERRORSTATUSENABLE (Bit 16)              */
#define SDIO0_INTENABLE_COMMANDTIMEOUTERRORSTATUSENABLE_Msk (0x10000UL) /*!< COMMANDTIMEOUTERRORSTATUSENABLE (Bitfield-Mask: 0x01) */
#define SDIO0_INTENABLE_FIXEDTO0_Pos      (15UL)                    /*!< FIXEDTO0 (Bit 15)                                     */
#define SDIO0_INTENABLE_FIXEDTO0_Msk      (0x8000UL)                /*!< FIXEDTO0 (Bitfield-Mask: 0x01)                        */
#define SDIO0_INTENABLE_BOOTTERMINATE_Pos (14UL)                    /*!< BOOTTERMINATE (Bit 14)                                */
#define SDIO0_INTENABLE_BOOTTERMINATE_Msk (0x4000UL)                /*!< BOOTTERMINATE (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTENABLE_BOOTACKRCVENABLE_Pos (13UL)                 /*!< BOOTACKRCVENABLE (Bit 13)                             */
#define SDIO0_INTENABLE_BOOTACKRCVENABLE_Msk (0x2000UL)             /*!< BOOTACKRCVENABLE (Bitfield-Mask: 0x01)                */
#define SDIO0_INTENABLE_RETUNINGEVENTSTATUSENABLE_Pos (12UL)        /*!< RETUNINGEVENTSTATUSENABLE (Bit 12)                    */
#define SDIO0_INTENABLE_RETUNINGEVENTSTATUSENABLE_Msk (0x1000UL)    /*!< RETUNINGEVENTSTATUSENABLE (Bitfield-Mask: 0x01)       */
#define SDIO0_INTENABLE_INTCSTATUSENABLE_Pos (11UL)                 /*!< INTCSTATUSENABLE (Bit 11)                             */
#define SDIO0_INTENABLE_INTCSTATUSENABLE_Msk (0x800UL)              /*!< INTCSTATUSENABLE (Bitfield-Mask: 0x01)                */
#define SDIO0_INTENABLE_INTBSTATUSENABLE_Pos (10UL)                 /*!< INTBSTATUSENABLE (Bit 10)                             */
#define SDIO0_INTENABLE_INTBSTATUSENABLE_Msk (0x400UL)              /*!< INTBSTATUSENABLE (Bitfield-Mask: 0x01)                */
#define SDIO0_INTENABLE_INTASTATUSENABLE_Pos (9UL)                  /*!< INTASTATUSENABLE (Bit 9)                              */
#define SDIO0_INTENABLE_INTASTATUSENABLE_Msk (0x200UL)              /*!< INTASTATUSENABLE (Bitfield-Mask: 0x01)                */
#define SDIO0_INTENABLE_CARDINTERRUPTSTATUSENABLE_Pos (8UL)         /*!< CARDINTERRUPTSTATUSENABLE (Bit 8)                     */
#define SDIO0_INTENABLE_CARDINTERRUPTSTATUSENABLE_Msk (0x100UL)     /*!< CARDINTERRUPTSTATUSENABLE (Bitfield-Mask: 0x01)       */
#define SDIO0_INTENABLE_CARDREMOVALSTATUSENABLE_Pos (7UL)           /*!< CARDREMOVALSTATUSENABLE (Bit 7)                       */
#define SDIO0_INTENABLE_CARDREMOVALSTATUSENABLE_Msk (0x80UL)        /*!< CARDREMOVALSTATUSENABLE (Bitfield-Mask: 0x01)         */
#define SDIO0_INTENABLE_CARDINSERTIONSTATUSENABLE_Pos (6UL)         /*!< CARDINSERTIONSTATUSENABLE (Bit 6)                     */
#define SDIO0_INTENABLE_CARDINSERTIONSTATUSENABLE_Msk (0x40UL)      /*!< CARDINSERTIONSTATUSENABLE (Bitfield-Mask: 0x01)       */
#define SDIO0_INTENABLE_BUFFERREADREADYSTATUSENABLE_Pos (5UL)       /*!< BUFFERREADREADYSTATUSENABLE (Bit 5)                   */
#define SDIO0_INTENABLE_BUFFERREADREADYSTATUSENABLE_Msk (0x20UL)    /*!< BUFFERREADREADYSTATUSENABLE (Bitfield-Mask: 0x01)     */
#define SDIO0_INTENABLE_BUFFERWRITEREADYSTATUSENABLE_Pos (4UL)      /*!< BUFFERWRITEREADYSTATUSENABLE (Bit 4)                  */
#define SDIO0_INTENABLE_BUFFERWRITEREADYSTATUSENABLE_Msk (0x10UL)   /*!< BUFFERWRITEREADYSTATUSENABLE (Bitfield-Mask: 0x01)    */
#define SDIO0_INTENABLE_DMAINTERRUPTSTATUSENABLE_Pos (3UL)          /*!< DMAINTERRUPTSTATUSENABLE (Bit 3)                      */
#define SDIO0_INTENABLE_DMAINTERRUPTSTATUSENABLE_Msk (0x8UL)        /*!< DMAINTERRUPTSTATUSENABLE (Bitfield-Mask: 0x01)        */
#define SDIO0_INTENABLE_BLOCKGAPEVENTSTATUSENABLE_Pos (2UL)         /*!< BLOCKGAPEVENTSTATUSENABLE (Bit 2)                     */
#define SDIO0_INTENABLE_BLOCKGAPEVENTSTATUSENABLE_Msk (0x4UL)       /*!< BLOCKGAPEVENTSTATUSENABLE (Bitfield-Mask: 0x01)       */
#define SDIO0_INTENABLE_TRANSFERCOMPLETESTATUSENABLE_Pos (1UL)      /*!< TRANSFERCOMPLETESTATUSENABLE (Bit 1)                  */
#define SDIO0_INTENABLE_TRANSFERCOMPLETESTATUSENABLE_Msk (0x2UL)    /*!< TRANSFERCOMPLETESTATUSENABLE (Bitfield-Mask: 0x01)    */
#define SDIO0_INTENABLE_COMMANDCOMPLETESTATUSENABLE_Pos (0UL)       /*!< COMMANDCOMPLETESTATUSENABLE (Bit 0)                   */
#define SDIO0_INTENABLE_COMMANDCOMPLETESTATUSENABLE_Msk (0x1UL)     /*!< COMMANDCOMPLETESTATUSENABLE (Bitfield-Mask: 0x01)     */
/* ========================================================  INTSIG  ========================================================= */
#define SDIO0_INTSIG_VNDERREN_Pos         (29UL)                    /*!< VNDERREN (Bit 29)                                     */
#define SDIO0_INTSIG_VNDERREN_Msk         (0xe0000000UL)            /*!< VNDERREN (Bitfield-Mask: 0x07)                        */
#define SDIO0_INTSIG_TGTRESPEN_Pos        (28UL)                    /*!< TGTRESPEN (Bit 28)                                    */
#define SDIO0_INTSIG_TGTRESPEN_Msk        (0x10000000UL)            /*!< TGTRESPEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSIG_TUNINGERREN_Pos      (26UL)                    /*!< TUNINGERREN (Bit 26)                                  */
#define SDIO0_INTSIG_TUNINGERREN_Msk      (0x4000000UL)             /*!< TUNINGERREN (Bitfield-Mask: 0x01)                     */
#define SDIO0_INTSIG_ADMAERREN_Pos        (25UL)                    /*!< ADMAERREN (Bit 25)                                    */
#define SDIO0_INTSIG_ADMAERREN_Msk        (0x2000000UL)             /*!< ADMAERREN (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSIG_AUTOCMD12ERREN_Pos   (24UL)                    /*!< AUTOCMD12ERREN (Bit 24)                               */
#define SDIO0_INTSIG_AUTOCMD12ERREN_Msk   (0x1000000UL)             /*!< AUTOCMD12ERREN (Bitfield-Mask: 0x01)                  */
#define SDIO0_INTSIG_CURRLMTERREN_Pos     (23UL)                    /*!< CURRLMTERREN (Bit 23)                                 */
#define SDIO0_INTSIG_CURRLMTERREN_Msk     (0x800000UL)              /*!< CURRLMTERREN (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSIG_DATAENDERREN_Pos     (22UL)                    /*!< DATAENDERREN (Bit 22)                                 */
#define SDIO0_INTSIG_DATAENDERREN_Msk     (0x400000UL)              /*!< DATAENDERREN (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSIG_DATACRCERREN_Pos     (21UL)                    /*!< DATACRCERREN (Bit 21)                                 */
#define SDIO0_INTSIG_DATACRCERREN_Msk     (0x200000UL)              /*!< DATACRCERREN (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSIG_DATATOERROREN_Pos    (20UL)                    /*!< DATATOERROREN (Bit 20)                                */
#define SDIO0_INTSIG_DATATOERROREN_Msk    (0x100000UL)              /*!< DATATOERROREN (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSIG_CMDIDXERREN_Pos      (19UL)                    /*!< CMDIDXERREN (Bit 19)                                  */
#define SDIO0_INTSIG_CMDIDXERREN_Msk      (0x80000UL)               /*!< CMDIDXERREN (Bitfield-Mask: 0x01)                     */
#define SDIO0_INTSIG_CMDENDBITERREN_Pos   (18UL)                    /*!< CMDENDBITERREN (Bit 18)                               */
#define SDIO0_INTSIG_CMDENDBITERREN_Msk   (0x40000UL)               /*!< CMDENDBITERREN (Bitfield-Mask: 0x01)                  */
#define SDIO0_INTSIG_CMDCRCERREN_Pos      (17UL)                    /*!< CMDCRCERREN (Bit 17)                                  */
#define SDIO0_INTSIG_CMDCRCERREN_Msk      (0x20000UL)               /*!< CMDCRCERREN (Bitfield-Mask: 0x01)                     */
#define SDIO0_INTSIG_CMDTOERREN_Pos       (16UL)                    /*!< CMDTOERREN (Bit 16)                                   */
#define SDIO0_INTSIG_CMDTOERREN_Msk       (0x10000UL)               /*!< CMDTOERREN (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSIG_FIXED0_Pos           (15UL)                    /*!< FIXED0 (Bit 15)                                       */
#define SDIO0_INTSIG_FIXED0_Msk           (0x8000UL)                /*!< FIXED0 (Bitfield-Mask: 0x01)                          */
#define SDIO0_INTSIG_BOOTTERM_Pos         (14UL)                    /*!< BOOTTERM (Bit 14)                                     */
#define SDIO0_INTSIG_BOOTTERM_Msk         (0x4000UL)                /*!< BOOTTERM (Bitfield-Mask: 0x01)                        */
#define SDIO0_INTSIG_BOOTACKEN_Pos        (13UL)                    /*!< BOOTACKEN (Bit 13)                                    */
#define SDIO0_INTSIG_BOOTACKEN_Msk        (0x2000UL)                /*!< BOOTACKEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSIG_RETUNEEVENTEN_Pos    (12UL)                    /*!< RETUNEEVENTEN (Bit 12)                                */
#define SDIO0_INTSIG_RETUNEEVENTEN_Msk    (0x1000UL)                /*!< RETUNEEVENTEN (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSIG_INTCEN_Pos           (11UL)                    /*!< INTCEN (Bit 11)                                       */
#define SDIO0_INTSIG_INTCEN_Msk           (0x800UL)                 /*!< INTCEN (Bitfield-Mask: 0x01)                          */
#define SDIO0_INTSIG_INTBEN_Pos           (10UL)                    /*!< INTBEN (Bit 10)                                       */
#define SDIO0_INTSIG_INTBEN_Msk           (0x400UL)                 /*!< INTBEN (Bitfield-Mask: 0x01)                          */
#define SDIO0_INTSIG_INTAEN_Pos           (9UL)                     /*!< INTAEN (Bit 9)                                        */
#define SDIO0_INTSIG_INTAEN_Msk           (0x200UL)                 /*!< INTAEN (Bitfield-Mask: 0x01)                          */
#define SDIO0_INTSIG_CARDINTEN_Pos        (8UL)                     /*!< CARDINTEN (Bit 8)                                     */
#define SDIO0_INTSIG_CARDINTEN_Msk        (0x100UL)                 /*!< CARDINTEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSIG_CARDREMOVALEN_Pos    (7UL)                     /*!< CARDREMOVALEN (Bit 7)                                 */
#define SDIO0_INTSIG_CARDREMOVALEN_Msk    (0x80UL)                  /*!< CARDREMOVALEN (Bitfield-Mask: 0x01)                   */
#define SDIO0_INTSIG_CARDINSERTEN_Pos     (6UL)                     /*!< CARDINSERTEN (Bit 6)                                  */
#define SDIO0_INTSIG_CARDINSERTEN_Msk     (0x40UL)                  /*!< CARDINSERTEN (Bitfield-Mask: 0x01)                    */
#define SDIO0_INTSIG_BUFFERRDEN_Pos       (5UL)                     /*!< BUFFERRDEN (Bit 5)                                    */
#define SDIO0_INTSIG_BUFFERRDEN_Msk       (0x20UL)                  /*!< BUFFERRDEN (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSIG_BUFFERWREN_Pos       (4UL)                     /*!< BUFFERWREN (Bit 4)                                    */
#define SDIO0_INTSIG_BUFFERWREN_Msk       (0x10UL)                  /*!< BUFFERWREN (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSIG_DMAINTEN_Pos         (3UL)                     /*!< DMAINTEN (Bit 3)                                      */
#define SDIO0_INTSIG_DMAINTEN_Msk         (0x8UL)                   /*!< DMAINTEN (Bitfield-Mask: 0x01)                        */
#define SDIO0_INTSIG_BLOCKGAPEN_Pos       (2UL)                     /*!< BLOCKGAPEN (Bit 2)                                    */
#define SDIO0_INTSIG_BLOCKGAPEN_Msk       (0x4UL)                   /*!< BLOCKGAPEN (Bitfield-Mask: 0x01)                      */
#define SDIO0_INTSIG_XFERCMPEN_Pos        (1UL)                     /*!< XFERCMPEN (Bit 1)                                     */
#define SDIO0_INTSIG_XFERCMPEN_Msk        (0x2UL)                   /*!< XFERCMPEN (Bitfield-Mask: 0x01)                       */
#define SDIO0_INTSIG_CMDCMPEN_Pos         (0UL)                     /*!< CMDCMPEN (Bit 0)                                      */
#define SDIO0_INTSIG_CMDCMPEN_Msk         (0x1UL)                   /*!< CMDCMPEN (Bitfield-Mask: 0x01)                        */
/* =========================================================  AUTO  ========================================================== */
#define SDIO0_AUTO_PRESETEN_Pos           (31UL)                    /*!< PRESETEN (Bit 31)                                     */
#define SDIO0_AUTO_PRESETEN_Msk           (0x80000000UL)            /*!< PRESETEN (Bitfield-Mask: 0x01)                        */
#define SDIO0_AUTO_ASYNCINTEN_Pos         (30UL)                    /*!< ASYNCINTEN (Bit 30)                                   */
#define SDIO0_AUTO_ASYNCINTEN_Msk         (0x40000000UL)            /*!< ASYNCINTEN (Bitfield-Mask: 0x01)                      */
#define SDIO0_AUTO_SAMPLCLKSEL_Pos        (23UL)                    /*!< SAMPLCLKSEL (Bit 23)                                  */
#define SDIO0_AUTO_SAMPLCLKSEL_Msk        (0x800000UL)              /*!< SAMPLCLKSEL (Bitfield-Mask: 0x01)                     */
#define SDIO0_AUTO_STARTTUNING_Pos        (22UL)                    /*!< STARTTUNING (Bit 22)                                  */
#define SDIO0_AUTO_STARTTUNING_Msk        (0x400000UL)              /*!< STARTTUNING (Bitfield-Mask: 0x01)                     */
#define SDIO0_AUTO_DRVRSTRSEL_Pos         (20UL)                    /*!< DRVRSTRSEL (Bit 20)                                   */
#define SDIO0_AUTO_DRVRSTRSEL_Msk         (0x300000UL)              /*!< DRVRSTRSEL (Bitfield-Mask: 0x03)                      */
#define SDIO0_AUTO_SIGNALVOLT_Pos         (19UL)                    /*!< SIGNALVOLT (Bit 19)                                   */
#define SDIO0_AUTO_SIGNALVOLT_Msk         (0x80000UL)               /*!< SIGNALVOLT (Bitfield-Mask: 0x01)                      */
#define SDIO0_AUTO_UHSMODESEL_Pos         (16UL)                    /*!< UHSMODESEL (Bit 16)                                   */
#define SDIO0_AUTO_UHSMODESEL_Msk         (0x70000UL)               /*!< UHSMODESEL (Bitfield-Mask: 0x07)                      */
#define SDIO0_AUTO_NOTAUTOCMD12ERR_Pos    (7UL)                     /*!< NOTAUTOCMD12ERR (Bit 7)                               */
#define SDIO0_AUTO_NOTAUTOCMD12ERR_Msk    (0x80UL)                  /*!< NOTAUTOCMD12ERR (Bitfield-Mask: 0x01)                 */
#define SDIO0_AUTO_CMDIDXERR_Pos          (4UL)                     /*!< CMDIDXERR (Bit 4)                                     */
#define SDIO0_AUTO_CMDIDXERR_Msk          (0x10UL)                  /*!< CMDIDXERR (Bitfield-Mask: 0x01)                       */
#define SDIO0_AUTO_CMDENDERR_Pos          (3UL)                     /*!< CMDENDERR (Bit 3)                                     */
#define SDIO0_AUTO_CMDENDERR_Msk          (0x8UL)                   /*!< CMDENDERR (Bitfield-Mask: 0x01)                       */
#define SDIO0_AUTO_CMDCRCERR_Pos          (2UL)                     /*!< CMDCRCERR (Bit 2)                                     */
#define SDIO0_AUTO_CMDCRCERR_Msk          (0x4UL)                   /*!< CMDCRCERR (Bitfield-Mask: 0x01)                       */
#define SDIO0_AUTO_CMDTOERR_Pos           (1UL)                     /*!< CMDTOERR (Bit 1)                                      */
#define SDIO0_AUTO_CMDTOERR_Msk           (0x2UL)                   /*!< CMDTOERR (Bitfield-Mask: 0x01)                        */
#define SDIO0_AUTO_CMD12NOTEXEC_Pos       (0UL)                     /*!< CMD12NOTEXEC (Bit 0)                                  */
#define SDIO0_AUTO_CMD12NOTEXEC_Msk       (0x1UL)                   /*!< CMD12NOTEXEC (Bitfield-Mask: 0x01)                    */
/* =====================================================  CAPABILITIES0  ===================================================== */
#define SDIO0_CAPABILITIES0_SLOTTYPE_Pos  (30UL)                    /*!< SLOTTYPE (Bit 30)                                     */
#define SDIO0_CAPABILITIES0_SLOTTYPE_Msk  (0xc0000000UL)            /*!< SLOTTYPE (Bitfield-Mask: 0x03)                        */
#define SDIO0_CAPABILITIES0_ASYNCINT_Pos  (29UL)                    /*!< ASYNCINT (Bit 29)                                     */
#define SDIO0_CAPABILITIES0_ASYNCINT_Msk  (0x20000000UL)            /*!< ASYNCINT (Bitfield-Mask: 0x01)                        */
#define SDIO0_CAPABILITIES0_SYSBUS64_Pos  (28UL)                    /*!< SYSBUS64 (Bit 28)                                     */
#define SDIO0_CAPABILITIES0_SYSBUS64_Msk  (0x10000000UL)            /*!< SYSBUS64 (Bitfield-Mask: 0x01)                        */
#define SDIO0_CAPABILITIES0_VOLT18V_Pos   (26UL)                    /*!< VOLT18V (Bit 26)                                      */
#define SDIO0_CAPABILITIES0_VOLT18V_Msk   (0x4000000UL)             /*!< VOLT18V (Bitfield-Mask: 0x01)                         */
#define SDIO0_CAPABILITIES0_VOLT30V_Pos   (25UL)                    /*!< VOLT30V (Bit 25)                                      */
#define SDIO0_CAPABILITIES0_VOLT30V_Msk   (0x2000000UL)             /*!< VOLT30V (Bitfield-Mask: 0x01)                         */
#define SDIO0_CAPABILITIES0_VOLT33V_Pos   (24UL)                    /*!< VOLT33V (Bit 24)                                      */
#define SDIO0_CAPABILITIES0_VOLT33V_Msk   (0x1000000UL)             /*!< VOLT33V (Bitfield-Mask: 0x01)                         */
#define SDIO0_CAPABILITIES0_SUSPRES_Pos   (23UL)                    /*!< SUSPRES (Bit 23)                                      */
#define SDIO0_CAPABILITIES0_SUSPRES_Msk   (0x800000UL)              /*!< SUSPRES (Bitfield-Mask: 0x01)                         */
#define SDIO0_CAPABILITIES0_SDMA_Pos      (22UL)                    /*!< SDMA (Bit 22)                                         */
#define SDIO0_CAPABILITIES0_SDMA_Msk      (0x400000UL)              /*!< SDMA (Bitfield-Mask: 0x01)                            */
#define SDIO0_CAPABILITIES0_HIGHSPEED_Pos (21UL)                    /*!< HIGHSPEED (Bit 21)                                    */
#define SDIO0_CAPABILITIES0_HIGHSPEED_Msk (0x200000UL)              /*!< HIGHSPEED (Bitfield-Mask: 0x01)                       */
#define SDIO0_CAPABILITIES0_ADMA2_Pos     (19UL)                    /*!< ADMA2 (Bit 19)                                        */
