AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================================  ADCCRM  ========================================================= */
/* ==============================================  CRM ADCCRM ADCCLKSEL [4..4]  ============================================== */
typedef enum {                                  /*!< CRM_ADCCRM_ADCCLKSEL                                                      */
  CRM_ADCCRM_ADCCLKSEL_HFRC_48MHz      = 0,     /*!< HFRC_48MHz : Source clock is HFRC_48MHz.                                  */
  CRM_ADCCRM_ADCCLKSEL_PLLPOSTDIV      = 1,     /*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                  */
} CRM_ADCCRM_ADCCLKSEL_Enum;

/* ======================================================  APBDISPCRM  ======================================================= */
/* =====================================================  APBDISPPHYCRM  ===================================================== */
/* ======================================================  APBUARTCRM  ======================================================= */
/* =======================================================  APBI2SCRM  ======================================================= */
/* ===========================================  CRM APBI2SCRM APBI2SCLKSEL [4..4]  =========================================== */
typedef enum {                                  /*!< CRM_APBI2SCRM_APBI2SCLKSEL                                                */
  CRM_APBI2SCRM_APBI2SCLKSEL_HFRC_96MHz = 0,    /*!< HFRC_96MHz : Source clock is HFRC_96MHz.                                  */
  CRM_APBI2SCRM_APBI2SCLKSEL_HFRC48    = 1,     /*!< HFRC48 : Source clock is HFRC48.                                          */
} CRM_APBI2SCRM_APBI2SCLKSEL_Enum;

/* =======================================================  APBPDMCRM  ======================================================= */
/* =======================================================  APBUSBCRM  ======================================================= */
/* ======================================================  DISPCLKCRM  ======================================================= */
/* ==========================================  CRM DISPCLKCRM DISPCLKCLKSEL [4..5]  ========================================== */
typedef enum {                                  /*!< CRM_DISPCLKCRM_DISPCLKCLKSEL                                              */
  CRM_DISPCLKCRM_DISPCLKCLKSEL_HFRC_192MHz = 0, /*!< HFRC_192MHz : Source clock is HFRC_192MHz.                                */
  CRM_DISPCLKCRM_DISPCLKCLKSEL_PLLVCO  = 1,     /*!< PLLVCO : Source clock is PLLVCO.                                          */
  CRM_DISPCLKCRM_DISPCLKCLKSEL_dphy_pll_clk = 2,/*!< dphy_pll_clk : Source clock is dphy_pll_clk.                              */
} CRM_DISPCLKCRM_DISPCLKCLKSEL_Enum;

/* =====================================================  DPHYPLLREFCRM  ===================================================== */
/* =======================================  CRM DPHYPLLREFCRM DPHYPLLREFCLKSEL [4..6]  ======================================= */
typedef enum {                                  /*!< CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL                                        */
  CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_HFRC_48MHz = 0,/*!< HFRC_48MHz : Source clock is HFRC_48MHz.                              */
  CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                     */
  CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_PLLPOSTDIV = 2,/*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                              */
  CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_PLLFOUT2 = 3,/*!< PLLFOUT2 : Source clock is PLLFOUT2.                                    */
  CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_EXTREF_CLK = 4,/*!< EXTREF_CLK : Source clock is EXTREF_CLK.                              */
} CRM_DPHYPLLREFCRM_DPHYPLLREFCLKSEL_Enum;

/* ======================================================  DSPPDM0CRM  ======================================================= */
/* ==========================================  CRM DSPPDM0CRM DSPPDM0CLKSEL [4..6]  ========================================== */
typedef enum {                                  /*!< CRM_DSPPDM0CRM_DSPPDM0CLKSEL                                              */
  CRM_DSPPDM0CRM_DSPPDM0CLKSEL_HFRC48  = 0,     /*!< HFRC48 : Source clock is HFRC48.                                          */
  CRM_DSPPDM0CRM_DSPPDM0CLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                           */
  CRM_DSPPDM0CRM_DSPPDM0CLKSEL_PLLPOSTDIV = 2,  /*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                  */
  CRM_DSPPDM0CRM_DSPPDM0CLKSEL_PLLFOUT4 = 3,    /*!< PLLFOUT4 : Source clock is PLLFOUT4.                                      */
  CRM_DSPPDM0CRM_DSPPDM0CLKSEL_EXTREF_CLK = 4,  /*!< EXTREF_CLK : Source clock is EXTREF_CLK.                                  */
} CRM_DSPPDM0CRM_DSPPDM0CLKSEL_Enum;

/* ======================================================  I2S0MCLKCRM  ====================================================== */
/* =========================================  CRM I2S0MCLKCRM I2S0MCLKCLKSEL [4..6]  ========================================= */
typedef enum {                                  /*!< CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL                                            */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_HFRC48 = 0,    /*!< HFRC48 : Source clock is HFRC48.                                          */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                         */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_PLLPOSTDIV = 2,/*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                  */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_PLLFOUT3 = 3,  /*!< PLLFOUT3 : Source clock is PLLFOUT3.                                      */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_PLLFOUT4 = 4,  /*!< PLLFOUT4 : Source clock is PLLFOUT4.                                      */
  CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_EXTREF_CLK = 5,/*!< EXTREF_CLK : Source clock is EXTREF_CLK.                                  */
} CRM_I2S0MCLKCRM_I2S0MCLKCLKSEL_Enum;

/* ====================================================  I2S0MCLKOUTCRM  ===================================================== */
/* ======================================  CRM I2S0MCLKOUTCRM I2S0MCLKOUTCLKSEL [4..6]  ====================================== */
typedef enum {                                  /*!< CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL                                      */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_HFRC48 = 0,/*!< HFRC48 : Source clock is HFRC48.                                        */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                   */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_PLLPOSTDIV = 2,/*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                            */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_PLLFOUT3 = 3,/*!< PLLFOUT3 : Source clock is PLLFOUT3.                                  */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_PLLFOUT4 = 4,/*!< PLLFOUT4 : Source clock is PLLFOUT4.                                  */
  CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_EXTREF_CLK = 5,/*!< EXTREF_CLK : Source clock is EXTREF_CLK.                            */
} CRM_I2S0MCLKOUTCRM_I2S0MCLKOUTCLKSEL_Enum;

