AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =====================================================  I2S0REFCLKCRM  ===================================================== */
/* =======================================  CRM I2S0REFCLKCRM I2S0REFCLKCLKSEL [4..5]  ======================================= */
typedef enum {                                  /*!< CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL                                        */
  CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_HFRC_96MHz = 0,/*!< HFRC_96MHz : Source clock is HFRC_96MHz.                              */
  CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                     */
  CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_PLLPOSTDIV = 2,/*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                              */
  CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_EXTREF_CLK = 3,/*!< EXTREF_CLK : Source clock is EXTREF_CLK.                              */
} CRM_I2S0REFCLKCRM_I2S0REFCLKCLKSEL_Enum;

/* ======================================================  UART0HFCRM  ======================================================= */
/* ==========================================  CRM UART0HFCRM UART0HFCLKSEL [4..4]  ========================================== */
typedef enum {                                  /*!< CRM_UART0HFCRM_UART0HFCLKSEL                                              */
  CRM_UART0HFCRM_UART0HFCLKSEL_HFRC_96MHz = 0,  /*!< HFRC_96MHz : Source clock is HFRC_96MHz.                                  */
  CRM_UART0HFCRM_UART0HFCLKSEL_PLLPOSTDIV = 1,  /*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                  */
} CRM_UART0HFCRM_UART0HFCLKSEL_Enum;

/* ======================================================  UART1HFCRM  ======================================================= */
/* ==========================================  CRM UART1HFCRM UART1HFCLKSEL [4..4]  ========================================== */
typedef enum {                                  /*!< CRM_UART1HFCRM_UART1HFCLKSEL                                              */
  CRM_UART1HFCRM_UART1HFCLKSEL_HFRC_96MHz = 0,  /*!< HFRC_96MHz : Source clock is HFRC_96MHz.                                  */
  CRM_UART1HFCRM_UART1HFCLKSEL_PLLPOSTDIV = 1,  /*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                  */
} CRM_UART1HFCRM_UART1HFCLKSEL_Enum;

/* =====================================================  USBREFCLKCRM  ====================================================== */
/* ========================================  CRM USBREFCLKCRM USBREFCLKCLKSEL [4..6]  ======================================== */
typedef enum {                                  /*!< CRM_USBREFCLKCRM_USBREFCLKCLKSEL                                          */
  CRM_USBREFCLKCRM_USBREFCLKCLKSEL_HFRC48 = 0,  /*!< HFRC48 : Source clock is HFRC48.                                          */
  CRM_USBREFCLKCRM_USBREFCLKCLKSEL_RF_XTAL_48MHz = 1,/*!< RF_XTAL_48MHz : Source clock is RF_XTAL_48MHz.                       */
  CRM_USBREFCLKCRM_USBREFCLKCLKSEL_PLLPOSTDIV = 2,/*!< PLLPOSTDIV : Source clock is PLLPOSTDIV.                                */
  CRM_USBREFCLKCRM_USBREFCLKCLKSEL_PLLFOUT2 = 3,/*!< PLLFOUT2 : Source clock is PLLFOUT2.                                      */
  CRM_USBREFCLKCRM_USBREFCLKCLKSEL_EXTREF_CLK = 4,/*!< EXTREF_CLK : Source clock is EXTREF_CLK.                                */
} CRM_USBREFCLKCRM_USBREFCLKCLKSEL_Enum;

/* ====================================================  CRMCLKENSTATUS  ===================================================== */
/* =======================================  CRM CRMCLKENSTATUS ADCCLKENABLED [15..15]  ======================================= */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_ADCCLKENABLED                                          */
  CRM_CRMCLKENSTATUS_ADCCLKENABLED_ON  = 1,     /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_ADCCLKENABLED_OFF = 0,     /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_ADCCLKENABLED_Enum;

/* =====================================  CRM CRMCLKENSTATUS APBDISPCLKENABLED [14..14]  ===================================== */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBDISPCLKENABLED                                      */
  CRM_CRMCLKENSTATUS_APBDISPCLKENABLED_ON = 1,  /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_APBDISPCLKENABLED_OFF = 0, /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_APBDISPCLKENABLED_Enum;

/* ===================================  CRM CRMCLKENSTATUS APBDISPPHYCLKENABLED [13..13]  ==================================== */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED                                   */
  CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED_ON = 1,/*!< ON : Clock enabled                                                       */
  CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED_OFF = 0,/*!< OFF : Clock not enabled                                                 */
} CRM_CRMCLKENSTATUS_APBDISPPHYCLKENABLED_Enum;

/* =====================================  CRM CRMCLKENSTATUS APBUARTCLKENABLED [12..12]  ===================================== */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBUARTCLKENABLED                                      */
  CRM_CRMCLKENSTATUS_APBUARTCLKENABLED_ON = 1,  /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_APBUARTCLKENABLED_OFF = 0, /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_APBUARTCLKENABLED_Enum;

/* =====================================  CRM CRMCLKENSTATUS APBI2SCLKENABLED [11..11]  ====================================== */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBI2SCLKENABLED                                       */
  CRM_CRMCLKENSTATUS_APBI2SCLKENABLED_ON = 1,   /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_APBI2SCLKENABLED_OFF = 0,  /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_APBI2SCLKENABLED_Enum;

/* =====================================  CRM CRMCLKENSTATUS APBPDMCLKENABLED [10..10]  ====================================== */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBPDMCLKENABLED                                       */
  CRM_CRMCLKENSTATUS_APBPDMCLKENABLED_ON = 1,   /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_APBPDMCLKENABLED_OFF = 0,  /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_APBPDMCLKENABLED_Enum;

/* ======================================  CRM CRMCLKENSTATUS APBUSBCLKENABLED [9..9]  ======================================= */
typedef enum {                                  /*!< CRM_CRMCLKENSTATUS_APBUSBCLKENABLED                                       */
  CRM_CRMCLKENSTATUS_APBUSBCLKENABLED_ON = 1,   /*!< ON : Clock enabled                                                        */
  CRM_CRMCLKENSTATUS_APBUSBCLKENABLED_OFF = 0,  /*!< OFF : Clock not enabled                                                   */
} CRM_CRMCLKENSTATUS_APBUSBCLKENABLED_Enum;

