AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==========================================  GPIO PINCFG105 TIMERSEL105 [23..23]  ========================================== */
typedef enum {                                  /*!< GPIO_PINCFG105_TIMERSEL105                                                */
  GPIO_PINCFG105_TIMERSEL105_NS_TIMER  = 0,     /*!< NS_TIMER : Non Secure Timer (1 s-timer + 16 GP timers)                    */
  GPIO_PINCFG105_TIMERSEL105_RSS_TIMER = 1,     /*!< RSS_TIMER : Radio Subsystem Timer (1 s-timer + 4 GP timers)               */
} GPIO_PINCFG105_TIMERSEL105_Enum;

/* ===========================================  GPIO PINCFG105 NCEPOL105 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG105_NCEPOL105                                                  */
  GPIO_PINCFG105_NCEPOL105_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG105_NCEPOL105_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG105_NCEPOL105_Enum;

/* ===========================================  GPIO PINCFG105 NCESRC105 [16..20]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG105_NCESRC105                                                  */
  GPIO_PINCFG105_NCESRC105_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG105_NCESRC105_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG105_NCESRC105_DC_DPI_DE   = 24,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG105_NCESRC105_DISP_CONT_CSX = 25,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG105_NCESRC105_DC_SPI_CS_N = 26,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG105_NCESRC105_DC_QSPI_CS_N = 27,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG105_NCESRC105_DC_RESX     = 28,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG105_NCESRC105_Enum;

/* ==========================================  GPIO PINCFG105 PULLCFG105 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG105_PULLCFG105                                                 */
  GPIO_PINCFG105_PULLCFG105_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG105_PULLCFG105_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG105_PULLCFG105_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG105_PULLCFG105_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG105_PULLCFG105_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG105_PULLCFG105_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG105_PULLCFG105_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG105_PULLCFG105_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG105_PULLCFG105_Enum;

/* =============================================  GPIO PINCFG105 DS105 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG105_DS105                                                      */
  GPIO_PINCFG105_DS105_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG105_DS105_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG105_DS105_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG105_DS105_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG105_DS105_Enum;

/* ============================================  GPIO PINCFG105 OUTCFG105 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_OUTCFG105                                                  */
  GPIO_PINCFG105_OUTCFG105_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG105_OUTCFG105_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG105_OUTCFG105_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG105_OUTCFG105_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG105_OUTCFG105_Enum;

/* ============================================  GPIO PINCFG105 IRPTEN105 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_IRPTEN105                                                  */
  GPIO_PINCFG105_IRPTEN105_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG105_IRPTEN105_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG105_IRPTEN105_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG105_IRPTEN105_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG105_IRPTEN105_Enum;

/* ============================================  GPIO PINCFG105 FNCSEL105 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG105_FNCSEL105                                                  */
  GPIO_PINCFG105_FNCSEL105_SLFDnCE     = 0,     /*!< SLFDnCE : SPI Slave full duplex chip enable                               */
  GPIO_PINCFG105_FNCSEL105_BTDM_RXEN   = 1,     /*!< BTDM_RXEN : Bluetooth DM RX enable                                        */
  GPIO_PINCFG105_FNCSEL105_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG105_FNCSEL105_TRIG3       = 4,     /*!< TRIG3 : ADC trigger input 3                                               */
  GPIO_PINCFG105_FNCSEL105_RESERVED5   = 5,     /*!< RESERVED5 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG105_FNCSEL105_CT105       = 6,     /*!< CT105 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG105_FNCSEL105_NCE105      = 7,     /*!< NCE105 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG105_FNCSEL105_OBSBUS9     = 8,     /*!< OBSBUS9 : Observation bus bit 9                                           */
  GPIO_PINCFG105_FNCSEL105_UART0RX     = 9,     /*!< UART0RX : UART receive input (UART 0)                                     */
  GPIO_PINCFG105_FNCSEL105_UART1RTS    = 10,    /*!< UART1RTS : UART Request to Send (RTS) (UART 1)                            */
  GPIO_PINCFG105_FNCSEL105_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG105_FNCSEL105_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_DBIB_D11    = 13,    /*!< DBIB_D11 : Display DBI Data bit 11                                        */
  GPIO_PINCFG105_FNCSEL105_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG105_FNCSEL105_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG105_FNCSEL105_Enum;

/* =======================================================  PINCFG106  ======================================================= */
/* =========================================  GPIO PINCFG106 DSPULLCFG106 [28..30]  ========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_DSPULLCFG106                                               */
  GPIO_PINCFG106_DSPULLCFG106_DIS      = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG106_DSPULLCFG106_PD50K    = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG106_DSPULLCFG106_PU15K    = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG106_DSPULLCFG106_PU6K     = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG106_DSPULLCFG106_PU12K    = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG106_DSPULLCFG106_PU24K    = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG106_DSPULLCFG106_PU50K    = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG106_DSPULLCFG106_PU100K   = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG106_DSPULLCFG106_Enum;

/* ==========================================  GPIO PINCFG106 TIMERSEL106 [23..23]  ========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_TIMERSEL106                                                */
  GPIO_PINCFG106_TIMERSEL106_NS_TIMER  = 0,     /*!< NS_TIMER : Non Secure Timer (1 s-timer + 16 GP timers)                    */
  GPIO_PINCFG106_TIMERSEL106_RSS_TIMER = 1,     /*!< RSS_TIMER : Radio Subsystem Timer (1 s-timer + 4 GP timers)               */
} GPIO_PINCFG106_TIMERSEL106_Enum;

/* ===========================================  GPIO PINCFG106 NCEPOL106 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_NCEPOL106                                                  */
  GPIO_PINCFG106_NCEPOL106_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG106_NCEPOL106_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG106_NCEPOL106_Enum;

/* ===========================================  GPIO PINCFG106 NCESRC106 [16..20]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_NCESRC106                                                  */
  GPIO_PINCFG106_NCESRC106_IOM0CE0     = 0,     /*!< IOM0CE0 : IOM 0 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM0CE1     = 1,     /*!< IOM0CE1 : IOM 0 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM0CE2     = 2,     /*!< IOM0CE2 : IOM 0 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM0CE3     = 3,     /*!< IOM0CE3 : IOM 0 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM1CE0     = 4,     /*!< IOM1CE0 : IOM 1 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM1CE1     = 5,     /*!< IOM1CE1 : IOM 1 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM1CE2     = 6,     /*!< IOM1CE2 : IOM 1 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM1CE3     = 7,     /*!< IOM1CE3 : IOM 1 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM2CE0     = 8,     /*!< IOM2CE0 : IOM 2 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM2CE1     = 9,     /*!< IOM2CE1 : IOM 2 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM2CE2     = 10,    /*!< IOM2CE2 : IOM 2 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM2CE3     = 11,    /*!< IOM2CE3 : IOM 2 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM3CE0     = 12,    /*!< IOM3CE0 : IOM 3 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM3CE1     = 13,    /*!< IOM3CE1 : IOM 3 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM3CE2     = 14,    /*!< IOM3CE2 : IOM 3 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM3CE3     = 15,    /*!< IOM3CE3 : IOM 3 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM4CE0     = 16,    /*!< IOM4CE0 : IOM 4 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM4CE1     = 17,    /*!< IOM4CE1 : IOM 4 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM4CE2     = 18,    /*!< IOM4CE2 : IOM 4 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM4CE3     = 19,    /*!< IOM4CE3 : IOM 4 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM5CE0     = 20,    /*!< IOM5CE0 : IOM 5 NCE 0 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM5CE1     = 21,    /*!< IOM5CE1 : IOM 5 NCE 1 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM5CE2     = 22,    /*!< IOM5CE2 : IOM 5 NCE 2 module                                              */
  GPIO_PINCFG106_NCESRC106_IOM5CE3     = 23,    /*!< IOM5CE3 : IOM 5 NCE 3 module                                              */
  GPIO_PINCFG106_NCESRC106_DC_DPI_DE   = 24,    /*!< DC_DPI_DE : DC DPI DE module                                              */
  GPIO_PINCFG106_NCESRC106_DISP_CONT_CSX = 25,  /*!< DISP_CONT_CSX : DISP CONT CSX module                                      */
  GPIO_PINCFG106_NCESRC106_DC_SPI_CS_N = 26,    /*!< DC_SPI_CS_N : DC SPI CS_N module                                          */
  GPIO_PINCFG106_NCESRC106_DC_QSPI_CS_N = 27,   /*!< DC_QSPI_CS_N : DC QSPI CS_N module                                        */
  GPIO_PINCFG106_NCESRC106_DC_RESX     = 28,    /*!< DC_RESX : DC module RESX                                                  */
} GPIO_PINCFG106_NCESRC106_Enum;

/* ==========================================  GPIO PINCFG106 PULLCFG106 [13..15]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG106_PULLCFG106                                                 */
  GPIO_PINCFG106_PULLCFG106_DIS        = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG106_PULLCFG106_PD50K      = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG106_PULLCFG106_PU15K      = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG106_PULLCFG106_PU6K       = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG106_PULLCFG106_PU12K      = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG106_PULLCFG106_PU24K      = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG106_PULLCFG106_PU50K      = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG106_PULLCFG106_PU100K     = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG106_PULLCFG106_Enum;

