AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =============================================  GPIO PINCFG106 DS106 [10..11]  ============================================= */
typedef enum {                                  /*!< GPIO_PINCFG106_DS106                                                      */
  GPIO_PINCFG106_DS106_0P1X            = 0,     /*!< 0P1X : 0.1x output driver selected                                        */
  GPIO_PINCFG106_DS106_0P5X            = 1,     /*!< 0P5X : 0.5x output driver selected                                        */
  GPIO_PINCFG106_DS106_0P75X           = 2,     /*!< 0P75X : 0.75x output driver selected                                      */
  GPIO_PINCFG106_DS106_1P0X            = 3,     /*!< 1P0X : 1.0x output driver selected                                        */
} GPIO_PINCFG106_DS106_Enum;

/* ============================================  GPIO PINCFG106 OUTCFG106 [8..9]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG106_OUTCFG106                                                  */
  GPIO_PINCFG106_OUTCFG106_DIS         = 0,     /*!< DIS : Output Disabled                                                     */
  GPIO_PINCFG106_OUTCFG106_PUSHPULL    = 1,     /*!< PUSHPULL : Output configured in push pull mode. Will drive 0
                                                     and 1 values on pin.                                                      */
  GPIO_PINCFG106_OUTCFG106_OD          = 2,     /*!< OD : Output configured in open drain mode. Will only drive pin
                                                     low, tristate otherwise.                                                  */
  GPIO_PINCFG106_OUTCFG106_TS          = 3,     /*!< TS : Output configured in Tristate-able push pull mode. Will
                                                     drive 0, 1 of HiZ on pin.                                                 */
} GPIO_PINCFG106_OUTCFG106_Enum;

/* ============================================  GPIO PINCFG106 IRPTEN106 [6..7]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG106_IRPTEN106                                                  */
  GPIO_PINCFG106_IRPTEN106_DIS         = 0,     /*!< DIS : Interrupts are disabled for this GPIO                               */
  GPIO_PINCFG106_IRPTEN106_INTFALL     = 1,     /*!< INTFALL : Interrupts are enabled for falling edge transition
                                                     on this GPIO                                                              */
  GPIO_PINCFG106_IRPTEN106_INTRISE     = 2,     /*!< INTRISE : Interrupts are enabled for rising edge transitions
                                                     on this GPIO                                                              */
  GPIO_PINCFG106_IRPTEN106_INTANY      = 3,     /*!< INTANY : Interrupts are enabled for any edge transition on this
                                                     GPIO                                                                      */
} GPIO_PINCFG106_IRPTEN106_Enum;

/* ============================================  GPIO PINCFG106 FNCSEL106 [0..3]  ============================================ */
typedef enum {                                  /*!< GPIO_PINCFG106_FNCSEL106                                                  */
  GPIO_PINCFG106_FNCSEL106_SLFDINT     = 0,     /*!< SLFDINT : I2C Slave FD1 interrupt                                         */
  GPIO_PINCFG106_FNCSEL106_I2S0_MCLK   = 1,     /*!< I2S0_MCLK : I2S MCLK for external codec. Output from MCU (I2S
                                                     Master/Slave 0)                                                           */
  GPIO_PINCFG106_FNCSEL106_RESERVED2   = 2,     /*!< RESERVED2 : Reserved selection. Operation unknown if selected.            */
  GPIO_PINCFG106_FNCSEL106_GPIO        = 3,     /*!< GPIO : General purpose I/O                                                */
  GPIO_PINCFG106_FNCSEL106_TRIG0       = 4,     /*!< TRIG0 : ADC trigger input 0                                               */
  GPIO_PINCFG106_FNCSEL106_ST_WCI_2W_RXD = 5,   /*!< ST_WCI_2W_RXD : Mobile Wireless Coexistence 2-Wire interface
                                                     - RXD                                                                     */
  GPIO_PINCFG106_FNCSEL106_CT106       = 6,     /*!< CT106 : Timer/Counter input or output; Selection of direction
                                                     is done via CTIMER register settings.                                     */
  GPIO_PINCFG106_FNCSEL106_NCE106      = 7,     /*!< NCE106 : IOMSTR N Chip Select. Polarity is determined by CE_POLARITY
                                                     field                                                                     */
  GPIO_PINCFG106_FNCSEL106_OBSBUS10    = 8,     /*!< OBSBUS10 : Observation bus bit 10                                         */
  GPIO_PINCFG106_FNCSEL106_UART1TX     = 9,     /*!< UART1TX : UART transmit output (UART 1)                                   */
  GPIO_PINCFG106_FNCSEL106_UART0CTS    = 10,    /*!< UART0CTS : UART Clear to Send (CTS) (UART 0)                              */
  GPIO_PINCFG106_FNCSEL106_FPIO        = 11,    /*!< FPIO : Fast PIO                                                           */
  GPIO_PINCFG106_FNCSEL106_RESERVED12  = 12,    /*!< RESERVED12 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG106_FNCSEL106_DBIB_D12    = 13,    /*!< DBIB_D12 : Display DBI Data bit 12                                        */
  GPIO_PINCFG106_FNCSEL106_RESERVED14  = 14,    /*!< RESERVED14 : Reserved selection. Operation unknown if selected.           */
  GPIO_PINCFG106_FNCSEL106_RESERVED15  = 15,    /*!< RESERVED15 : Reserved selection. Operation unknown if selected.           */
} GPIO_PINCFG106_FNCSEL106_Enum;

/* =======================================================  PINCFG107  ======================================================= */
/* =========================================  GPIO PINCFG107 DSPULLCFG107 [28..30]  ========================================== */
typedef enum {                                  /*!< GPIO_PINCFG107_DSPULLCFG107                                               */
  GPIO_PINCFG107_DSPULLCFG107_DIS      = 0,     /*!< DIS : No pullup or pulldown selected                                      */
  GPIO_PINCFG107_DSPULLCFG107_PD50K    = 1,     /*!< PD50K : 50K Pulldown selected                                             */
  GPIO_PINCFG107_DSPULLCFG107_PU15K    = 2,     /*!< PU15K : 1.5K Pullup selected                                              */
  GPIO_PINCFG107_DSPULLCFG107_PU6K     = 3,     /*!< PU6K : 6K Pullup selected                                                 */
  GPIO_PINCFG107_DSPULLCFG107_PU12K    = 4,     /*!< PU12K : 12K Pullup selected                                               */
  GPIO_PINCFG107_DSPULLCFG107_PU24K    = 5,     /*!< PU24K : 24K Pullup selected                                               */
  GPIO_PINCFG107_DSPULLCFG107_PU50K    = 6,     /*!< PU50K : 50K Pullup selected                                               */
  GPIO_PINCFG107_DSPULLCFG107_PU100K   = 7,     /*!< PU100K : 100K Pullup selected                                             */
} GPIO_PINCFG107_DSPULLCFG107_Enum;

/* ==========================================  GPIO PINCFG107 TIMERSEL107 [23..23]  ========================================== */
typedef enum {                                  /*!< GPIO_PINCFG107_TIMERSEL107                                                */
  GPIO_PINCFG107_TIMERSEL107_NS_TIMER  = 0,     /*!< NS_TIMER : Non Secure Timer (1 s-timer + 16 GP timers)                    */
  GPIO_PINCFG107_TIMERSEL107_RSS_TIMER = 1,     /*!< RSS_TIMER : Radio Subsystem Timer (1 s-timer + 4 GP timers)               */
} GPIO_PINCFG107_TIMERSEL107_Enum;

/* ===========================================  GPIO PINCFG107 NCEPOL107 [22..22]  =========================================== */
typedef enum {                                  /*!< GPIO_PINCFG107_NCEPOL107                                                  */
  GPIO_PINCFG107_NCEPOL107_LOW         = 0,     /*!< LOW : Polarity is active low                                              */
  GPIO_PINCFG107_NCEPOL107_HIGH        = 1,     /*!< HIGH : Polarity is active high                                            */
} GPIO_PINCFG107_NCEPOL107_Enum;

