AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ===========================================  MCUCTRL BODISABLE BODFREN [2..2]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODFREN                                                 */
  MCUCTRL_BODISABLE_BODFREN_EN         = 1,     /*!< EN : Enable VDDF Brown Out reset.                                         */
  MCUCTRL_BODISABLE_BODFREN_DIS        = 0,     /*!< DIS : Disable VDDF Brown Out reset.                                       */
} MCUCTRL_BODISABLE_BODFREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODCREN [1..1]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODCREN                                                 */
  MCUCTRL_BODISABLE_BODCREN_EN         = 1,     /*!< EN : Enable VDDC Brown Out reset.                                         */
  MCUCTRL_BODISABLE_BODCREN_DIS        = 0,     /*!< DIS : Disable VDDC Brown Out reset.                                       */
} MCUCTRL_BODISABLE_BODCREN_Enum;

/* ===========================================  MCUCTRL BODISABLE BODLRDE [0..0]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_BODISABLE_BODLRDE                                                 */
  MCUCTRL_BODISABLE_BODLRDE_EN         = 0,     /*!< EN : Enable Unregulated 1.8v brown out reset.                             */
  MCUCTRL_BODISABLE_BODLRDE_DIS        = 1,     /*!< DIS : Disable Unregulated 1.8v brown out reset.                           */
} MCUCTRL_BODISABLE_BODLRDE_Enum;

/* =======================================================  D2ASPARE  ======================================================== */
/* ======================================================  BOOTLOADER  ======================================================= */
/* =======================================  MCUCTRL BOOTLOADER SECBOOTONRST [30..31]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOTONRST                                           */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_DISABLED = 0, /*!< DISABLED : Secure boot disabled                                           */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_ENABLED = 1,  /*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOTONRST_ERROR = 2,    /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOTONRST_Enum;

/* ==========================================  MCUCTRL BOOTLOADER SECBOOT [28..29]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOT                                                */
  MCUCTRL_BOOTLOADER_SECBOOT_DISABLED  = 0,     /*!< DISABLED : Secure boot disabled                                           */
  MCUCTRL_BOOTLOADER_SECBOOT_ENABLED   = 1,     /*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOT_ERROR     = 2,     /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOT_Enum;

/* ======================================  MCUCTRL BOOTLOADER SECBOOTFEATURE [26..27]  ======================================= */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SECBOOTFEATURE                                         */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_DISABLED = 0,/*!< DISABLED : Secure boot disabled                                          */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_ENABLED = 1,/*!< ENABLED : Secure boot enabled                                             */
  MCUCTRL_BOOTLOADER_SECBOOTFEATURE_ERROR = 2,  /*!< ERROR : Error in secure boot configuration                                */
} MCUCTRL_BOOTLOADER_SECBOOTFEATURE_Enum;

/* ==========================================  MCUCTRL BOOTLOADER SBLUNLOCK [3..3]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SBLUNLOCK                                              */
  MCUCTRL_BOOTLOADER_SBLUNLOCK_UNLOCK  = 1,     /*!< UNLOCK : Secure boot is unlocked                                          */
  MCUCTRL_BOOTLOADER_SBLUNLOCK_LOCK    = 0,     /*!< LOCK : Secure boot is locked                                              */
} MCUCTRL_BOOTLOADER_SBLUNLOCK_Enum;

/* =========================================  MCUCTRL BOOTLOADER PROTUNLOCK [2..2]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_PROTUNLOCK                                             */
  MCUCTRL_BOOTLOADER_PROTUNLOCK_UNLOCK = 1,     /*!< UNLOCK : Flash protection is unlocked                                     */
  MCUCTRL_BOOTLOADER_PROTUNLOCK_LOCK   = 0,     /*!< LOCK : Flash protection is locked.                                        */
} MCUCTRL_BOOTLOADER_PROTUNLOCK_Enum;

/* ==========================================  MCUCTRL BOOTLOADER SBRUNLOCK [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_BOOTLOADER_SBRUNLOCK                                              */
  MCUCTRL_BOOTLOADER_SBRUNLOCK_UNLOCK  = 1,     /*!< UNLOCK : Secure boot ROM is unlocked                                      */
  MCUCTRL_BOOTLOADER_SBRUNLOCK_LOCK    = 0,     /*!< LOCK : Secure boot rom is locked.                                         */
} MCUCTRL_BOOTLOADER_SBRUNLOCK_Enum;

/* ======================================================  SHADOWVALID  ====================================================== */
/* =======================================  MCUCTRL SHADOWVALID OTPBOOTFAULT [7..12]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPBOOTFAULT                                          */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_power_fault = 1,/*!< power_fault : Indicate OTP Power fault                                 */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_output_data = 2,/*!< output_data : Conflict on OTP output data                              */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_input_parity = 4,/*!< input_parity : input parity check error                               */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_metal_shielding = 8,/*!< metal_shielding : metal shielding fault                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_fsm_error = 16,/*!< fsm_error : fsm parity error                                            */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_reg_error = 32,/*!< reg_error : critical reg parity error                                   */
  MCUCTRL_SHADOWVALID_OTPBOOTFAULT_no_error = 0,/*!< no_error : No OTP interrupt happens during boot stage                     */
} MCUCTRL_SHADOWVALID_OTPBOOTFAULT_Enum;

/* ==========================================  MCUCTRL SHADOWVALID OTPREADY [6..6]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_OTPREADY                                              */
  MCUCTRL_SHADOWVALID_OTPREADY_VALID   = 1,     /*!< VALID : Indicate OTP is ready for access                                  */
  MCUCTRL_SHADOWVALID_OTPREADY_DEFAULT = 0,     /*!< DEFAULT : Default value.                                                  */
} MCUCTRL_SHADOWVALID_OTPREADY_Enum;

/* ========================================  MCUCTRL SHADOWVALID INFOCSELOTP [5..5]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFOCSELOTP                                           */
  MCUCTRL_SHADOWVALID_INFOCSELOTP_VALID = 1,    /*!< VALID : Indicate Select OTP InfoC                                         */
  MCUCTRL_SHADOWVALID_INFOCSELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, select MRAM InfoC only when GPIO_FORCE_MRAM=1
                                                     .                                                                         */
} MCUCTRL_SHADOWVALID_INFOCSELOTP_Enum;

/* ========================================  MCUCTRL SHADOWVALID INFO0SELOTP [4..4]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_SHADOWVALID_INFO0SELOTP                                           */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_VALID = 1,    /*!< VALID : Indicate select OTP Info0                                         */
  MCUCTRL_SHADOWVALID_INFO0SELOTP_DEFAULT = 0,  /*!< DEFAULT : Default value, Select MRAM Info0                                */
} MCUCTRL_SHADOWVALID_INFO0SELOTP_Enum;

