AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================  MCUCTRL SSRAMMISCCTRL GFXSRAMCHK [0..0]  ======================================== */
typedef enum {                                  /*!< MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK                                          */
  MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK_DIS = 0,     /*!< DIS : Disable sram power domain checking.                                 */
  MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK_EN  = 1,     /*!< EN : Enable sram power domain checking                                    */
} MCUCTRL_SSRAMMISCCTRL_GFXSRAMCHK_Enum;

/* ======================================================  DISPSTATUS  ======================================================= */
/* ========================================================  CPUCFG  ========================================================= */
/* ========================================================  PLLCTL0  ======================================================== */
/* ========================================  MCUCTRL PLLCTL0 SYSPLLVDDFPDN [31..31]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLVDDFPDN                                             */
  MCUCTRL_PLLCTL0_SYSPLLVDDFPDN_DISABLE = 1,    /*!< DISABLE : VDDF power down                                                 */
  MCUCTRL_PLLCTL0_SYSPLLVDDFPDN_ENABLE = 0,     /*!< ENABLE : VDDF enable                                                      */
} MCUCTRL_PLLCTL0_SYSPLLVDDFPDN_Enum;

/* ========================================  MCUCTRL PLLCTL0 SYSPLLVDDHPDN [30..30]  ========================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLVDDHPDN                                             */
  MCUCTRL_PLLCTL0_SYSPLLVDDHPDN_DISABLE = 1,    /*!< DISABLE : VDDH power down                                                 */
  MCUCTRL_PLLCTL0_SYSPLLVDDHPDN_ENABLE = 0,     /*!< ENABLE : VDDH enable                                                      */
} MCUCTRL_PLLCTL0_SYSPLLVDDHPDN_Enum;

/* ==========================================  MCUCTRL PLLCTL0 SYSPLLPDB [29..29]  =========================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_SYSPLLPDB                                                 */
  MCUCTRL_PLLCTL0_SYSPLLPDB_DISABLE    = 0,     /*!< DISABLE : PLL disable                                                     */
  MCUCTRL_PLLCTL0_SYSPLLPDB_ENABLE     = 1,     /*!< ENABLE : PLL enable : always enable VDDH and VDDF power rails
                                                     1us earlier than enable this bit to make PLL work                         */
} MCUCTRL_PLLCTL0_SYSPLLPDB_Enum;

/* ===========================================  MCUCTRL PLLCTL0 VCOSELECT [9..9]  ============================================ */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_VCOSELECT                                                 */
  MCUCTRL_PLLCTL0_VCOSELECT_VCOLO      = 0,     /*!< VCOLO : VCO operates in the range 60MHz - 240MHz                          */
  MCUCTRL_PLLCTL0_VCOSELECT_VCOHI      = 1,     /*!< VCOHI : VCO operates in the range 240MHz - 960MHz                         */
} MCUCTRL_PLLCTL0_VCOSELECT_Enum;

/* =============================================  MCUCTRL PLLCTL0 BYPASS [8..8]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_BYPASS                                                    */
  MCUCTRL_PLLCTL0_BYPASS_NORMAL        = 0,     /*!< NORMAL : Normal operation                                                 */
  MCUCTRL_PLLCTL0_BYPASS_BYPASS        = 1,     /*!< BYPASS : FREF is bypassed to FOUTPOSTDIV                                  */
} MCUCTRL_PLLCTL0_BYPASS_Enum;

/* ============================================  MCUCTRL PLLCTL0 FREFSEL [5..6]  ============================================= */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_FREFSEL                                                   */
  MCUCTRL_PLLCTL0_FREFSEL_HFRC192DIV4  = 0,     /*!< HFRC192DIV4 : Select HFRC 192MHz DIV4 Clock Source (From CLKGEN)          */
  MCUCTRL_PLLCTL0_FREFSEL_EXTREFCLK    = 1,     /*!< EXTREFCLK : Select external reference clock (from GPIO)                   */
  MCUCTRL_PLLCTL0_FREFSEL_RFXTAL48MHZ  = 2,     /*!< RFXTAL48MHZ : Select high frequency crystal oscillator output
                                                     (e.g. 32 MHz)                                                             */
} MCUCTRL_PLLCTL0_FREFSEL_Enum;

/* =============================================  MCUCTRL PLLCTL0 DACPD [4..4]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_DACPD                                                     */
  MCUCTRL_PLLCTL0_DACPD_ACTIVE         = 0,     /*!< ACTIVE : Noise canceling DAC is active                                    */
  MCUCTRL_PLLCTL0_DACPD_POWERDOWN      = 1,     /*!< POWERDOWN : Power down noise canceling DAC (test mode only)               */
} MCUCTRL_PLLCTL0_DACPD_Enum;

/* =============================================  MCUCTRL PLLCTL0 DSMPD [3..3]  ============================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_DSMPD                                                     */
  MCUCTRL_PLLCTL0_DSMPD_ACTIVE         = 0,     /*!< ACTIVE : DSM is active                                                    */
  MCUCTRL_PLLCTL0_DSMPD_POWERDOWN      = 1,     /*!< POWERDOWN : DSM is powered down                                           */
} MCUCTRL_PLLCTL0_DSMPD_Enum;

/* ==========================================  MCUCTRL PLLCTL0 FOUT4PHASEPD [2..2]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_FOUT4PHASEPD                                              */
  MCUCTRL_PLLCTL0_FOUT4PHASEPD_ACTIVE  = 0,     /*!< ACTIVE : Four phase clock generator and outputs are enabled               */
  MCUCTRL_PLLCTL0_FOUT4PHASEPD_POWERDOWN = 1,   /*!< POWERDOWN : Four phase clock generator and outputs are disabled           */
} MCUCTRL_PLLCTL0_FOUT4PHASEPD_Enum;

/* =========================================  MCUCTRL PLLCTL0 FOUTPOSTDIVPD [1..1]  ========================================== */
typedef enum {                                  /*!< MCUCTRL_PLLCTL0_FOUTPOSTDIVPD                                             */
  MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_ACTIVE = 0,     /*!< ACTIVE : Post divider enabled                                             */
  MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_POWERDOWN = 1,  /*!< POWERDOWN : Post divider disabled                                         */
} MCUCTRL_PLLCTL0_FOUTPOSTDIVPD_Enum;

