AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =======================================================  CQCURIDX  ======================================================== */
/* =======================================================  CQENDIDX  ======================================================== */


/* =========================================================================================================================== */
/* ================                                            OTP                                            ================ */
/* =========================================================================================================================== */

/* ==========================================================  RNG  ========================================================== */
/* =======================================================  INTERRUPT  ======================================================= */
/* ==========================================  OTP INTERRUPT IERNGCLKOFF [25..25]  =========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_IERNGCLKOFF                                                 */
  OTP_INTERRUPT_IERNGCLKOFF_DISABLE    = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IERNGCLKOFF_ENABLE     = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IERNGCLKOFF_Enum;

/* ===========================================  OTP INTERRUPT IERNGFAIL [24..24]  ============================================ */
typedef enum {                                  /*!< OTP_INTERRUPT_IERNGFAIL                                                   */
  OTP_INTERRUPT_IERNGFAIL_DISABLE      = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IERNGFAIL_ENABLE       = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IERNGFAIL_Enum;

/* ========================================  OTP INTERRUPT IEPARITYCRITREG [22..22]  ========================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_IEPARITYCRITREG                                             */
  OTP_INTERRUPT_IEPARITYCRITREG_DISABLE = 0,    /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEPARITYCRITREG_ENABLE = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEPARITYCRITREG_Enum;

/* ==========================================  OTP INTERRUPT IEPARITYPSM [21..21]  =========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_IEPARITYPSM                                                 */
  OTP_INTERRUPT_IEPARITYPSM_DISABLE    = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEPARITYPSM_ENABLE     = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEPARITYPSM_Enum;

/* =======================================  OTP INTERRUPT IEACCESSPERMISSION [20..20]  ======================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_IEACCESSPERMISSION                                          */
  OTP_INTERRUPT_IEACCESSPERMISSION_DISABLE = 0, /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEACCESSPERMISSION_ENABLE = 1,  /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEACCESSPERMISSION_Enum;

/* =========================================  OTP INTERRUPT IESHIELFFAULT [19..19]  ========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_IESHIELFFAULT                                               */
  OTP_INTERRUPT_IESHIELFFAULT_DISABLE  = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IESHIELFFAULT_ENABLE   = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IESHIELFFAULT_Enum;

/* =========================================  OTP INTERRUPT IEPARITYINPUT [18..18]  ========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_IEPARITYINPUT                                               */
  OTP_INTERRUPT_IEPARITYINPUT_DISABLE  = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEPARITYINPUT_ENABLE   = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEPARITYINPUT_Enum;

/* ===========================================  OTP INTERRUPT IEOUTDATA [17..17]  ============================================ */
typedef enum {                                  /*!< OTP_INTERRUPT_IEOUTDATA                                                   */
  OTP_INTERRUPT_IEOUTDATA_DISABLE      = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEOUTDATA_ENABLE       = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEOUTDATA_Enum;

/* ==========================================  OTP INTERRUPT IEPWRSUPPLY [16..16]  =========================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_IEPWRSUPPLY                                                 */
  OTP_INTERRUPT_IEPWRSUPPLY_DISABLE    = 0,     /*!< DISABLE : Disable interrupt.                                              */
  OTP_INTERRUPT_IEPWRSUPPLY_ENABLE     = 1,     /*!< ENABLE : Enable interrupt.                                                */
} OTP_INTERRUPT_IEPWRSUPPLY_Enum;

/* ============================================  OTP INTERRUPT RNGCLKOFF [9..9]  ============================================= */
typedef enum {                                  /*!< OTP_INTERRUPT_RNGCLKOFF                                                   */
  OTP_INTERRUPT_RNGCLKOFF_NOINTERR     = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_RNGCLKOFF_INTERR       = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_RNGCLKOFF_Enum;

/* =============================================  OTP INTERRUPT RNGFAIL [8..8]  ============================================== */
typedef enum {                                  /*!< OTP_INTERRUPT_RNGFAIL                                                     */
  OTP_INTERRUPT_RNGFAIL_NOINTERR       = 0,     /*!< NOINTERR : No interrupt error detected.                                   */
  OTP_INTERRUPT_RNGFAIL_INTERR         = 1,     /*!< INTERR : Interrupt error detected.                                        */
} OTP_INTERRUPT_RNGFAIL_Enum;

