AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==============================================  PDM0 CORECFG0 ADCHPD [9..9]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG0_ADCHPD                                                      */
  PDM0_CORECFG0_ADCHPD_DIS             = 0,     /*!< DIS : Disable high pass filter.                                           */
  PDM0_CORECFG0_ADCHPD_EN              = 1,     /*!< EN : Enable high pass filter.                                             */
} PDM0_CORECFG0_ADCHPD_Enum;

/* =============================================  PDM0 CORECFG0 SCYCLES [2..4]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG0_SCYCLES                                                     */
  PDM0_CORECFG0_SCYCLES_0CYCLES        = 0,     /*!< 0CYCLES : Zero PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_1CYCLES        = 1,     /*!< 1CYCLES : One PDMA_CK0 clock cycle during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_2CYCLES        = 2,     /*!< 2CYCLES : Two PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_3CYCLES        = 3,     /*!< 3CYCLES : Three PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_4CYCLES        = 4,     /*!< 4CYCLES : Four PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_5CYCLES        = 5,     /*!< 5CYCLES : Five PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_6CYCLES        = 6,     /*!< 6CYCLES : Six PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
  PDM0_CORECFG0_SCYCLES_7CYCLES        = 7,     /*!< 7CYCLES : Seven PDMA_CK0 clock cycles during gain setting changes
                                                     or soft mute.                                                             */
} PDM0_CORECFG0_SCYCLES_Enum;

/* ==============================================  PDM0 CORECFG0 LRSWAP [0..0]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG0_LRSWAP                                                      */
  PDM0_CORECFG0_LRSWAP_DIS             = 0,     /*!< DIS : Disable left/right channel swapping.                                */
  PDM0_CORECFG0_LRSWAP_EN              = 1,     /*!< EN : Enable left/right channel swapping.                                  */
} PDM0_CORECFG0_LRSWAP_Enum;

/* =======================================================  CORECFG1  ======================================================== */
/* ==============================================  PDM0 CORECFG1 CASES [8..11]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG1_CASES                                                       */
  PDM0_CORECFG1_CASES_CUSTOM           = 0,     /*!< CUSTOM : users can config different frequencies , not constrainted
                                                     by CASES.                                                                 */
  PDM0_CORECFG1_CASES_CASE1            = 1,     /*!< CASE1 : FPDMA_CKO = 0.4MHz; FS = 8kHz, OSR =50                            */
  PDM0_CORECFG1_CASES_CASE2            = 2,     /*!< CASE2 : FPDMA_CKO = 0.8MHz; FS = 8kHz, OSR =100                           */
  PDM0_CORECFG1_CASES_CASE3            = 3,     /*!< CASE3 : FPDMA_CKO = 0.8MHz; FS = 16kHz, OSR =50                           */
  PDM0_CORECFG1_CASES_CASE4            = 4,     /*!< CASE4 : FPDMA_CKO = 0.512MHz; FS = 8kHz, OSR =64                          */
  PDM0_CORECFG1_CASES_CASE5            = 5,     /*!< CASE5 : FPDMA_CKO = 0.768MHz; FS = 16kHz, OSR =48                         */
  PDM0_CORECFG1_CASES_CASE6            = 6,     /*!< CASE6 : FPDMA_CKO = 1.024MHz; FS = 8kHz, OSR =128                         */
  PDM0_CORECFG1_CASES_CASE7            = 7,     /*!< CASE7 : FPDMA_CKO = 2.048MHz; FS =16kHz, OSR =128                         */
  PDM0_CORECFG1_CASES_CASE8            = 8,     /*!< CASE8 : FPDMA_CKO = 3.072MHz; FS =24kHz, OSR =128                         */
  PDM0_CORECFG1_CASES_CASE9            = 9,     /*!< CASE9 : FPDMA_CKO = 3.072MHz; FS = 32kHz, OSR =96                         */
  PDM0_CORECFG1_CASES_CASE10           = 10,    /*!< CASE10 : FPDMA_CKO = 3.072MHz; FS = 48kHz, OSR =64                        */
} PDM0_CORECFG1_CASES_Enum;

/* =============================================  PDM0 CORECFG1 SELSTEP [7..7]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG1_SELSTEP                                                     */
  PDM0_CORECFG1_SELSTEP_0_13DB         = 0,     /*!< 0_13DB : 0.13dB fine grain step size.                                     */
  PDM0_CORECFG1_SELSTEP_0_26DB         = 1,     /*!< 0_26DB : 0.26dB fine grain step size.                                     */
} PDM0_CORECFG1_SELSTEP_Enum;

/* ==============================================  PDM0 CORECFG1 CKODLY [4..6]  ============================================== */
typedef enum {                                  /*!< PDM0_CORECFG1_CKODLY                                                      */
  PDM0_CORECFG1_CKODLY_0CYCLES         = 0,     /*!< 0CYCLES : No extra PDMCLK cycle delays.                                   */
  PDM0_CORECFG1_CKODLY_1CYCLES         = 1,     /*!< 1CYCLES : One xtra PDMCLK cycle delay.                                    */
  PDM0_CORECFG1_CKODLY_2CYCLES         = 2,     /*!< 2CYCLES : Two extra PDMCLK cycle delays.                                  */
  PDM0_CORECFG1_CKODLY_3CYCLES         = 3,     /*!< 3CYCLES : Three extra PDMCLK cycle delays.                                */
  PDM0_CORECFG1_CKODLY_4CYCLES         = 4,     /*!< 4CYCLES : Four extra PDMCLK cycle delays.                                 */
  PDM0_CORECFG1_CKODLY_5CYCLES         = 5,     /*!< 5CYCLES : Five extra PDMCLK cycle delays.                                 */
  PDM0_CORECFG1_CKODLY_6CYCLES         = 6,     /*!< 6CYCLES : Six extra PDMCLK cycle delays.                                  */
  PDM0_CORECFG1_CKODLY_7CYCLES         = 7,     /*!< 7CYCLES : Seven extra PDMCLK cycle delays.                                */
} PDM0_CORECFG1_CKODLY_Enum;

