AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ===========================================  SDIO0 HOSTCTRL1 SPIMODE [20..20]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_SPIMODE                                                   */
  SDIO0_HOSTCTRL1_SPIMODE_SPI          = 1,     /*!< SPI : SPI mode                                                            */
  SDIO0_HOSTCTRL1_SPIMODE_SD           = 0,     /*!< SD : SD mode                                                              */
} SDIO0_HOSTCTRL1_SPIMODE_Enum;

/* =========================================  SDIO0 HOSTCTRL1 READWAITCTRL [18..18]  ========================================= */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_READWAITCTRL                                              */
  SDIO0_HOSTCTRL1_READWAITCTRL_ENABLE  = 1,     /*!< ENABLE : Enable Read Wait Control                                         */
  SDIO0_HOSTCTRL1_READWAITCTRL_DISABLE = 0,     /*!< DISABLE : Disable Read Wait Control                                       */
} SDIO0_HOSTCTRL1_READWAITCTRL_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 CONTREQ [17..17]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_CONTREQ                                                   */
  SDIO0_HOSTCTRL1_CONTREQ_RESTART      = 1,     /*!< RESTART : Restart                                                         */
  SDIO0_HOSTCTRL1_CONTREQ_IGNORED      = 0,     /*!< IGNORED : Ignored                                                         */
} SDIO0_HOSTCTRL1_CONTREQ_Enum;

/* ====================================  SDIO0 HOSTCTRL1 STOPATBLOCKGAPREQUEST [16..16]  ===================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST                                     */
  SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST_STOP = 1,/*!< STOP : Stop                                                              */
  SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST_TRANSFER = 0,/*!< TRANSFER : Transfer                                                  */
} SDIO0_HOSTCTRL1_STOPATBLOCKGAPREQUEST_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 HWRESET [12..12]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_HWRESET                                                   */
  SDIO0_HOSTCTRL1_HWRESET_ASSERT       = 1,     /*!< ASSERT : Drives the hardware reset pin as ZERO (Active LOW to
                                                     eMMC card)                                                                */
  SDIO0_HOSTCTRL1_HWRESET_DEASSERT     = 0,     /*!< DEASSERT : Deassert the hardware reset pin                                */
} SDIO0_HOSTCTRL1_HWRESET_Enum;

/* ==========================================  SDIO0 HOSTCTRL1 VOLTSELECT [9..11]  =========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_VOLTSELECT                                                */
  SDIO0_HOSTCTRL1_VOLTSELECT_3_3V      = 7,     /*!< 3_3V : 3.3 V(Typ.)                                                        */
  SDIO0_HOSTCTRL1_VOLTSELECT_3_0V      = 6,     /*!< 3_0V : 3.0 V(Typ.)                                                        */
  SDIO0_HOSTCTRL1_VOLTSELECT_1_8V      = 5,     /*!< 1_8V : 1.8 V(Typ.)                                                        */
} SDIO0_HOSTCTRL1_VOLTSELECT_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 SDBUSPOWER [8..8]  =========================================== */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_SDBUSPOWER                                                */
  SDIO0_HOSTCTRL1_SDBUSPOWER_POWERON   = 1,     /*!< POWERON : Power on                                                        */
  SDIO0_HOSTCTRL1_SDBUSPOWER_POWEROFF  = 0,     /*!< POWEROFF : Power off                                                      */
} SDIO0_HOSTCTRL1_SDBUSPOWER_Enum;

/* ============================================  SDIO0 HOSTCTRL1 CARDSRC [7..7]  ============================================= */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_CARDSRC                                                   */
  SDIO0_HOSTCTRL1_CARDSRC_TEST         = 1,     /*!< TEST : The card detect test level is selected                             */
  SDIO0_HOSTCTRL1_CARDSRC_SDCD         = 0,     /*!< SDCD : SDCD is selected (for normal use)                                  */
} SDIO0_HOSTCTRL1_CARDSRC_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 TESTLEVEL [6..6]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_TESTLEVEL                                                 */
  SDIO0_HOSTCTRL1_TESTLEVEL_CARDINSERTED = 1,   /*!< CARDINSERTED : Card Inserted                                              */
  SDIO0_HOSTCTRL1_TESTLEVEL_NOCARD     = 0,     /*!< NOCARD : No Card                                                          */
} SDIO0_HOSTCTRL1_TESTLEVEL_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 XFERWIDTH [5..5]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_XFERWIDTH                                                 */
  SDIO0_HOSTCTRL1_XFERWIDTH_8BIT       = 1,     /*!< 8BIT : 8-bit Bus Width                                                    */
  SDIO0_HOSTCTRL1_XFERWIDTH_XFER       = 0,     /*!< XFER : Bus Width is selected by Data Transfer Width                       */
} SDIO0_HOSTCTRL1_XFERWIDTH_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 DMASELECT [3..4]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_DMASELECT                                                 */
  SDIO0_HOSTCTRL1_DMASELECT_SDMA       = 0,     /*!< SDMA : SDMA is selected                                                   */
  SDIO0_HOSTCTRL1_DMASELECT_ADMA132    = 1,     /*!< ADMA132 : 32-bit Address ADMA1 is selected                                */
  SDIO0_HOSTCTRL1_DMASELECT_ADMA232    = 2,     /*!< ADMA232 : 32-bit Address ADMA2 is selected                                */
  SDIO0_HOSTCTRL1_DMASELECT_ADMA264    = 3,     /*!< ADMA264 : 64-bit Address ADMA2 is selected                                */
} SDIO0_HOSTCTRL1_DMASELECT_Enum;

/* ===========================================  SDIO0 HOSTCTRL1 HISPEEDEN [2..2]  ============================================ */
typedef enum {                                  /*!< SDIO0_HOSTCTRL1_HISPEEDEN                                                 */
  SDIO0_HOSTCTRL1_HISPEEDEN_HIGH       = 1,     /*!< HIGH : High Speed Mode                                                    */
  SDIO0_HOSTCTRL1_HISPEEDEN_NORMAL     = 0,     /*!< NORMAL : Normal Speed Mode                                                */
} SDIO0_HOSTCTRL1_HISPEEDEN_Enum;

