AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =============================================  SDIO0 INTSIG INTBEN [10..10]  ============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_INTBEN                                                       */
  SDIO0_INTSIG_INTBEN_MASKED           = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_INTBEN_ENABLED          = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_INTBEN_Enum;

/* ==============================================  SDIO0 INTSIG INTAEN [9..9]  =============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_INTAEN                                                       */
  SDIO0_INTSIG_INTAEN_MASKED           = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_INTAEN_ENABLED          = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_INTAEN_Enum;

/* =============================================  SDIO0 INTSIG CARDINTEN [8..8]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_CARDINTEN                                                    */
  SDIO0_INTSIG_CARDINTEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CARDINTEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CARDINTEN_Enum;

/* ===========================================  SDIO0 INTSIG CARDREMOVALEN [7..7]  =========================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CARDREMOVALEN                                                */
  SDIO0_INTSIG_CARDREMOVALEN_MASKED    = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CARDREMOVALEN_ENABLED   = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CARDREMOVALEN_Enum;

/* ===========================================  SDIO0 INTSIG CARDINSERTEN [6..6]  ============================================ */
typedef enum {                                  /*!< SDIO0_INTSIG_CARDINSERTEN                                                 */
  SDIO0_INTSIG_CARDINSERTEN_MASKED     = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CARDINSERTEN_ENABLED    = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CARDINSERTEN_Enum;

/* ============================================  SDIO0 INTSIG BUFFERRDEN [5..5]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_BUFFERRDEN                                                   */
  SDIO0_INTSIG_BUFFERRDEN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_BUFFERRDEN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_BUFFERRDEN_Enum;

/* ============================================  SDIO0 INTSIG BUFFERWREN [4..4]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_BUFFERWREN                                                   */
  SDIO0_INTSIG_BUFFERWREN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_BUFFERWREN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_BUFFERWREN_Enum;

/* =============================================  SDIO0 INTSIG DMAINTEN [3..3]  ============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_DMAINTEN                                                     */
  SDIO0_INTSIG_DMAINTEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_DMAINTEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_DMAINTEN_Enum;

/* ============================================  SDIO0 INTSIG BLOCKGAPEN [2..2]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_BLOCKGAPEN                                                   */
  SDIO0_INTSIG_BLOCKGAPEN_MASKED       = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_BLOCKGAPEN_ENABLED      = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_BLOCKGAPEN_Enum;

/* =============================================  SDIO0 INTSIG XFERCMPEN [1..1]  ============================================= */
typedef enum {                                  /*!< SDIO0_INTSIG_XFERCMPEN                                                    */
  SDIO0_INTSIG_XFERCMPEN_MASKED        = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_XFERCMPEN_ENABLED       = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_XFERCMPEN_Enum;

/* =============================================  SDIO0 INTSIG CMDCMPEN [0..0]  ============================================== */
typedef enum {                                  /*!< SDIO0_INTSIG_CMDCMPEN                                                     */
  SDIO0_INTSIG_CMDCMPEN_MASKED         = 0,     /*!< MASKED : Masked                                                           */
  SDIO0_INTSIG_CMDCMPEN_ENABLED        = 1,     /*!< ENABLED : Enabled                                                         */
} SDIO0_INTSIG_CMDCMPEN_Enum;

/* =========================================================  AUTO  ========================================================== */
/* =============================================  SDIO0 AUTO PRESETEN [31..31]  ============================================== */
typedef enum {                                  /*!< SDIO0_AUTO_PRESETEN                                                       */
  SDIO0_AUTO_PRESETEN_AUTOEN           = 1,     /*!< AUTOEN : Automatic Selection by Preset Value are Enabled                  */
  SDIO0_AUTO_PRESETEN_HOSTCTRL         = 0,     /*!< HOSTCTRL : SDCLK and Driver Strength are controlled by Host
                                                     Driver                                                                    */
} SDIO0_AUTO_PRESETEN_Enum;

/* ============================================  SDIO0 AUTO ASYNCINTEN [30..30]  ============================================= */
typedef enum {                                  /*!< SDIO0_AUTO_ASYNCINTEN                                                     */
  SDIO0_AUTO_ASYNCINTEN_ENABLED        = 1,     /*!< ENABLED : Enabled,                                                        */
  SDIO0_AUTO_ASYNCINTEN_DISABLED       = 0,     /*!< DISABLED : Disabled                                                       */
} SDIO0_AUTO_ASYNCINTEN_Enum;

/* ============================================  SDIO0 AUTO SAMPLCLKSEL [23..23]  ============================================ */
typedef enum {                                  /*!< SDIO0_AUTO_SAMPLCLKSEL                                                    */
  SDIO0_AUTO_SAMPLCLKSEL_TUNEDCLK      = 1,     /*!< TUNEDCLK : Tuned clock is used to sample data                             */
  SDIO0_AUTO_SAMPLCLKSEL_FIXEDCLK      = 0,     /*!< FIXEDCLK : Fixed clock is used to sample data                             */
} SDIO0_AUTO_SAMPLCLKSEL_Enum;

/* ============================================  SDIO0 AUTO STARTTUNING [22..22]  ============================================ */
typedef enum {                                  /*!< SDIO0_AUTO_STARTTUNING                                                    */
  SDIO0_AUTO_STARTTUNING_TUNESTART     = 1,     /*!< TUNESTART : Execute Tuning,                                               */
  SDIO0_AUTO_STARTTUNING_TUNECMP       = 0,     /*!< TUNECMP : Not Tuned or Tuning Completed                                   */
} SDIO0_AUTO_STARTTUNING_Enum;

/* ============================================  SDIO0 AUTO DRVRSTRSEL [20..21]  ============================================= */
typedef enum {                                  /*!< SDIO0_AUTO_DRVRSTRSEL                                                     */
  SDIO0_AUTO_DRVRSTRSEL_DRVRB          = 0,     /*!< DRVRB : Driver Type B is Selected (Default)                               */
  SDIO0_AUTO_DRVRSTRSEL_DRVRA          = 1,     /*!< DRVRA : Driver Type A is Selected                                         */
  SDIO0_AUTO_DRVRSTRSEL_DRVRC          = 2,     /*!< DRVRC : Driver Type C is Selected                                         */
  SDIO0_AUTO_DRVRSTRSEL_DRVRD          = 3,     /*!< DRVRD : Driver Type D is Selected                                         */
} SDIO0_AUTO_DRVRSTRSEL_Enum;

/* ============================================  SDIO0 AUTO SIGNALVOLT [19..19]  ============================================= */
typedef enum {                                  /*!< SDIO0_AUTO_SIGNALVOLT                                                     */
  SDIO0_AUTO_SIGNALVOLT_1_8V           = 1,     /*!< 1_8V : 1.8V Signaling                                                     */
  SDIO0_AUTO_SIGNALVOLT_3_3V           = 0,     /*!< 3_3V : 3.3V Signaling                                                     */
} SDIO0_AUTO_SIGNALVOLT_Enum;

/* ============================================  SDIO0 AUTO UHSMODESEL [16..18]  ============================================= */
typedef enum {                                  /*!< SDIO0_AUTO_UHSMODESEL                                                     */
  SDIO0_AUTO_UHSMODESEL_SDR12          = 0,     /*!< SDR12 : UHS-I mode SDR12                                                  */
  SDIO0_AUTO_UHSMODESEL_SDR25          = 1,     /*!< SDR25 : UHS-I mode SDR25                                                  */
  SDIO0_AUTO_UHSMODESEL_SDR50          = 2,     /*!< SDR50 : UHS-I mode SDR50                                                  */
  SDIO0_AUTO_UHSMODESEL_SDR104         = 3,     /*!< SDR104 : UHS-I mode SDR104                                                */
  SDIO0_AUTO_UHSMODESEL_DDR50          = 4,     /*!< DDR50 : UHS-I mode DDR50                                                  */
} SDIO0_AUTO_UHSMODESEL_Enum;

/* ===========================================  SDIO0 AUTO NOTAUTOCMD12ERR [7..7]  =========================================== */
typedef enum {                                  /*!< SDIO0_AUTO_NOTAUTOCMD12ERR                                                */
  SDIO0_AUTO_NOTAUTOCMD12ERR_NOERROR   = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_AUTO_NOTAUTOCMD12ERR_ERROR     = 1,     /*!< ERROR : Not Issued                                                        */
} SDIO0_AUTO_NOTAUTOCMD12ERR_Enum;

/* ==============================================  SDIO0 AUTO CMDIDXERR [4..4]  ============================================== */
typedef enum {                                  /*!< SDIO0_AUTO_CMDIDXERR                                                      */
  SDIO0_AUTO_CMDIDXERR_NOERROR         = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_AUTO_CMDIDXERR_ERROR           = 1,     /*!< ERROR : Error                                                             */
} SDIO0_AUTO_CMDIDXERR_Enum;

