AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==============================================  SDIO0 AUTO CMDENDERR [3..3]  ============================================== */
typedef enum {                                  /*!< SDIO0_AUTO_CMDENDERR                                                      */
  SDIO0_AUTO_CMDENDERR_NOERROR         = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_AUTO_CMDENDERR_ERROR           = 1,     /*!< ERROR : End Bit Error Generated                                           */
} SDIO0_AUTO_CMDENDERR_Enum;

/* ==============================================  SDIO0 AUTO CMDCRCERR [2..2]  ============================================== */
typedef enum {                                  /*!< SDIO0_AUTO_CMDCRCERR                                                      */
  SDIO0_AUTO_CMDCRCERR_NOERROR         = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_AUTO_CMDCRCERR_ERROR           = 1,     /*!< ERROR : CRC Error Generated                                               */
} SDIO0_AUTO_CMDCRCERR_Enum;

/* ==============================================  SDIO0 AUTO CMDTOERR [1..1]  =============================================== */
typedef enum {                                  /*!< SDIO0_AUTO_CMDTOERR                                                       */
  SDIO0_AUTO_CMDTOERR_NOERROR          = 0,     /*!< NOERROR : No Error                                                        */
  SDIO0_AUTO_CMDTOERR_ERROR            = 1,     /*!< ERROR : Timeout                                                           */
} SDIO0_AUTO_CMDTOERR_Enum;

/* ============================================  SDIO0 AUTO CMD12NOTEXEC [0..0]  ============================================= */
typedef enum {                                  /*!< SDIO0_AUTO_CMD12NOTEXEC                                                   */
  SDIO0_AUTO_CMD12NOTEXEC_EXECUTED     = 0,     /*!< EXECUTED : Executed                                                       */
  SDIO0_AUTO_CMD12NOTEXEC_NOTEXECUTED  = 1,     /*!< NOTEXECUTED : Not Executed                                                */
} SDIO0_AUTO_CMD12NOTEXEC_Enum;

/* =====================================================  CAPABILITIES0  ===================================================== */
/* =========================================  SDIO0 CAPABILITIES0 SLOTTYPE [30..31]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_SLOTTYPE                                              */
  SDIO0_CAPABILITIES0_SLOTTYPE_REMOVABLE = 0,   /*!< REMOVABLE : Removable card slot                                           */
  SDIO0_CAPABILITIES0_SLOTTYPE_EMBEDDED = 1,    /*!< EMBEDDED : Embedded Slot for One Device                                   */
  SDIO0_CAPABILITIES0_SLOTTYPE_SHARED  = 2,     /*!< SHARED : Shared Bus Slot                                                  */
} SDIO0_CAPABILITIES0_SLOTTYPE_Enum;

/* =========================================  SDIO0 CAPABILITIES0 ASYNCINT [29..29]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_ASYNCINT                                              */
  SDIO0_CAPABILITIES0_ASYNCINT_SUPPORTED = 1,   /*!< SUPPORTED : Asynchronous Interrupt Supported                              */
  SDIO0_CAPABILITIES0_ASYNCINT_NOTSUPPORTED = 0,/*!< NOTSUPPORTED : Asynchronous Interrupt Not Supported                       */
} SDIO0_CAPABILITIES0_ASYNCINT_Enum;

/* =========================================  SDIO0 CAPABILITIES0 SYSBUS64 [28..28]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_SYSBUS64                                              */
  SDIO0_CAPABILITIES0_SYSBUS64_SUPPORTED = 1,   /*!< SUPPORTED : Supports 64 bit system address                                */
  SDIO0_CAPABILITIES0_SYSBUS64_NOTSUPPORTED = 0,/*!< NOTSUPPORTED : Does not support 64 bit system address                     */
} SDIO0_CAPABILITIES0_SYSBUS64_Enum;

/* =========================================  SDIO0 CAPABILITIES0 VOLT18V [26..26]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_VOLT18V                                               */
  SDIO0_CAPABILITIES0_VOLT18V_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : 1.8 V Not Supported                                        */
  SDIO0_CAPABILITIES0_VOLT18V_SUPPORTED = 1,    /*!< SUPPORTED : 1.8 V Supported                                               */
} SDIO0_CAPABILITIES0_VOLT18V_Enum;

/* =========================================  SDIO0 CAPABILITIES0 VOLT30V [25..25]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_VOLT30V                                               */
  SDIO0_CAPABILITIES0_VOLT30V_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : 3.0 V Not Supported                                        */
  SDIO0_CAPABILITIES0_VOLT30V_SUPPORTED = 1,    /*!< SUPPORTED : 3.0 V Supported                                               */
} SDIO0_CAPABILITIES0_VOLT30V_Enum;

/* =========================================  SDIO0 CAPABILITIES0 VOLT33V [24..24]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_VOLT33V                                               */
  SDIO0_CAPABILITIES0_VOLT33V_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : 3.3 V Not Supported                                        */
  SDIO0_CAPABILITIES0_VOLT33V_SUPPORTED = 1,    /*!< SUPPORTED : 3.3 V Supported                                               */
} SDIO0_CAPABILITIES0_VOLT33V_Enum;

/* =========================================  SDIO0 CAPABILITIES0 SUSPRES [23..23]  ========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_SUSPRES                                               */
  SDIO0_CAPABILITIES0_SUSPRES_NOTSUPPORTED = 0, /*!< NOTSUPPORTED : Suspend / Resume Not Supported                             */
  SDIO0_CAPABILITIES0_SUSPRES_SUPPORTED = 1,    /*!< SUPPORTED : Suspend / Resume Supported                                    */
} SDIO0_CAPABILITIES0_SUSPRES_Enum;

/* ===========================================  SDIO0 CAPABILITIES0 SDMA [22..22]  =========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_SDMA                                                  */
  SDIO0_CAPABILITIES0_SDMA_NOTSUPPORTED = 0,    /*!< NOTSUPPORTED : SDMA Not Supported                                         */
  SDIO0_CAPABILITIES0_SDMA_SUPPORTED   = 1,     /*!< SUPPORTED : SDMA Supported.                                               */
} SDIO0_CAPABILITIES0_SDMA_Enum;

/* ========================================  SDIO0 CAPABILITIES0 HIGHSPEED [21..21]  ========================================= */
typedef enum {                                  /*!< SDIO0_CAPABILITIES0_HIGHSPEED                                             */
  SDIO0_CAPABILITIES0_HIGHSPEED_NOTSUPPORTED = 0,/*!< NOTSUPPORTED : High Speed Not Supported                                  */
  SDIO0_CAPABILITIES0_HIGHSPEED_SUPPORTED = 1,  /*!< SUPPORTED : High Speed Supported                                          */
} SDIO0_CAPABILITIES0_HIGHSPEED_Enum;

