AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ===========================================  SDIO0 CAPABILITIES1 TYPED [6..6]  ============================================ */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_TYPED                                                 */
  SDIO0_CAPABILITIES1_TYPED_SUPPORTED  = 1,     /*!< SUPPORTED : Driver Type D is Supported                                    */
  SDIO0_CAPABILITIES1_TYPED_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : Driver Type D is Not Supported                             */
} SDIO0_CAPABILITIES1_TYPED_Enum;

/* ===========================================  SDIO0 CAPABILITIES1 TYPEC [5..5]  ============================================ */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_TYPEC                                                 */
  SDIO0_CAPABILITIES1_TYPEC_SUPPORTED  = 1,     /*!< SUPPORTED : Driver Type C is Supported                                    */
  SDIO0_CAPABILITIES1_TYPEC_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : Driver Type C is Not Supported                             */
} SDIO0_CAPABILITIES1_TYPEC_Enum;

/* ===========================================  SDIO0 CAPABILITIES1 TYPEA [4..4]  ============================================ */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_TYPEA                                                 */
  SDIO0_CAPABILITIES1_TYPEA_SUPPORTED  = 1,     /*!< SUPPORTED : Driver Type A is Supported                                    */
  SDIO0_CAPABILITIES1_TYPEA_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : Driver Type A is Not Supported                             */
} SDIO0_CAPABILITIES1_TYPEA_Enum;

/* ===========================================  SDIO0 CAPABILITIES1 DDR50 [2..2]  ============================================ */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_DDR50                                                 */
  SDIO0_CAPABILITIES1_DDR50_SUPPORTED  = 1,     /*!< SUPPORTED : DDR50 is Supported                                            */
  SDIO0_CAPABILITIES1_DDR50_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : DDR50 is Not Supported                                     */
} SDIO0_CAPABILITIES1_DDR50_Enum;

/* ===========================================  SDIO0 CAPABILITIES1 SDR104 [1..1]  =========================================== */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_SDR104                                                */
  SDIO0_CAPABILITIES1_SDR104_SUPPORTED = 1,     /*!< SUPPORTED : SDR104 is Not Supported                                       */
  SDIO0_CAPABILITIES1_SDR104_NOTSUPPORTED = 0,  /*!< NOTSUPPORTED : SDR104 is Not Supported                                    */
} SDIO0_CAPABILITIES1_SDR104_Enum;

/* ===========================================  SDIO0 CAPABILITIES1 SDR50 [0..0]  ============================================ */
typedef enum {                                  /*!< SDIO0_CAPABILITIES1_SDR50                                                 */
  SDIO0_CAPABILITIES1_SDR50_SUPPORTED  = 1,     /*!< SUPPORTED : SDR50 is Not Supported                                        */
  SDIO0_CAPABILITIES1_SDR50_NOTSUPPORTED = 0,   /*!< NOTSUPPORTED : SDR50 is Not Supported                                     */
} SDIO0_CAPABILITIES1_SDR50_Enum;

/* =======================================================  MAXIMUM0  ======================================================== */
/* =======================================================  MAXIMUM1  ======================================================== */
/* ==========================================  SDIO0 MAXIMUM1 MAXCURR18V [16..23]  =========================================== */
typedef enum {                                  /*!< SDIO0_MAXIMUM1_MAXCURR18V                                                 */
  SDIO0_MAXIMUM1_MAXCURR18V_1020mA     = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO0_MAXIMUM1_MAXCURR18V_4mA        = 1,     /*!< 4mA : 1020mA, 1 * 4mA                                                     */
} SDIO0_MAXIMUM1_MAXCURR18V_Enum;

/* ===========================================  SDIO0 MAXIMUM1 MAXCURR30V [8..15]  =========================================== */
typedef enum {                                  /*!< SDIO0_MAXIMUM1_MAXCURR30V                                                 */
  SDIO0_MAXIMUM1_MAXCURR30V_1020mA     = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO0_MAXIMUM1_MAXCURR30V_4mA        = 1,     /*!< 4mA : 1020mA, 1 * 4mA                                                     */
} SDIO0_MAXIMUM1_MAXCURR30V_Enum;

/* ===========================================  SDIO0 MAXIMUM1 MAXCURR33V [0..7]  ============================================ */
typedef enum {                                  /*!< SDIO0_MAXIMUM1_MAXCURR33V                                                 */
  SDIO0_MAXIMUM1_MAXCURR33V_1020mA     = 255,   /*!< 1020mA : 1020mA = 255 * 4mA                                               */
  SDIO0_MAXIMUM1_MAXCURR33V_4mA        = 1,     /*!< 4mA : 1020mA, 1 * 4mA                                                     */
} SDIO0_MAXIMUM1_MAXCURR33V_Enum;

/* =========================================================  FORCE  ========================================================= */
/* ===========================================  SDIO0 FORCE FORCEADMAERR [25..25]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEADMAERR                                                  */
  SDIO0_FORCE_FORCEADMAERR_INT         = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEADMAERR_NOINT       = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCEADMAERR_Enum;

/* ===========================================  SDIO0 FORCE FORCEACMDERR [24..24]  =========================================== */
typedef enum {                                  /*!< SDIO0_FORCE_FORCEACMDERR                                                  */
  SDIO0_FORCE_FORCEACMDERR_INT         = 1,     /*!< INT : Interrupt is generated                                              */
  SDIO0_FORCE_FORCEACMDERR_NOINT       = 0,     /*!< NOINT : No interrupt                                                      */
} SDIO0_FORCE_FORCEACMDERR_Enum;

