AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =========================================  SECURESTIMER STMINTEN COMPAREE [4..4]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREE                                            */
  SECURESTIMER_STMINTEN_COMPAREE_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREE_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREE_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPARED [3..3]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPARED                                            */
  SECURESTIMER_STMINTEN_COMPARED_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPARED_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPARED_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREC [2..2]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREC                                            */
  SECURESTIMER_STMINTEN_COMPAREC_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREC_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREC_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREB [1..1]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREB                                            */
  SECURESTIMER_STMINTEN_COMPAREB_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREB_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREB_Enum;

/* =========================================  SECURESTIMER STMINTEN COMPAREA [0..0]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTEN_COMPAREA                                            */
  SECURESTIMER_STMINTEN_COMPAREA_COMPARED = 1,  /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTEN_COMPAREA_DEFAULT = 0,   /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTEN_COMPAREA_Enum;

/* ======================================================  STMINTSTAT  ======================================================= */
/* =======================================  SECURESTIMER STMINTSTAT CAPTURED [12..12]  ======================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_CAPTURED                                          */
  SECURESTIMER_STMINTSTAT_CAPTURED_CAPD_INT = 1,/*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  SECURESTIMER_STMINTSTAT_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.            */
} SECURESTIMER_STMINTSTAT_CAPTURED_Enum;

/* =======================================  SECURESTIMER STMINTSTAT CAPTUREC [11..11]  ======================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_CAPTUREC                                          */
  SECURESTIMER_STMINTSTAT_CAPTUREC_CAPC_INT = 1,/*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  SECURESTIMER_STMINTSTAT_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.            */
} SECURESTIMER_STMINTSTAT_CAPTUREC_Enum;

/* =======================================  SECURESTIMER STMINTSTAT CAPTUREB [10..10]  ======================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_CAPTUREB                                          */
  SECURESTIMER_STMINTSTAT_CAPTUREB_CAPB_INT = 1,/*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  SECURESTIMER_STMINTSTAT_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.            */
} SECURESTIMER_STMINTSTAT_CAPTUREB_Enum;

/* ========================================  SECURESTIMER STMINTSTAT CAPTUREA [9..9]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_CAPTUREA                                          */
  SECURESTIMER_STMINTSTAT_CAPTUREA_CAPA_INT = 1,/*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  SECURESTIMER_STMINTSTAT_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.            */
} SECURESTIMER_STMINTSTAT_CAPTUREA_Enum;

/* ========================================  SECURESTIMER STMINTSTAT OVERFLOW [8..8]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_OVERFLOW                                          */
  SECURESTIMER_STMINTSTAT_OVERFLOW_OFLOW_INT = 1,/*!< OFLOW_INT : Overflow interrupt status bit was set.                       */
  SECURESTIMER_STMINTSTAT_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.       */
} SECURESTIMER_STMINTSTAT_OVERFLOW_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREH [7..7]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREH                                          */
  SECURESTIMER_STMINTSTAT_COMPAREH_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREH_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREH_Enum;

