AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================  SECURESTIMER STMINTSTAT COMPAREG [6..6]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREG                                          */
  SECURESTIMER_STMINTSTAT_COMPAREG_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREG_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREG_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREF [5..5]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREF                                          */
  SECURESTIMER_STMINTSTAT_COMPAREF_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREF_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREF_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREE [4..4]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREE                                          */
  SECURESTIMER_STMINTSTAT_COMPAREE_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREE_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREE_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPARED [3..3]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPARED                                          */
  SECURESTIMER_STMINTSTAT_COMPARED_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPARED_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPARED_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREC [2..2]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREC                                          */
  SECURESTIMER_STMINTSTAT_COMPAREC_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREC_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREC_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREB [1..1]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREB                                          */
  SECURESTIMER_STMINTSTAT_COMPAREB_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREB_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREB_Enum;

/* ========================================  SECURESTIMER STMINTSTAT COMPAREA [0..0]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSTAT_COMPAREA                                          */
  SECURESTIMER_STMINTSTAT_COMPAREA_COMPARED = 1,/*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSTAT_COMPAREA_DEFAULT = 0, /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSTAT_COMPAREA_Enum;

/* =======================================================  STMINTCLR  ======================================================= */
/* =======================================  SECURESTIMER STMINTCLR CAPTURED [12..12]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_CAPTURED                                           */
  SECURESTIMER_STMINTCLR_CAPTURED_CAPD_INT = 1, /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  SECURESTIMER_STMINTCLR_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.             */
} SECURESTIMER_STMINTCLR_CAPTURED_Enum;

/* =======================================  SECURESTIMER STMINTCLR CAPTUREC [11..11]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_CAPTUREC                                           */
  SECURESTIMER_STMINTCLR_CAPTUREC_CAPC_INT = 1, /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  SECURESTIMER_STMINTCLR_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.             */
} SECURESTIMER_STMINTCLR_CAPTUREC_Enum;

/* =======================================  SECURESTIMER STMINTCLR CAPTUREB [10..10]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_CAPTUREB                                           */
  SECURESTIMER_STMINTCLR_CAPTUREB_CAPB_INT = 1, /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  SECURESTIMER_STMINTCLR_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.             */
} SECURESTIMER_STMINTCLR_CAPTUREB_Enum;

/* ========================================  SECURESTIMER STMINTCLR CAPTUREA [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_CAPTUREA                                           */
  SECURESTIMER_STMINTCLR_CAPTUREA_CAPA_INT = 1, /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  SECURESTIMER_STMINTCLR_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.             */
} SECURESTIMER_STMINTCLR_CAPTUREA_Enum;

/* ========================================  SECURESTIMER STMINTCLR OVERFLOW [8..8]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_OVERFLOW                                           */
  SECURESTIMER_STMINTCLR_OVERFLOW_OFLOW_INT = 1,/*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  SECURESTIMER_STMINTCLR_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.        */
} SECURESTIMER_STMINTCLR_OVERFLOW_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREH [7..7]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREH                                           */
  SECURESTIMER_STMINTCLR_COMPAREH_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREH_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREH_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREG [6..6]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREG                                           */
  SECURESTIMER_STMINTCLR_COMPAREG_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREG_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREG_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREF [5..5]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREF                                           */
  SECURESTIMER_STMINTCLR_COMPAREF_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREF_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREF_Enum;

