AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================  SECURESTIMER STMINTCLR COMPAREE [4..4]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREE                                           */
  SECURESTIMER_STMINTCLR_COMPAREE_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREE_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREE_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPARED [3..3]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPARED                                           */
  SECURESTIMER_STMINTCLR_COMPARED_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPARED_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPARED_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREC [2..2]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREC                                           */
  SECURESTIMER_STMINTCLR_COMPAREC_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREC_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREC_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREB [1..1]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREB                                           */
  SECURESTIMER_STMINTCLR_COMPAREB_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREB_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREB_Enum;

/* ========================================  SECURESTIMER STMINTCLR COMPAREA [0..0]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTCLR_COMPAREA                                           */
  SECURESTIMER_STMINTCLR_COMPAREA_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTCLR_COMPAREA_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTCLR_COMPAREA_Enum;

/* =======================================================  STMINTSET  ======================================================= */
/* =======================================  SECURESTIMER STMINTSET CAPTURED [12..12]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_CAPTURED                                           */
  SECURESTIMER_STMINTSET_CAPTURED_CAPD_INT = 1, /*!< CAPD_INT : Capture D interrupt status bit was set.                        */
  SECURESTIMER_STMINTSET_CAPTURED_CAPD_DEFAULT = 0,/*!< CAPD_DEFAULT : Capture D interrupt status default/not set.             */
} SECURESTIMER_STMINTSET_CAPTURED_Enum;

/* =======================================  SECURESTIMER STMINTSET CAPTUREC [11..11]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_CAPTUREC                                           */
  SECURESTIMER_STMINTSET_CAPTUREC_CAPC_INT = 1, /*!< CAPC_INT : CAPTURE C interrupt status bit was set.                        */
  SECURESTIMER_STMINTSET_CAPTUREC_CAPC_DEFAULT = 0,/*!< CAPC_DEFAULT : CAPTURE C interrupt status default/not set.             */
} SECURESTIMER_STMINTSET_CAPTUREC_Enum;

/* =======================================  SECURESTIMER STMINTSET CAPTUREB [10..10]  ======================================== */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_CAPTUREB                                           */
  SECURESTIMER_STMINTSET_CAPTUREB_CAPB_INT = 1, /*!< CAPB_INT : CAPTURE B interrupt status bit was set.                        */
  SECURESTIMER_STMINTSET_CAPTUREB_CAPB_DEFAULT = 0,/*!< CAPB_DEFAULT : CAPTURE B interrupt status default/not set.             */
} SECURESTIMER_STMINTSET_CAPTUREB_Enum;

/* ========================================  SECURESTIMER STMINTSET CAPTUREA [9..9]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_CAPTUREA                                           */
  SECURESTIMER_STMINTSET_CAPTUREA_CAPA_INT = 1, /*!< CAPA_INT : CAPTURE A interrupt status bit was set.                        */
  SECURESTIMER_STMINTSET_CAPTUREA_CAPA_DEFAULT = 0,/*!< CAPA_DEFAULT : CAPTURE A interrupt status default/not set.             */
} SECURESTIMER_STMINTSET_CAPTUREA_Enum;

/* ========================================  SECURESTIMER STMINTSET OVERFLOW [8..8]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_OVERFLOW                                           */
  SECURESTIMER_STMINTSET_OVERFLOW_OFLOW_INT = 1,/*!< OFLOW_INT : Overflow interrupt status bit was set.                        */
  SECURESTIMER_STMINTSET_OVERFLOW_OFLOW_DEFAULT = 0,/*!< OFLOW_DEFAULT : Overflow interrupt status bit default/not set.        */
} SECURESTIMER_STMINTSET_OVERFLOW_Enum;

/* ========================================  SECURESTIMER STMINTSET COMPAREH [7..7]  ========================================= */
typedef enum {                                  /*!< SECURESTIMER_STMINTSET_COMPAREH                                           */
  SECURESTIMER_STMINTSET_COMPAREH_COMPARED = 1, /*!< COMPARED : COUNTER greater than or equal to COMPARE register.             */
  SECURESTIMER_STMINTSET_COMPAREH_DEFAULT = 0,  /*!< DEFAULT : COUNTER less than COMPARE register.                             */
} SECURESTIMER_STMINTSET_COMPAREH_Enum;

