AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ============================================  SECURETIMER GLOBEN ENB2 [2..2]  ============================================= */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ENB2                                                   */
  SECURETIMER_GLOBEN_ENB2_EN           = 1,     /*!< EN : Timer Enabled. TMR2EN enable is used.                                */
  SECURETIMER_GLOBEN_ENB2_DIS          = 0,     /*!< DIS : Disable TIMER 2.                                                    */
} SECURETIMER_GLOBEN_ENB2_Enum;

/* ============================================  SECURETIMER GLOBEN ENB1 [1..1]  ============================================= */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ENB1                                                   */
  SECURETIMER_GLOBEN_ENB1_EN           = 1,     /*!< EN : Timer Enabled. TMR1EN enable is used.                                */
  SECURETIMER_GLOBEN_ENB1_DIS          = 0,     /*!< DIS : Disable TIMER 1.                                                    */
} SECURETIMER_GLOBEN_ENB1_Enum;

/* ============================================  SECURETIMER GLOBEN ENB0 [0..0]  ============================================= */
typedef enum {                                  /*!< SECURETIMER_GLOBEN_ENB0                                                   */
  SECURETIMER_GLOBEN_ENB0_EN           = 1,     /*!< EN : Timer Enabled. TMR0EN enable is used.                                */
  SECURETIMER_GLOBEN_ENB0_DIS          = 0,     /*!< DIS : Disable TIMER 0.                                                    */
} SECURETIMER_GLOBEN_ENB0_Enum;

/* =========================================================  INTEN  ========================================================= */
/* ========================================================  INTSTAT  ======================================================== */
/* ========================================================  INTCLR  ========================================================= */
/* ========================================================  INTSET  ========================================================= */
/* ========================================================  OUTCFG0  ======================================================== */
/* =========================================  SECURETIMER OUTCFG0 OUTCFG3 [24..29]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG0_OUTCFG3                                               */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG0_OUTCFG3_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG0_OUTCFG3_Enum;

/* =========================================  SECURETIMER OUTCFG0 OUTCFG2 [16..21]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG0_OUTCFG2                                               */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG0_OUTCFG2_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG0_OUTCFG2_Enum;

