AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==========================================  SECURETIMER OUTCFG0 OUTCFG1 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG0_OUTCFG1                                               */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG0_OUTCFG1_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG0_OUTCFG1_Enum;

/* ==========================================  SECURETIMER OUTCFG0 OUTCFG0 [0..5]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG0_OUTCFG0                                               */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG0_OUTCFG0_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG0_OUTCFG0_Enum;

/* ========================================================  OUTCFG1  ======================================================== */
/* =========================================  SECURETIMER OUTCFG1 OUTCFG7 [24..29]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG1_OUTCFG7                                               */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG1_OUTCFG7_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG1_OUTCFG7_Enum;

/* =========================================  SECURETIMER OUTCFG1 OUTCFG6 [16..21]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG1_OUTCFG6                                               */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG1_OUTCFG6_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG1_OUTCFG6_Enum;

/* ==========================================  SECURETIMER OUTCFG1 OUTCFG5 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG1_OUTCFG5                                               */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG1_OUTCFG5_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG1_OUTCFG5_Enum;

/* ==========================================  SECURETIMER OUTCFG1 OUTCFG4 [0..5]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG1_OUTCFG4                                               */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER00  = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER01  = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER10  = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER11  = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER20  = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER21  = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER30  = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_TIMER31  = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER0  = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER1  = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER2  = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER3  = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER4  = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER5  = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER6  = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_STIMER7  = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG1_OUTCFG4_DISABLED = 63,    /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG1_OUTCFG4_Enum;

