AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ========================================================  OUTCFG3  ======================================================== */
/* =========================================  SECURETIMER OUTCFG3 OUTCFG15 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG3_OUTCFG15                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG3_OUTCFG15_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG3_OUTCFG15_Enum;

/* =========================================  SECURETIMER OUTCFG3 OUTCFG14 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG3_OUTCFG14                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG3_OUTCFG14_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG3_OUTCFG14_Enum;

/* =========================================  SECURETIMER OUTCFG3 OUTCFG13 [8..13]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG3_OUTCFG13                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG3_OUTCFG13_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG3_OUTCFG13_Enum;

