AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ==========================================  SECURETIMER OUTCFG8 OUTCFG32 [0..5]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG8_OUTCFG32                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG8_OUTCFG32_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG8_OUTCFG32_Enum;

/* ========================================================  OUTCFG9  ======================================================== */
/* =========================================  SECURETIMER OUTCFG9 OUTCFG39 [24..29]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG9_OUTCFG39                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG9_OUTCFG39_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG9_OUTCFG39_Enum;

/* =========================================  SECURETIMER OUTCFG9 OUTCFG38 [16..21]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG9_OUTCFG38                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER00 = 0,     /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER01 = 1,     /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER10 = 2,     /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER11 = 3,     /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER20 = 4,     /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER21 = 5,     /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER30 = 6,     /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_TIMER31 = 7,     /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER0 = 8,     /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER1 = 9,     /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER2 = 10,    /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER3 = 11,    /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER4 = 12,    /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER5 = 13,    /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER6 = 14,    /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_STIMER7 = 15,    /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG9_OUTCFG38_DISABLED = 63,   /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG9_OUTCFG38_Enum;

