AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* =========================================  SECURETIMER OUTCFG27 OUTCFG108 [0..5]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG27_OUTCFG108                                            */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG27_OUTCFG108_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG27_OUTCFG108_Enum;

/* =======================================================  OUTCFG28  ======================================================== */
/* ========================================  SECURETIMER OUTCFG28 OUTCFG115 [24..29]  ======================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG28_OUTCFG115                                            */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG28_OUTCFG115_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG28_OUTCFG115_Enum;

/* ========================================  SECURETIMER OUTCFG28 OUTCFG114 [16..21]  ======================================== */
typedef enum {                                  /*!< SECURETIMER_OUTCFG28_OUTCFG114                                            */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG28_OUTCFG114_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG28_OUTCFG114_Enum;

/* ========================================  SECURETIMER OUTCFG28 OUTCFG113 [8..13]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG28_OUTCFG113                                            */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG28_OUTCFG113_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG28_OUTCFG113_Enum;

/* =========================================  SECURETIMER OUTCFG28 OUTCFG112 [0..5]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_OUTCFG28_OUTCFG112                                            */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER00 = 0,   /*!< TIMER00 : Output is Timer 0, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER01 = 1,   /*!< TIMER01 : Output is Timer 0, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER10 = 2,   /*!< TIMER10 : Output is Timer 1, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER11 = 3,   /*!< TIMER11 : Output is Timer 1, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER20 = 4,   /*!< TIMER20 : Output is Timer 2, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER21 = 5,   /*!< TIMER21 : Output is Timer 2, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER30 = 6,   /*!< TIMER30 : Output is Timer 3, output 0                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_TIMER31 = 7,   /*!< TIMER31 : Output is Timer 3, output 1                                     */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER0 = 8,   /*!< STIMER0 : Output is STimer 0                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER1 = 9,   /*!< STIMER1 : Output is STimer 1                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER2 = 10,  /*!< STIMER2 : Output is STimer 2                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER3 = 11,  /*!< STIMER3 : Output is STimer 3                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER4 = 12,  /*!< STIMER4 : Output is STimer 4                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER5 = 13,  /*!< STIMER5 : Output is STimer 5                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER6 = 14,  /*!< STIMER6 : Output is STimer 6                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_STIMER7 = 15,  /*!< STIMER7 : Output is STimer 7                                              */
  SECURETIMER_OUTCFG28_OUTCFG112_DISABLED = 63, /*!< DISABLED : Output is disabled                                             */
} SECURETIMER_OUTCFG28_OUTCFG112_Enum;

