AmbiqAI/nsx-ambiq-sdk/modules/nsx-ambiqsuite/sdk/CMSIS/AmbiqMicro/Include/apollo510L_generic.h
/* ===========================================  SECURETIMER CTRL1 TMR1POL1 [3..3]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL1_TMR1POL1                                                */
  SECURETIMER_CTRL1_TMR1POL1_NORMAL    = 0,     /*!< NORMAL : The polarity of the TMR1OUT1 pin is the same as the
                                                     timer output.                                                             */
  SECURETIMER_CTRL1_TMR1POL1_INVERTED  = 1,     /*!< INVERTED : The polarity of the TMR1OUT1 pin is the inverse of
                                                     the timer output.                                                         */
} SECURETIMER_CTRL1_TMR1POL1_Enum;

/* ===========================================  SECURETIMER CTRL1 TMR1POL0 [2..2]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL1_TMR1POL0                                                */
  SECURETIMER_CTRL1_TMR1POL0_NORMAL    = 0,     /*!< NORMAL : The polarity of the TMR1OUT0 pin is the same as the
                                                     timer output.                                                             */
  SECURETIMER_CTRL1_TMR1POL0_INVERTED  = 1,     /*!< INVERTED : The polarity of the TMR1OUT0 pin is the inverse of
                                                     the timer output.                                                         */
} SECURETIMER_CTRL1_TMR1POL0_Enum;

/* ===========================================  SECURETIMER CTRL1 TMR1CLR [1..1]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL1_TMR1CLR                                                 */
  SECURETIMER_CTRL1_TMR1CLR_CLEAR      = 1,     /*!< CLEAR : When written to a 1, the timer will automatically be
                                                     cleared to its reset state # (0 for count up counter, CMP0
                                                     for down counter)                                                         */
  SECURETIMER_CTRL1_TMR1CLR_DEFAULT    = 0,     /*!< DEFAULT : Default value set to 0. Timer works normally.                   */
} SECURETIMER_CTRL1_TMR1CLR_Enum;

/* ============================================  SECURETIMER CTRL1 TMR1EN [0..0]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL1_TMR1EN                                                  */
  SECURETIMER_CTRL1_TMR1EN_DIS         = 0,     /*!< DIS : Counter/Timer 1 Disable.                                            */
  SECURETIMER_CTRL1_TMR1EN_EN          = 1,     /*!< EN : Counter/Timer 1 Enable.                                              */
} SECURETIMER_CTRL1_TMR1EN_Enum;

/* ========================================================  TIMER1  ========================================================= */
/* =======================================================  TMR1CMP0  ======================================================== */
/* =======================================================  TMR1CMP1  ======================================================== */
/* =========================================================  MODE1  ========================================================= */
/* =========================================  SECURETIMER MODE1 TMR1TRIGSEL [8..15]  ========================================= */
typedef enum {                                  /*!< SECURETIMER_MODE1_TMR1TRIGSEL                                             */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR00  = 0,     /*!< TMR00 : Trigger source is TIMER 0 Output 0                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR01  = 1,     /*!< TMR01 : Trigger source is TIMER 0 Output 1                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR10  = 2,     /*!< TMR10 : Trigger source is TIMER 1 Output 0                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR11  = 3,     /*!< TMR11 : Trigger source is TIMER 1 Output 1                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR20  = 4,     /*!< TMR20 : Trigger source is TIMER 2 Output 0                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR21  = 5,     /*!< TMR21 : Trigger source is TIMER 2 Output 1                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR30  = 6,     /*!< TMR30 : Trigger source is TIMER 3 Output 0                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_TMR31  = 7,     /*!< TMR31 : Trigger source is TIMER 3 Output 1                                */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP00 = 48, /*!< STMRCMP00 : Trigger source is STIMER Compare 0                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP10 = 49, /*!< STMRCMP10 : Trigger source is STIMER Compare 1                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP20 = 50, /*!< STMRCMP20 : Trigger source is STIMER Compare 2                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP30 = 51, /*!< STMRCMP30 : Trigger source is STIMER Compare 3                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP40 = 52, /*!< STMRCMP40 : Trigger source is STIMER Compare 4                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP50 = 53, /*!< STMRCMP50 : Trigger source is STIMER Compare 5                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP60 = 54, /*!< STMRCMP60 : Trigger source is STIMER Compare 6                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCMP70 = 55, /*!< STMRCMP70 : Trigger source is STIMER Compare 7                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCAP00 = 56, /*!< STMRCAP00 : Trigger source is STIMER Capture 0                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCAP10 = 57, /*!< STMRCAP10 : Trigger source is STIMER Capture 1                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCAP20 = 58, /*!< STMRCAP20 : Trigger source is STIMER Capture 2                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_STMRCAP30 = 59, /*!< STMRCAP30 : Trigger source is STIMER Capture 3                            */
  SECURETIMER_MODE1_TMR1TRIGSEL_GPIO0  = 128,   /*!< GPIO0 : Trigger source is GPIO #0                                         */
  SECURETIMER_MODE1_TMR1TRIGSEL_GPIOn  = 129,   /*!< GPIOn : GPIO #n is the trigger source where n ranges from 1
                                                     thru 118. The values for GPIO1 - GPIO118 are in the range
                                                     0x81 - 0xF6. i.e., GPIO0 + n                                              */
  SECURETIMER_MODE1_TMR1TRIGSEL_GPIO119 = 247,  /*!< GPIO119 : Trigger source is GPIO #119.                                    */
} SECURETIMER_MODE1_TMR1TRIGSEL_Enum;

/* ======================================================  TMR1LMTVAL  ======================================================= */
/* =========================================================  CTRL2  ========================================================= */
/* =========================================  SECURETIMER CTRL2 TMR2TMODE [16..17]  ========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2TMODE                                               */
  SECURETIMER_CTRL2_TMR2TMODE_DIS      = 0,     /*!< DIS : Trigger not enabled                                                 */
  SECURETIMER_CTRL2_TMR2TMODE_RISE     = 1,     /*!< RISE : Trigger on rising edge of TRIGSEL source                           */
  SECURETIMER_CTRL2_TMR2TMODE_FALL     = 2,     /*!< FALL : Trigger on falling edge of TRIGSEL source                          */
  SECURETIMER_CTRL2_TMR2TMODE_BOTH     = 3,     /*!< BOTH : Trigger on either edge of TRIGSEL source                           */
} SECURETIMER_CTRL2_TMR2TMODE_Enum;

/* ===========================================  SECURETIMER CTRL2 TMR2CLK [8..15]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2CLK                                                 */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV4  = 0,     /*!< HFRC_DIV4 : Clock source is the HFRC / 4                                  */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV16 = 1,     /*!< HFRC_DIV16 : Clock source is HFRC / 16                                    */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV64 = 2,     /*!< HFRC_DIV64 : Clock source is HFRC / 64                                    */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV256 = 3,    /*!< HFRC_DIV256 : Clock source is HFRC / 256                                  */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV1024 = 4,   /*!< HFRC_DIV1024 : Clock source is HFRC / 1024                                */
  SECURETIMER_CTRL2_TMR2CLK_HFRC_DIV4K = 5,     /*!< HFRC_DIV4K : Clock source is HFRC / 4096                                  */
  SECURETIMER_CTRL2_TMR2CLK_LFRC       = 6,     /*!< LFRC : Clock source is LFRC                                               */
  SECURETIMER_CTRL2_TMR2CLK_LFRC_DIV32 = 7,     /*!< LFRC_DIV32 : Clock source is LFRC / 32                                    */
  SECURETIMER_CTRL2_TMR2CLK_LFRC_DIV1K = 8,     /*!< LFRC_DIV1K : Clock source is LFRC / 1024                                  */
  SECURETIMER_CTRL2_TMR2CLK_XT         = 9,     /*!< XT : Clock source is the XT (uncalibrated).                               */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV4    = 10,    /*!< XT_DIV4 : Clock source is XT / 4                                          */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV16   = 11,    /*!< XT_DIV16 : Clock source is XT / 16                                        */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV32   = 12,    /*!< XT_DIV32 : Clock source is XT / 32                                        */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV1024 = 13,    /*!< XT_DIV1024 : Clock source is XT / 128                                     */
  SECURETIMER_CTRL2_TMR2CLK_RTC_100HZ  = 14,    /*!< RTC_100HZ : Clock source is 100 Hz from the current RTC oscillator.       */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV64   = 15,    /*!< XT_DIV64 : Clock source is XT / 64                                        */
  SECURETIMER_CTRL2_TMR2CLK_XT_DIV128  = 16,    /*!< XT_DIV128 : Clock source is XT / 128                                      */
  SECURETIMER_CTRL2_TMR2CLK_PLLVCO_POSTDIV = 17,/*!< PLLVCO_POSTDIV : Clock source is PLLVCO POSTDIV                           */
  SECURETIMER_CTRL2_TMR2CLK_RF_XTAL    = 21,    /*!< RF_XTAL : Clock source is RF XTAL 48MHz                                   */
  SECURETIMER_CTRL2_TMR2CLK_RF_XTAL_DIV2 = 22,  /*!< RF_XTAL_DIV2 : Clock source is RF XTAL 24MHz (DIV/2)                      */
  SECURETIMER_CTRL2_TMR2CLK_RF_XTAL_DIV4 = 23,  /*!< RF_XTAL_DIV4 : Clock source is RF XTAL 12MHz (DIV/4)                      */
  SECURETIMER_CTRL2_TMR2CLK_XTHS_EXTREF_CLK = 24,/*!< XTHS_EXTREF_CLK : Clock source is External REF CLK                       */
  SECURETIMER_CTRL2_TMR2CLK_XTHS_EXTREF_CLK_DIV2 = 25,/*!< XTHS_EXTREF_CLK_DIV2 : Clock source is External REF CLK DIV/2       */
  SECURETIMER_CTRL2_TMR2CLK_XTHS_EXTREF_CLK_DIV4 = 26,/*!< XTHS_EXTREF_CLK_DIV4 : Clock source is External REF CLK DIV/4       */
  SECURETIMER_CTRL2_TMR2CLK_XTHS_EXTREF_CLK_DIV8 = 27,/*!< XTHS_EXTREF_CLK_DIV8 : Clock source is External REF CLK DIV/8       */
  SECURETIMER_CTRL2_TMR2CLK_BUCKC      = 28,    /*!< BUCKC : Clock source is Buck VDDC TON pulses.                             */
  SECURETIMER_CTRL2_TMR2CLK_BUCKF      = 29,    /*!< BUCKF : Clock source is Buck VDDF TON pulses.                             */
  SECURETIMER_CTRL2_TMR2CLK_BUCKS      = 30,    /*!< BUCKS : Clock source is Buck VDDS TON pulses.                             */
  SECURETIMER_CTRL2_TMR2CLK_BUCKC_LV   = 31,    /*!< BUCKC_LV : Clock source is Buck VDDC_LV TON pulses.                       */
  SECURETIMER_CTRL2_TMR2CLK_TMR00      = 32,    /*!< TMR00 : Clock source is TIMER 0 Output 0                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR01      = 33,    /*!< TMR01 : Clock source is TIMER 0 Output 1                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR10      = 34,    /*!< TMR10 : Clock source is TIMER 1 Output 0                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR11      = 35,    /*!< TMR11 : Clock source is TIMER 1 Output 1                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR20      = 36,    /*!< TMR20 : Clock source is TIMER 2 Output 0                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR21      = 37,    /*!< TMR21 : Clock source is TIMER 2 Output 1                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR30      = 38,    /*!< TMR30 : Clock source is TIMER 3 Output 0                                  */
  SECURETIMER_CTRL2_TMR2CLK_TMR31      = 39,    /*!< TMR31 : Clock source is TIMER 3 Output 1                                  */
  SECURETIMER_CTRL2_TMR2CLK_GPIO0      = 128,   /*!< GPIO0 : GPIO #0 is clock source                                           */
  SECURETIMER_CTRL2_TMR2CLK_GPIOn      = 129,   /*!< GPIOn : GPIO #n is clock source where n ranges from 1 thru 118.
                                                     The values for GPIO1 - GPIO118 are in the range 0x81 -
                                                     0xF6. i.e., GPIO0 + n                                                     */
  SECURETIMER_CTRL2_TMR2CLK_GPIO119    = 247,   /*!< GPIO119 : GPIO #119 is clock source                                       */
} SECURETIMER_CTRL2_TMR2CLK_Enum;

/* ============================================  SECURETIMER CTRL2 TMR2FN [4..7]  ============================================ */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2FN                                                  */
  SECURETIMER_CTRL2_TMR2FN_EDGE        = 1,     /*!< EDGE : This Mode generates a single edge on OUT0/OUT1 when TIMER
                                                     value hits CMP0/CMP1 respectively. OUT[0]=0, counter increments
                                                     to CMP0, OUT[0]=1, counter stops. OUT[1] follows CMP1.                    */
  SECURETIMER_CTRL2_TMR2FN_UPCOUNT     = 2,     /*!< UPCOUNT : This mode is run up counter generating a pulse on
                                                     CMP. OUT[0]/OUT[1] is pulsed for one source clock period
                                                     when TIMER matches CMP0/CMP1 respectively. Timer repeats
                                                     for TMR_LMT iterations.                                                   */
  SECURETIMER_CTRL2_TMR2FN_PWM         = 4,     /*!< PWM : PWM mode. OUT0 and OUT1 are waveforms, and not just one
                                                     clock pulse. CMP1 dictates the low phase of the output
                                                     and CMP0 dictates the period. OUT[1]=~OUT[0].                             */
  SECURETIMER_CTRL2_TMR2FN_SINGLEPATTERN = 12,  /*!< SINGLEPATTERN : Single pattern. OUT0=CMP0[TIMER], OUT1=CMP1[TIMER].
                                                     LMT field specifies length of pattern. When LMT GT 32 OUT0
                                                     and OUT1 is the same 64-bit pattern consisting of concatenated
                                                     CMP1,CMP0. When LMT LT 32 OUT0 and OUT1 are independent.
                                                     Both OUT0 and OUT1 can be inverted individually applications
                                                     with POL0/POL1 = 0x1.                                                     */
  SECURETIMER_CTRL2_TMR2FN_REPEATPATTERN = 13,  /*!< REPEATPATTERN : Repeated pattern. Like SINGLEPATTERN mode, but
                                                     pattern repeats after reaching LMT.                                       */
} SECURETIMER_CTRL2_TMR2FN_Enum;

/* ===========================================  SECURETIMER CTRL2 TMR2POL1 [3..3]  =========================================== */
typedef enum {                                  /*!< SECURETIMER_CTRL2_TMR2POL1                                                */
  SECURETIMER_CTRL2_TMR2POL1_NORMAL    = 0,     /*!< NORMAL : The polarity of the TMR2OUT1 pin is the same as the
                                                     timer output.                                                             */
  SECURETIMER_CTRL2_TMR2POL1_INVERTED  = 1,     /*!< INVERTED : The polarity of the TMR2OUT1 pin is the inverse of
                                                     the timer output.                                                         */
} SECURETIMER_CTRL2_TMR2POL1_Enum;

